{
    "Monaja": [
        {
            "TitleA": "مناجاة التائبين",
            "TitleE": "Soliloquy of the Repentant",
            "NameA": " إِلَهِي أَلْبَسَتْنِي الْخَطَايَا ثَوْبَ مَذَلَّتِي ، وَ جَلَّلَنِي التَّبَاعُدُ مِنْكَ لِبَاسَ مَسْكَنَتِي ، وَ أَمَاتَ قَلْبِي عَظِيمَ جِنَايَتِي ، فَأَحْيِهِ بِتَوْبَةٍ مِنْكَ يَا أَمَلِي وَ بُغْيَتِي ، وَ يَا سُؤْلِي وَ مُنْيَتِي ، فَوَ عِزَّتِكَ مَا أَجِدُ لِذُنُوبِي سِوَاكَ غَافِراً ، وَ لَا أَرَى لِكَسْرِي غَيْرَكَ جَابِراً ، وَ قَدْ خَضَعْتُ بِالْإِنَابَةِ إِلَيْكَ ، وَ عَنَوْتُ بِالِاسْتِكَانَةِ لَدَيْكَ ، فَإِنْ طَرَدْتَنِي مِنْ بَابِكَ فَبِمَنْ أَلُوذُ ، وَ إِنْ رَدَدْتَنِي عَنْ جَنَابِكَ فَبِمَنْ أَعُوذُ ، فَوَا أَسَفَا مِنْ خَجْلَتِي وَ افْتِضَاحِي ، وَ وَا لَهْفَا مِنْ سُوءِ عَمَلِي وَ اجْتِرَاحِي ، أَسْأَلُكَ يَا غَافِرَ الذَّنْبِ الْكَبِيرِ ، وَ يَا جَابِرَ الْعَظْمِ الْكَسِيرِ ، أَنْ تَهَبَ لِي مُوبِقَاتِ الْجَرَائِرِ ، وَ تَسْتُرَ عَلَيَّ فَاضِحَاتِ السَّرَائِرِ ، وَ لَا تُخْلِنِي فِي مَشْهَدِ الْقِيَامَةِ مِنْ بَرْدِ عَفْوِكَ وَ غَفْرِكَ ، وَ لَا تُعْرِنِي مِنْ جَمِيلِ صَفْحِكَ وَ سَتْرِكَ . إِلَهِي ظَلِّلْ عَلَى ذُنُوبِي غَمَامَ رَحْمَتِكَ ، وَ أَرْسِلْ عَلَى عُيُوبِي سَحَابَ رَأْفَتِكَ .إِلَهِي هَلْ يَرْجِعُ الْعَبْدُ الْآبِقُ إِلَّا إِلَى مَوْلَاهُ ، أَمْ هَلْ يُجِيرُهُ مِنْ سَخَطِهِ أَحَدٌ سِوَاهُ . إِلَهِي إِنْ كَانَ النَّدَمُ عَلَى الذَّنْبِ تَوْبَةً ، فَإِنِّي وَ عِزَّتِكَ مِنَ النَّادِمِينَ ، وَ إِنْ كَانَ الِاسْتِغْفَارُ مِنَ الْخَطِيئَةِ حِطَّةً ، فَإِنِّي لَكَ مِنَ الْمُسْتَغْفِرِينَ ، لَكَ الْعُتْبَى حَتَّى تَرْضَى .إِلَهِي بِقُدْرَتِكَ عَلَيَّ تُبْ عَلَيَّ ، وَ بِحِلْمِكَ عَنِّي اعْفُ عَنِّي ، وَ بِعِلْمِكَ بِي ارْفُقْ بِي . إِلَهِي أَنْتَ الَّذِي فَتَحْتَ لِعِبَادِكَ بَاباً إِلَى عَفْوِكَ سَمَّيْتَهُ التَّوْبَةَ ، فَقُلْتَ تُوبُوا إِلَى اللَّهِ تَوْبَةً نَصُوحاً ، فَمَا عُذْرُ مَنْ أَغْفَلَ دُخُولَ الْبَابِ بَعْدَ فَتْحِهِ .إِلَهِي إِنْ كَانَ قَبُحَ الذَّنْبُ مِنْ عَبْدِكَ ، فَلْيَحْسُنِ الْعَفْوُ مِنْ عِنْدِكَ .إِلَهِي مَا أَنَا بِأَوَّلِ مَنْ عَصَاكَ فَتُبْتَ عَلَيْهِ ، وَ تَعَرَّضَ لِمَعْرُوفِكَ فَجُدْتَ عَلَيْهِ ، يَا مُجِيبَ الْمُضْطَرِّ ، يَا كَاشِفَ الضُّرِّ ، يَا عَظِيمَ الْبِرِّ ، يَا عَلِيماً بِمَا فِي السِّرِّ ، يَا جَمِيلَ السَّتْرِ ، اسْتَشْفَعْتُ بِجُودِكَ وَ كَرَمِكَ إِلَيْكَ ، وَ تَوَسَّلْتُ بِحَنَانِكَ [ بِجَنَابِكَ ] وَ تَرَحُّمِكَ لَدَيْكَ ، فَاسْتَجِبْ دُعَائِي ، وَ لَا تُخَيِّبْ فِيكَ رَجَائِي ، وَ تَقَبَّلْ تَوْبَتِي ، وَ كَفِّرْ خَطِيئَتِي ، بِمَنِّكَ وَ رَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ ",
            "NameE": " the Most Gracious, the Most Merciful\nMy God, sins have clothed me with the garment of my humiliation, and separation from You has clothed me with the garment of my affliction, and my heart has died with great rage. Come, I will revive him with your repentance, O my hope and my desire, my request and my wish, by Your glory I find no excuse for my sins except You. Forgiving, and I do not see anyone else as someone who can repair my brokenness. I have submitted to you on behalf of you, and I intend to remain in peace before you. If you expel me from your door, then to whom? So, if You turn me away from Your side, in whom can I seek refuge? So sorry for my shyness and exposure, and anxious about my bad deeds and my insolence. I ask you, O Forgiver of great sins, and O He who restores broken bones, to bestow upon me the reparations of transgressions, and to cover for me the shameful things of my secrets, and not to hide In the scene of Resurrection, I will feel the coldness of Your pardon and forgiveness, and do not strip me of the beauty of Your forgiveness and protection. My God, overshadow my sins. The clouds of Your mercy, and send upon my faults the clouds of Your compassion. My God, will the ungrateful servant return except to his Master, or will anyone save him from his wrath but Oh. My God, if remorse for a sin is repentance, then I, by Your honor, am one of those who regret, and if seeking forgiveness for a sin is humiliation, then I am one of those who ask for forgiveness. Yes, it is Yours to admonish until You are satisfied. My God, by Your power over me, accept my repentance, pardon me by Your forgiveness of me, and be kind to me by Your knowledge of me. My God, you are the one who opened for your servants a door to your forgiveness, which you called repentance. So you said, “Repent to God with sincere repentance.” What excuse is he who neglects to enter the heart? Father after its conquest. My God, if the ugliness of sin was on the part of your servant, then let it be good for you to pardon him. My God, I am not the first to disobey you, so you repent of him. And I sought Your kindness, and I sought it. O Responder of the distressed, O Removal of harm, O Magnificent of righteousness, O Knower of what is secret, O Beautiful of concealment, I sought your intercession. Your kindness and generosity to you, and I begged you for your tenderness [by your side] and your mercy with you, so answer my supplication, and do not be disappointed in you. My hope, and accept my repentance, and expiate my sin, by Your grace and mercy, O Most Merciful of those who show mercy."
        },
        {
            "TitleA": "مُنَاجَاةُ الشاكين",
            "TitleE": "Soliloquy of the complainants",
            "NameA": "إِلَهِي إِلَيْكَ أَشْكُو نَفْساً بِالسُّوءِ أَمَّارَةً ، وَ إِلَى الْخَطِيئَةِ مُبَادِرَةً ، وَ بِمَعَاصِيكَ مُولَعَةً ، وَ بِسَخَطِكَ مُتَعَرِّضَةً ، تَسْلُكُ بِي مَسَالِكَ الْمَهَالِكِ ، وَ تَجْعَلُنِي عِنْدَكَ أَهْوَنَ هَالِكٍ ، كَثِيرَةَ الْعِلَلِ ، طَوِيلَةَ الْأَمَلِ ، إِنْ مَسَّهَا الشَّرُّ تَجْزَعُ ، وَ إِنْ مَسَّهَا الْخَيْرُ تَمْنَعُ ، مَيَّالَةً إِلَى اللَّعْبِ وَ اللَّهْوِ ، مَمْلُوَّةً بِالْغَفْلَةِ وَ السَّهْوِ ، تُسْرِعُ بِي إِلَى الْحَوْبَةِ ، وَ تُسَوِّفُنِي بِالتَّوْبَةِ . إِلَهِي أَشْكُو إِلَيْكَ عَدُوّاً يُضِلُّنِي ، وَ شَيْطَاناً يُغْوِينِي ، قَدْ مَلَأَ بِالْوَسْوَاسِ صَدْرِي ، وَ أَحَاطَتْ هَوَاجِسُهُ بِقَلْبِي ، يُعَاضِدُ لِيَ الْهَوَى ، وَ يُزَيِّنُ لِي حُبَّ الدُّنْيَا ، وَ يَحُولُ بَيْنِي وَ بَيْنَ الطَّاعَةِ وَ الزُّلْفَى . إِلَهِي إِلَيْكَ أَشْكُو قَلْباً قَاسِياً مَعَ الْوَسْوَاسِ مُتَقَلِّباً ، وَ بِالرَّيْنِ وَ الطَّبْعِ مُتَلَبِّساً ، وَ عَيْناً عَنِ الْبُكَاءِ مِنْ خَوْفِكَ جَامِدَةً ، وَ إِلَى مَا يَسُرُّهَا طَامِحَةً . إِلَهِي لَا حَوْلَ لِي وَ لَا قُوَّةَ إِلَّا بِقُدْرَتِكَ ، وَ لَا نَجَاةَ لِي مِنْ مَكَارِهِ الدُّنْيَا إِلَّا بِعِصْمَتِكَ ، فَأَسْأَلُكَ بِبَلَاغَةِ حِكْمَتِكَ وَ نَفَاذِ مَشِيَّتِكَ ، أَنْ لَا تَجْعَلَنِي لِغَيْرِ جُودِكَ مُتَعَرِّضاً ، وَ لَا تُصَيِّرَنِي لِلْفِتَنِ غَرَضاً ، وَ كُنْ لِي عَلَى الْأَعْدَاءِ نَاصِراً ، وَ عَلَى الْمَخَازِي وَ الْعُيُوبِ سَاتِراً ، وَ مِنَ الْبَلَايَا وَاقِياً ، وَ عَنِ الْمَعَاصِي عَاصِماً ، بِرَأْفَتِكَ وَ رَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ ",
            "NameE": " the Most Gracious, the Most Merciful\nMy God, to You I complain of a soul of evil, and of sin, of premeditation, of your disobedience, and of your wrath I exasperate. You take me on paths of destruction, and you make me the most despicable to perish with you, with many ailments, long in hope, if he touches her. It is afraid of evil, and if good touches it, it refrains. It is inclined to play and amusement, full of heedlessness and forgetfulness. It hastens me to love and procrastinates me. With repentance, my God, I complain to you about an enemy who is misleading me, and a devil who is tempting me, who has filled my chest with obsessions, and whose obsessions have surrounded my heart, who supports My inclinations are mine, and He adorns for me the love of the world, and comes between me and obedience and self-control. My God, to You I complain of a hard heart with a volatile obsessiveness, and of piety. And the nature is ambiguous, and the eyes are fixed from crying out of your fear, and they are fixed on what pleases them. My God, I have no power or strength except through Your power, and there is no escape for me from the calamities of this world except through Your protection, so I ask You with the eloquence of Your wisdom and without I ask You to do not make me exposed to anything other than Your goodness, and do not make me a target for temptations, and be my helper over enemies and those who disgrace me. And a covering of faults, a protector from calamities, and a protector from transgressions, with Your compassion and mercy, O Most Merciful of the Merciful."
        },
        {
            "TitleA": "مناجاة الخائفين",
            "TitleE": "Speaking to the Fearful",
            "NameA": "إِلَهِي أَ تُرَاكَ بَعْدَ الْإِيمَانِ بِكَ تُعَذِّبُنِي ، أَمْ بَعْدَ حُبِّي إِيَّاكَ تُبَعِّدُنِي ، أَمْ مَعَ رَجَائِي لِرَحْمَتِكَ وَ صَفْحِكَ تَحْرِمُنِي ، أَمْ مَعَ اسْتِجَارَتِي بِعَفْوِكَ تُسْلِمُنِي ، حَاشَا لِوَجْهِكَ الْكَرِيمِ أَنْ تُخَيِّبَنِي ، لَيْتَ شِعْرِي أَ لِلشَّقَاءِ وَلَدَتْنِي أُمِّي ، أَمْ لِلْعَنَاءِ رَبَّتْنِي ، فَلَيْتَهَا لَمْ تَلِدْنِي وَ لَمْ تُرَبِّنِي ، وَ لَيْتَنِي عَلِمْتُ أَ مِنْ أَهْلِ السَّعَادَةِ جَعَلْتَنِي ، وَ بِقُرْبِكَ وَ جِوَارِكَ خَصَصْتَنِي ، فَتَقِرَّ بِذَلِكَ عَيْنِي وَ تَطْمَئِنَّ لَهُ نَفْسِي \nإِلَهِي هَلْ تُسَوِّدُ وُجُوهاً خَرَّتْ سَاجِدَةً لِعَظَمَتِكَ ، أَوْ تُخْرِسُ أَلْسِنَةً نَطَقَتْ بِالثَّنَاءِ عَلَى مَجْدِكَ وَ جَلَالَتِكَ ، أَوْ تَطْبَعُ عَلَى قُلُوبٍ انْطَوَتْ عَلَى مَحَبَّتِكَ ، أَوْ تُصِمُ أَسْمَاعاً تَلَذَّذَتْ بِسَمَاعِ ذِكْرِكَ فِي إِرَادَتِكَ ، أَوْ تَغُلُّ أَكُفّاً رَفَعَتْهَا الْآمَالُ إِلَيْكَ رَجَاءَ رَأْفَتِكَ ، أَوْ تُعَاقِبُ أَبْدَاناً عَمِلَتْ بِطَاعَتِكَ حَتَّى نَحِلَتْ فِي مُجَاهَدَتِكَ ، أَوْ تُعَذِّبُ أَرْجُلًا سَعَتْ فِي عِبَادَتِكَ \nإِلَهِي لَا تُغْلِقْ عَلَى مُوَحِّدِيكَ أَبْوَابَ رَحْمَتِكَ ، وَ لَا تَحْجُبْ مُشْتَاقِيكَ عَنِ النَّظَرِ إِلَى جَمِيلِ رُؤْيَتِكَ .\nإِلَهِي نَفْسٌ أَعْزَزْتَهَا بِتَوْحِيدِكَ كَيْفَ تُذِلُّهَا بِمَهَانَةِ هِجْرَانِكَ ، وَ ضَمِيرٌ انْعَقَدَ عَلَى مَوَدَّتِكَ كَيْفَ تُحْرِقُهُ بِحَرَارَةِ نِيرَانِكَ .\nإِلَهِي أَجِرْنِي مِنْ أَلِيمِ غَضَبِكَ وَ عَظِيمِ سَخَطِكَ ، يَا حَنَّانُ يَا مَنَّانُ يَا رَحِيمُ يَا رَحْمَانُ يَا جَبَّارُ يَا قَهَّارُ يَا غَفَّارُ يَا سَتَّارُ ، نَجِّنِي بِرَحْمَتِكَ مِنْ عَذَابِ النَّارِ ، وَ فَضِيحَةِ الْعَارِ ، إِذَا امْتَازَ الْأَخْيَارُ مِنَ الْأَشْرَارِ ، وَ حالت [ هَالَتِ ] الْأَهْوَالُ ، وَ قَرُبَ الْمُحْسِنُونَ ، وَ بَعُدَ الْمُسِيئُونَ ، وَ وُفِّيَتْ كُلُّ نَفْسٍ ما كَسَبَتْ وَ هُمْ لا يُظْلَمُونَ ",
            "NameE": " the Most Gracious, the Most Merciful My God, do I see you torturing me after believing in you, or pushing me away after my love for you, or with my hope in your mercy and forgiveness? Would you deprive me, or would you spare me, despite my seeking your pardon? Far be it from your gracious face to disappoint me. I wish that you had given me birth to misery. My mother, a mother of hardship who raised me. I wish she had not given birth to me and raised me, and I wish I had known whether you had made me among the people of happiness, and by your nearness and your closeness you had designated me. So my eyes will be pleased by this and my soul will be at peace in Him. My God, will You blacken faces that have bowed down in prostration to Your greatness, or silence tongues that speak in praise? Your glory and majesty, or imprints on hearts that have embraced your love, or deafens ears that enjoyed hearing your remembrance of your will, or deceives Hands raised to you in hope of your compassion, or punishing bodies that worked in obedience to you until they dared to struggle with you, or torturing legs that strived Worshiping you my God Do not close the doors of Your mercy to those who unite with You, and do not block those who yearn for You from looking at the beauty of Your vision. How can you humiliate her with the humiliation of your abandonment, and how can you burn a conscience that is fixed on your affection with the heat of your fire? Your anger, oh Tenderness, O Benevolent, O Merciful, O Most Merciful, O Mighty, O Conqueror, O Forgiving, O Covering, save me by Your mercy from the torment of the Fire, and the scandal of disgrace. The good have distinguished themselves from the evil, and terrors have spread, and the doers of good have drawn near, and the evildoers have fared away, and all evils have been fulfilled. No soul has earned, and they will not be wronged."
        },
        {
            "TitleA": "مناجاة الراجين ",
            "TitleE": "The Rajin's Monologues",
            "NameA": "يَا مَنْ إِذَا سَأَلَهُ عَبْدٌ أَعْطَاهُ ، وَ إِذَا أَمَّلَ مَا عِنْدَهُ بَلَّغَهُ مُنَاهُ ، وَ إِذَا أَقْبَلَ عَلَيْهِ قَرَّبَهُ وَ أَدْنَاهُ ، وَ إِذَا جَاهَرَهُ بِالْعِصْيَانِ سَتَرَ عَلَيْهِ وَ غَطَّاهُ ، وَ إِذَا تَوَكَّلَ عَلَيْهِ أَحْسَبَهُ وَ كَفَاهُ .إِلَهِي مَنِ الَّذِي نَزَلَ بِكَ مُلْتَمِساً قِرَاكَ فَمَا قَرَيْتَهُ ، وَ مَنِ الَّذِي أَنَاخَ بِبَابِكَ مُرْتَجِياً نَدَاكَ فَمَا أَوْلَيْتَهُ ، أَ يَحْسُنُ أَنْ أَرْجِعَ عَنْ بَابِكَ بِالْخَيْبَةِ مَصْرُوفاً ، وَ لَسْتُ أَعْرِفُ سِوَاكَ مَوْلًى بِالْإِحْسَانِ مَوْصُوفاً ، كَيْفَ أَرْجُو غَيْرَكَ وَ الْخَيْرُ كُلُّهُ بِيَدِكَ ، وَ كَيْفَ أُؤَمِّلُ سِوَاكَ وَ الْخَلْقُ وَ الْأَمْرُ لَكَ ، أَ أَقْطَعُ رَجَائِي مِنْكَ وَ قَدْ أَوْلَيْتَنِي مَا لَمْ أَسْأَلْهُ مِنْ فَضْلِكَ ، أَمْ تُفْقِرُنِي إِلَى مِثْلِي وَ أَنَا أَعْتَصِمُ بِحَبْلِكَ ، يَا مَنْ سَعِدَ بِرَحْمَتِهِ الْقَاصِدُونَ ، وَ لَمْ يَشْقَ بِنَقِمَتِهِ الْمُسْتَغْفِرُونَ ، كَيْفَ أَنْسَاكَ وَ لَمْ تَزَلْ ذَاكِرِي ، وَ كَيْفَ أَلْهُو عَنْكَ وَ أَنْتَ مُرَاقِبِي .إِلَهِي بِذَيْلِ كَرَمِكَ أَعْلَقْتُ يَدِي ، وَ لِنَيْلِ عَطَايَاكَ بَسَطْتُ أَمَلِي ، فَأَخْلِصْنِي بِخَالِصَةِ تَوْحِيدِكَ ، وَ اجْعَلْنِي مِنْ صَفْوَةِ عَبِيدِكَ ، يَا مَنْ كُلُّ هَارِبٍ إِلَيْهِ يَلْتَجِئُ  ، وَ كُلُّ طَالِبٍ إِيَّاهُ يَرْتَجِي ، يَا خَيْرَ مَرْجُوٍّ ، وَ يَا أَكْرَمَ مَدْعُوٍّ ، وَ يَا مَنْ لَا يُرَدُّ سَائِلُهُ ، وَ لَا يُخَيَّبُ آمِلُهُ ، يَا مَنْ بَابُهُ مَفْتُوحٌ لِدَاعِيهِ ، وَ حِجَابُهُ مَرْفُوعٌ لِرَاجِيهِ ، أَسْأَلُكَ بِكَرَمِكَ أَنْ تَمُنَّ عَلَيَّ مِنْ عَطَائِكَ بِمَا تَقَرُّ بِهِ عَيْنِي ، وَ مِنْ رَجَائِكَ بِمَا تَطْمَئِنُّ بِهِ نَفْسِي ، وَ مِنَ الْيَقِينِ بِمَا تُهَوِّنُ بِهِ عَلَيَّ مُصِيبَاتِ الدُّنْيَا ، وَ تَجْلُو بِهِ عَنْ بَصِيرَتِي غَشَوَاتِ الْعَمَى ، بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ ",
            "NameE": " the Most Gracious, the Most Merciful\nO you who, when a servant asks him, he gives him, and when he hopes for what he has, his wish makes him attain it, and when it comes to him, he is brought near to him, and He approached him, and when he openly disobeyed him, he concealed and covered him, and when he put his trust in him, he took care of him and sufficed him. My God, who is it that came down to you, seeking your village, and you did not visit it? Beware of disappointment, and I do not know anyone but you who is devoted to goodness and is described. How can I hope for anyone other than you when all goodness is in your hand, and how can I hope for someone other than you? And creation and command are yours. Should I sever my hope in you, since you have given me what I did not ask for of your grace, or will you make me poor like me, while I hold fast to a rope? Oh, by whose mercy those who seek His mercy are pleased, and by whose vengeance those who seek forgiveness are not distressed, how can I forget you when you are still in my memory, and how can I distract myself? About you, and you are my watcher. My God, by the tail of your generosity I have tied my hand, and to obtain your gifts I have extended my hope, so save me with the sincerity of your oneness, and make me one of The elite of Your servants, O to whom every fleeing person takes refuge, and every seeker hopes for it, O the best of hope, and O the most generous of those who are invited, and O He whose beggar is not rejected, and whose hope is not disappointed, O He whose door is open to him who calls upon him, and whose veil is raised to him who hopes, I ask You, by Your generosity, to grant I have your gift of what pleases my eyes, your hope of what reassures my soul, and certainty of what makes calamities easy for me. world, and remove from my sight the veils of blindness, by Your mercy, O Most Merciful of the Merciful."
        },
        {
            "TitleA": "مناجاة الراغبين ",
            "TitleE": "Speaking to those who desire",
            "NameA": "إِلَهِي إِنْ كَانَ قَلَّ زَادِي فِي الْمَسِيرِ إِلَيْكَ ، فَلَقَدْ حَسُنَ ظَنِّي بِالتَّوَكُّلِ عَلَيْكَ ، وَ إِنْ كَانَ جُرْمِي قَدْ أَخَافَنِي مِنْ عُقُوبَتِكَ ، فَإِنَّ رَجَائِي قَدْ أَشْعَرَنِي بِالْأَمْنِ مِنْ نَقِمَتِكَ ، وَ إِنْ كَانَ ذَنْبِي قَدْ عَرَّضَنِي لِعِقَابِكَ ، فَقَدْ آذَنَنِي حُسْنُ ثِقَتِي بِثَوَابِكَ ، وَ إِنْ أَنَامَتْنِي الْغَفْلَةُ عَنِ الِاسْتِعْدَادِ لِلِقَائِكَ ، فَقَدْ نَبَّهَتْنِي الْمَعْرِفَةُ بِكَرَمِكَ وَ آلَائِكَ ، وَ إِنْ أَوْحَشَ مَا بَيْنِي وَ بَيْنَكَ فَرْطُ الْعِصْيَانِ وَ الطُّغْيَانِ ، فَقَدْ آنَسَنِي بُشْرَى الْغُفْرَانِ وَ الرِّضْوَانِ ، أَسْأَلُكَ بِسُبُحَاتِ وَجْهِكَ وَ بِأَنْوَارِ قُدْسِكَ ، وَ أَبْتَهِلُ إِلَيْكَ بِعَوَاطِفِ رَحْمَتِكَ وَ لَطَائِفِ بِرِّكَ ، أَنْ تُحَقِّقَ ظَنِّي بِمَا أُؤَمِّلُهُ مِنْ جَزِيلِ إِكْرَامِكَ ، وَ جَمِيلِ إِنْعَامِكَ فِي الْقُرْبَى مِنْكَ ، وَ الزُّلْفَى لَدَيْكَ ، وَ التَّمَتُّعِ بِالنَّظَرِ إِلَيْكَ ، وَ هَا أَنَا مُتَعَرِّضٌ لِنَفَحَاتِ رَوْحِكَ وَ عَطْفِكَ ، وَ مُنَتَجِعٌ غَيْثَ جُودِكَ وَ لُطْفِكَ ، فَارٌّ مِنْ سَخَطِكَ إِلَى رِضَاكَ ، هَارِبٌ مِنْكَ إِلَيْكَ ، رَاجٍ أَحْسَنَ مَا لَدَيْكَ ، مُعَوِّلٌ عَلَى مَوَاهِبِكَ ، مُفْتَقِرٌ إِلَى رِعَايَتِكَ .إِلَهِي مَا بَدَأْتَ بِهِ مِنْ فَضْلِكَ فَتَمِّمْهُ ، وَ مَا وَهَبْتَ لِي مِنْ كَرَمِكَ فَلَا تَسْلُبْهُ ، وَ مَا سَتَرْتَهُ عَلَيَّ بِحِلْمِكَ فَلَا تَهْتِكْهُ ، وَ مَا عَلِمْتَهُ مِنْ قَبِيحِ فِعْلِي فَاغْفِرْهُ . إِلَهِي اسْتَشْفَعْتُ بِكَ إِلَيْكَ ، وَ اسْتَجَرْتُ بِكَ مِنْكَ ، أَتَيْتُكَ طَامِعاً فِي إِحْسَانِكَ ، رَاغِباً فِي امْتِنَانِكَ ، مُسْتَسْقِياً وبل [ وَابِلَ ] طَوْلِكَ ، مُسْتَمْطِراً غَمَامَ فَضْلِكَ ، طَالِباً مَرْضَاتَكَ ، قَاصِداً جَنَابَكَ  ، وَارِداً شَرِيعَةَ رِفْدِكَ ، مُلْتَمِساً سَنِيَّ الْخَيْرَاتِ مِنْ عِنْدِكَ ، وَافِداً إِلَى حَضْرَةِ جَمَالِكَ ، مُرِيداً وَجْهَكَ ، طَارِقاً بَابَكَ ، مُسْتَكِيناً لِعَظَمَتِكَ وَ جَلَالِكَ ، فَافْعَلْ بِي مَا أَنْتَ أَهْلُهُ مِنَ الْمَغْفِرَةِ وَ الرَّحْمَةِ ، وَ لَا تَفْعَلْ بِي مَا أَنَا أَهْلُهُ مِنَ الْعَذَابِ وَ النَّقِمَةِ ، بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ ",
            "NameE": " the Most Gracious, the Most Merciful.\nMy God, even if I have little need to travel to You, then my belief in trusting in You has been good, even if my crime has frightened me of Your punishment, for my hope has made me feel safe from your vengeance, even if my sin has exposed me to your punishment. My good confidence has informed me of your reward, and if negligence made me stop preparing to meet you, knowledge of your generosity and benefits has alerted me. And if there is so much desolation between you and me as disobedience and tyranny, then give me the good news of forgiveness and contentment. I ask you by the glorifications of your face and by The light of your holiness, and I pray To You, with Your great mercy and Your gentle kindness, may my thoughts be fulfilled with what I hope for from Your great generosity, and Your beautiful bounties to those near You, and Al-Zulfi. You have me, and I enjoy looking at you, and here I am, exposed to the breaths of your spirit and kindness, and reaping the rain of your generosity and kindness, fleeing from Your displeasure to your satisfaction, fleeing from you to you, hoping for your best, relying on your talents, lacking your care. My God, what you started with from the beginning. fulfill your error, and do not destroy what you have given me of your generosity, and do not destroy what you have concealed for me with your forbearance, and what you have taught me of My act is ugly, so forgive it. My God, I have interceded with You for Your sake, and I have sought protection through You from You. I have come to You, seeking Your benevolence, desiring Your gratitude, seeking water from Your long rain, subsisting. Flying in the clouds of your grace, seeking your pleasure, traveling beside you, bringing the law of your benefit, seeking the years of good things from you, coming to Hazrat Jamal CK Seeking Your face, knocking at Your door, submitting to Your greatness and majesty, so do to me what you deserve of forgiveness and mercy, and do not do to me what you deserve. I am freed from torment and curse, by Your mercy, O Most Merciful of the Merciful."
        },
        {
            "TitleA": "مناجاة الشاكرين ",
            "TitleE": "Summoning with the Thankful",
            "NameA": "إِلَهِي أَذْهَلَنِي عَنْ إِقَامَةِ شُكْرِكَ تَتَابُعُ طَوْلِكَ ، وَ أَعْجَزَنِي عَنْ إِحْصَاءِ ثَنَائِكَ فَيْضُ فَضْلِكَ ، وَ شَغَلَنِي عَنْ ذِكْرِ مَحَامِدِكَ تَرَادُفُ عَوَائِدِكَ ، وَ أَعْيَانِي عَنْ نَشْرِ عَوَارِفِكَ تَوَالِي أَيَادِيكَ ، وَ هَذَا مَقَامُ مَنِ اعْتَرَفَ بِسُبُوغِ النَّعْمَاءِ ، وَ قَابَلَهَا بِالتَّقْصِيرِ ، وَ شَهِدَ عَلَى نَفْسِهِ بِالْإِهْمَالِ وَ التَّضْيِيعِ ، وَ أَنْتَ الرَّءُوفُ الرَّحِيمُ ، الْبَرُّ الْكَرِيمُ ، الَّذِي لَا يُخَيِّبُ قَاصِديِهِ ، وَ لَا يَطْرُدُ عَنْ فِنَائِهِ آمِلِيهِ ، بِسَاحَتِكَ تَحُطُّ رِحَالُ الرَّاجِينَ ، وَ بِعَرْصَتِكَ تَقِفُ آمَالُ الْمُسْتَرْفِدِينَ ، فَلَا تُقَابِلْ آمَالَنَا بِالتَّخْيِيبِ وَ الْإِيَاسِ ، وَ لَا تُلْبِسْنَا سِرْبَالَ الْقُنُوطِ وَ الْإِبلَاسِ . إِلَهِي تَصَاغَرَ عِنْدَ تَعَاظُمِ آلَائِكَ شُكْرِي ، وَ تَضَاءَلَ فِي جَنْبِ إِكْرَامِكَ إِيَّايَ ثَنَائِي وَ نَشْرِي ، جَلَّلَتْنِي نِعَمُكَ مِنْ أَنْوَارِ الْإِيمَانِ حُلَلًا ، وَ ضَرَبَتْ عَلَيَّ لَطَائِفُ بِرِّكَ مِنَ الْعِزِّ كِلَلًا ، وَ قَلَّدَتْنِي مِنَنُكَ قَلَائِدَ لَا تُحَلُّ ، وَ طَوَّقَتْنِي أَطْوَاقاً لَا تُفَلُّ ، فَآلَاؤُكَ جَمَّةٌ ضَعُفَ لِسَانِي عَنْ إِحْصَائِهَا ، وَ نَعْمَاؤُكَ كَثِيرَةٌ قَصُرَ فَهْمِي عَنْ إِدْرَاكِهَا ، فَضْلًا عَنِ اسْتِقْصَائِهَا ، فَكَيْفَ لِي بِتَحْصِيلِ الشُّكْرِ ، وَ شُكْرِي إِيَّاكَ يَفْتَقِرُ إِلَى شُكْرٍ ، فَكُلَّمَا قُلْتُ لَكَ الْحَمْدُ ، وَجَبَ عَلَيَّ لِذَلِكَ أَنْ أَقُولَ لَكَ الْحَمْدُ .إِلَهِي فَكَمَا غَذَّيْتَنَا بِلُطْفِكَ ، وَ رَبَّيْتَنَا بِصُنْعِكَ ، فَتَمِّمْ عَلَيْنَا سَوَابِغَ النِّعَمِ ، وَ ادْفَعْ عَنَّا مَكَارِهَ النِّقَمِ ، وَ آتِنَا مِنْ حُظُوظِ الدَّارَيْنِ أَرْفَعَهَا وَ أَجَلَّهَا عَاجِلًا وَ آجِلًا ، وَ لَكَ الْحَمْدُ عَلَى حُسْنِ بَلَائِكَ وَ سُبُوغِ نَعْمَائِكَ ، حَمْداً يُوَافِقُ رِضَاكَ ، وَ يَمْتَرِي الْعَظِيمَ مِنْ بِرِّكَ وَ نَدَاكَ ، يَا عَظِيمُ يَا كَرِيمُ ، بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ ",
            "NameE": " the Most Merciful, the Most Merciful \nGod, I am grateful for me from staying your thanks Your Hamid, you will seek your goodness, and see me from spreading your eyes to teach your hands, and this is the place And he responded to it with negligence, and witnessed against himself neglect and waste, and You are the Most Merciful, the Most Merciful, the Most Generous, the One who does not disappoint those who seek it, and May His hopes not be cast out from His yard. In Your arena you place the journeys of those who seek, and at Your barricade stand the hopes of those who are exploited. Do not meet our hopes with disappointment and despair. And do not clothe us with the garment of despair and devilishness. My God, He was insignificant when Your blessings of thanks increased in number, and He diminished in Your honoring of me and my expansion. Your blessings have enveloped me in the lights of faith, and you have bestowed upon me the overwhelming splendor of your blessings of glory, and you have attached to me chains of yours that cannot be permissible, and You have encircled me with chains that will not let go, your blessings are so numerous that my tongue is too weak to count them, and your blessings are so many that my understanding is too short to comprehend them, let alone the I have investigated it, so how can I receive thanks, and my thanks to you lacks thanks, so whenever I say to you praise, I must therefore say to you the truth. Extend. My God Just as you nourished us with your kindness, and nurtured us with your kindness, so bestow upon us the blessings that are worthy of blessings, and ward off from us the calamities of vengeance, and bestow upon us some of the good fortune of the two worlds. So, now and later, sooner and later, and praise be to You for your good test and the fulfillment of your blessings, a praise that matches your satisfaction and matches the greatness of your righteousness. And he calls upon you, O Great One, O Generous One, with your mercy, O Most Merciful of the Merciful."
        },
        {
            "TitleA": "مناجاة المطيعين",
            "TitleE": "Speaking to the obedient",
            "NameA": "إِلَهِي أَلْهِمْنَا طَاعَتَكَ وَ جَنِّبْنَا مَعَاصِيَكَ ، وَ يَسِّرْ لَنَا بُلُوغَ مَا نَتَمَنَّى مِنِ ابْتِغَاءِ رِضْوَانِكَ ، وَ أَحْلِلْنَا بُحْبُوحَةَ جِنَانِكَ ، وَ اقْشَعْ عَنْ بَصَائِرِنَا سَحَابَ الِارْتِيَابِ ، وَ اكْشِفْ عَنْ قُلُوبِنَا أَغْشِيَةَ الْمِرْيَةِ وَ الْحِجَابِ ، وَ أَزْهِقِ الْبَاطِلَ عَنْ ضَمَائِرِنَا ، وَ أَثْبِتِ الْحَقَّ فِي سَرَائِرِنَا ، فَإِنَّ الشُّكُوكَ وَ الظُّنُونَ لَوَاقِحُ الْفِتَنِ ، وَ مُكَدِّرَةٌ لِصَفْوِ الْمَنَائِحِ وَ الْمِنَنِ .اللَّهُمَّ احْمِلْنَا فِي سُفُنِ نَجَاتِكَ ، وَ مَتِّعْنَا بِلَذِيذِ مُنَاجَاتِكَ ، وَ أَوْرِدْنَا حِيَاضَ حُبِّكَ ، وَ أَذِقْنَا حَلَاوَةَ وُدِّكَ وَ قُرْبِكَ ، وَ اجْعَلْ جِهَادَنَا فِيكَ ، وَ هَمَّنَا فِي طَاعَتِكَ ، وَ أَخْلِصْ نِيَّاتِنَا فِي مُعَامَلَتِكَ ، فَإِنَّا بِكَ وَ لَكَ ، وَ لَا وَسِيلَةَ لَنَا إِلَيْكَ إِلَّا بِكَ . إِلَهِي اجْعَلْنِي مِنَ الْمُصْطَفَيْنَ الْأَخْيارِ ، وَ أَلْحِقْنِي بِالصَّالِحِينَ الْأَبْرَارِ ، السَّابِقِينَ إِلَى الْمَكْرُمَاتِ ، الْمُسَارِعِينَ  إِلَى الْخَيْرَاتِ ، الْعَامِلِينَ لِلْبَاقِيَاتِ الصَّالِحَاتِ ، السَّاعِينَ إِلَى رَفِيعِ الدَّرَجَاتِ ، إِنَّكَ عَلى كُلِّ شَيْ ءٍ قَدِيرٌ ، وَ بِالْإِجَابَةِ جَدِيرٌ ، بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ",
            "NameE": " the Most Gracious, the Most Merciful. My God, inspire us to obey you and keep us away from your disobedience, and facilitate for us the attainment of what we wish for, seeking your pleasure. Grant us the sweetness of Your Paradise, and remove from our sights the clouds of doubt, and remove from our hearts the veils of the veil and the veil, and I am invalid from our guerrillas, and prove the truth in our secrets, for the suspicion and the thought are the reverence of the fold Your survivors, and we enjoyed your wives, and we wanted to live your love, and we have given us the solution of your hand and your closeness. Our striving is for You, our desire to obey You, and our most sincere intentions in dealing with You, for we belong to You and to You, and we have no way to You except through You. My God, make Name me among the chosen ones, the good ones, and join me with the righteous and righteous, those who precede the good deeds, who hasten to good deeds, and do the good deeds that will last. , “Those who seek to raise themselves in status, You are capable of all things, and worthy of an answer, by your mercy, O Most Merciful of the Merciful."
        },
        {
            "TitleA": "مناجاة المريدين ",
            "TitleE": "The supplication of the devotees",
            "NameA": "سُبْحَانَكَ مَا أَضْيَقَ الطُّرُقَ عَلَى مَنْ لَمْ تَكُنْ دَلِيلَهُ ، وَ مَا أَوْضَحَ الْحَقَّ عِنْدَ مَنْ هَدَيْتَهُ سَبِيلَهُ .إِلَهِي فَاسْلُكْ بِنَا سُبُلَ الْوُصُولِ إِلَيْكَ ، وَ سَيِّرْنَا فِي أَقْرَبِ الطُّرُقِ لِلْوُفُودِ عَلَيْكَ ، قَرِّبْ عَلَيْنَا الْبَعِيدَ ، وَ سَهِّلْ عَلَيْنَا الْعَسِيرَ الشَّدِيدَ ، وَ أَلْحِقْنَا بِالْعِبَادِ الَّذِينَ هُمْ بِالْبِدَارِ إِلَيْكَ يُسَارِعُونَ ، وَ بَابَكَ عَلَى الدَّوَامِ يَطْرُقُونَ ، وَ إِيَّاكَ فِي اللَّيْلِ يَعْبُدُونَ ، وَ هُمْ مِنْ هَيْبَتِكَ مُشْفِقُونَ ، الَّذِينَ صَفَّيْتَ لَهُمُ الْمَشَارِبَ ، وَ بَلَّغْتَهُمُ الرَّغَائِبَ ، وَ أَنْجَحْتَ لَهُمُ الْمَطَالِبَ ، وَ قَضَيْتَ لَهُمْ مِنْ وَصْلِكَ الْمَآرِبَ ، وَ مَلَأْتَ لَهُمْ ضَمَائِرَهُمْ مِنْ حُبِّكَ ، وَ رَوَّيْتَهُمْ مِنْ صَافِي شِرْبِكَ ، فَبِكَ إِلَى لَذِيذِ مُنَاجَاتِكَ وَصَلُوا ، وَ مِنْكَ أَقْصَى مَقَاصِدِهِمْ حَصَّلُوا ، فَيَا مَنْ هُوَ عَلَى الْمُقْبِلِينَ عَلَيْهِ مُقْبِلٌ ، وَ بِالْعَطْفِ عَلَيْهِمْ عَائِدٌ مُفْضِلٌ ، وَ بِالْغَافِلِينَ  عَنْ ذِكْرِهِ رَحِيمٌ رَءُوفٌ ، وَ بِجَذْبِهِمْ إِلَى بَابِهِ وَدُودٌ عَطُوفٌ ، أَسْأَلُكَ أَنْ تَجْعَلَنِي مِنْ أَوْفَرِهِمْ مِنْكَ حَظّاً ، وَ أَعْلَاهُمْ عِنْدَكَ مَنْزِلًا ، وَ أَجْزَلِهِمْ مِنْ وُدِّكَ قِسْماً ، وَ أَفْضَلِهِمْ فِي مَعْرِفَتِكَ نَصِيباً ، فَقَدِ انْقَطَعَتْ إِلَيْكَ هِمَّتِي ، وَ انْصَرَفَتْ نَحْوَكَ رَغْبَتِي ، فَأَنْتَ لَا غَيْرُكَ مُرَادِي ، وَ لَكَ لَا لِسِوَاكَ سَهَرِي وَ سُهَادِي ، وَ لِقَاؤُكَ قُرَّةُ عَيْنِي ، وَ وَصْلُكَ مُنَى نَفْسِي ، وَ إِلَيْكَ شَوْقِي ، وَ فِي مَحَبَّتِكَ وَلَهِي ، وَ إِلَى هَوَاكَ صَبَابَتِي ، وَ رِضَاكَ بُغْيَتِي ، وَ رُؤْيَتُكَ حَاجَتِي ، وَ جِوَارُكَ طَلِبَتِي ، وَ قُرْبُكَ غَايَةُ سُؤْلِي ، وَ فِي مُنَاجَاتِكَ أُنْسِي وَ رَاحَتِي ، وَ عِنْدَكَ دَوَاءُ عِلَّتِي ، وَ شِفَاءُ غُلَّتِي ، وَ بَرْدُ لَوْعَتِي ، وَ كَشْفُ كُرْبَتِي ، فَكُنْ أَنِيسِي فِي وَحْشَتِي ، وَ مُقِيلَ عَثْرَتِي ، وَ غَافِرَ زَلَّتِي ، وَ قَابِلَ تَوْبَتِي ، وَ مُجِيبَ دَعْوَتِي ، وَ وَلِيَّ عِصْمَتِي ، وَ مُغْنِيَ فَاقَتِي ، وَ لَا تَقْطَعْنِي عَنْكَ ، وَ لَا تُبْعِدْنِي مِنْكَ ، يَا نَعِيمِي وَ جَنَّتِي ، وَ يَا دُنْيَايَ وَ آخِرَتِي",
            "NameE": " the Most Gracious, the Most Merciful\nGlory be to You, how narrow are the paths for those for whom there is no guide, and how clear is the truth to those whose path you guide. My God. So guide us on the paths to reach you, and lead us on the paths closest to reaching you, bring near to us what is far away, and We are easy for us, and we are injecting the worshipers who are in the beginning to you, to you, and you will be upon you From your companions, who were shrouded, who have been described as the drink, and the desires were informed of them, and the rituals of them succeeded, You achieved their goals, and filled their consciences with your love, and quenched their thirst with your pure drink. Through you, they reached the sweetness of your conversations and they prayed, and from you I fear They achieved their goals, O He who is the one who approaches those who approach Him, who is kind to them and a gracious returner, and merciful and merciful to those who are heedless of His remembrance. Waf, and By attracting them to his door with kindness and compassion, I ask you to make me among them more fortunate than you, the highest in status with you, and the most generous of friendliness. I swear to you, and the best of them in knowing you is a share. My desire for you has ceased, and my desire has turned towards you. You are my desire, and none other than you, and yours is Nothing but you My nights and nights, and meeting you is the comfort of my eye, and reaching you from my soul, and for you is my longing, and in your love and my desire, and to your desire is my youth, and your satisfaction is my greatest desire. I come, and seeing you is my need, and being next to you is my request, and your closeness is the goal of my request, and in conversing with you I forget and My comfort, and with You is the cure for my illness, the cure for my illness, the alleviation of my pain, and the relief of my distress, so be my comfort in my loneliness, the remover of my stumbling, and the forgiveness of my slip. And He accepts my repentance, and He responds to my supplication, and He is my protector, and He is the reliever of my poverty, and He does not Cut me off from you, and do not distance me from you, oh my bliss and my paradise, oh my world and my hereafter."
        },
        {
            "TitleA": "مناجاة المحبين",
            "TitleE": "Lovers' Monologues",
            "NameA": "إِلَهِي مَنْ ذَا الَّذِي ذَاقَ حَلَاوَةَ مَحَبَّتِكَ فَرَامَ مِنْكَ بَدَلًا ، وَ مَنْ ذَا الَّذِي آنس [ أَنِسَ ] بِقُرْبِكَ فَابْتَغَى عَنْكَ حِوَلًا . إِلَهِي فَاجْعَلْنَا مِمَّنِ اصْطَفَيْتَهُ لِقُرْبِكَ وَ وَلَايَتِكَ ، وَ أَخْلَصْتَهُ لِوُدِّكَ وَ مَحَبَّتِكَ ، وَ شَوَّقْتَهُ إِلَى لِقَائِكَ ، وَ رَضَّيْتَهُ بِقَضَائِكَ ، وَ مَنَحْتَهُ بِالنَّظَرِ إِلَى وَجْهِكَ ، وَ حَبَوْتَهُ بِرِضَاكَ ، وَ أَعَذْتَهُ مِنْ هَجْرِكَ وَ قِلَاك ، وَ بَوَّأْتَهُ مَقْعَدَ الصِّدْقِ فِي جِوَارِكَ ، وَ خَصَصْتَهُ بِمَعْرِفَتِكَ ، وَ أَهَّلْتَهُ لِعِبَادَتِكَ ، وَ هَيَّمْتَهُ لِإِرَادَتِكَ ، وَ اجْتَبَيْتَهُ لِمُشَاهَدَتِكَ ، وَ أَخْلَيْتَ وَجْهَهُ لَكَ ، وَ فَرَّغْتَ فُؤَادَهُ لِحُبِّكَ ، وَ رَغَّبْتَهُ فِيمَا عِنْدَكَ ، وَ أَلْهَمْتَهُ ذِكْرَكَ ، وَ أَوْزَعْتَهُ شُكْرَكَ ، وَ شَغَلْتَهُ بِطَاعَتِكَ ، وَ صَيَّرْتَهُ مِنْ صَالِحِي بَرِيَّتِكَ ، وَ اخْتَرْتَهُ لِمُنَاجَاتِكَ ، وَ قَطَعْتَ عَنْهُ كُلَّ شَيْ  يَقْطَعُهُ عَنْكَ .اللَّهُمَّ اجْعَلْنَا مِمَّنْ دَأْبُهُمُ الِارْتِيَاحُ إِلَيْكَ وَ الْحَنِينُ ، وَ دَهْرُهُمُ الزَّفْرَةُ وَ الْأَنِينُ ، جِبَاهُهُمْ سَاجِدَةٌ لِعَظَمَتِكَ ، وَ عُيُونُهُمْ سَاهِرَةٌ فِي خِدْمَتِكَ ، وَ دُمُوعُهُمْ سَائِلَةٌ مِنْ خَشْيَتِكَ ، وَ قُلُوبُهُمْ مُتَعَلِّقَةٌ بِمَحَبَّتِكَ ، وَ أَفْئِدَتُهُمْ مُنْخَلِعَةٌ مِنْ مَهَابَتِكَ ، يَا مَنْ أَنْوَارُ قُدْسِهِ لِأَبْصَارِ مُحِبِّيهِ رَائِقَةٌ ، وَ سُبُحَاتُ وَجْهِهِ لِقُلُوبِ عَارِفِيهِ شَائِقَةٌ ، يَا مُنَى قُلُوبِ الْمُشْتَاقِينَ ، وَ يَا غَايَةُ آمَالِ الْمُحِبِّينَ ، أَسْأَلُكَ حُبَّكَ وَ حُبَّ مَنْ يُحِبُّكَ ، وَ حُبَّ كُلِّ عَمَلٍ يُوصِلُنِي إِلَى قُرْبِكَ ، وَ أَنْ تَجْعَلَكَ أَحَبَّ إِلَيَّ مِمَّا سِوَاكَ ، وَ أَنْ تَجْعَلَ حُبِّي إِيَّاكَ قَائِداً إِلَى رِضْوَانِكَ ، وَ شَوْقِي إِلَيْكَ ذَائِداً عَنْ عِصْيَانِكَ ، وَ امْنُنْ بِالنَّظَرِ إِلَيْكَ عَلَيَّ ، وَ انْظُرْ بِعَيْنِ الْوُدِّ وَ الْعَطْفِ إِلَيَّ ، وَ لَا تَصْرِفْ عَنِّي وَجْهَكَ ، وَ اجْعَلْنِي مِنْ أَهْلِ الْإِسْعَادِ وَ الْحُظْوَةِ عِنْدَكَ ، يَا مُجِيبُ ، يَا أَرْحَمَ الرَّاحِمِينَ ",
            "NameE": " the Most Gracious, the Most Merciful\nMy God, who is the one who has tasted the sweetness of your love and sought refuge from you, and who is the one who has become close to you and sought Away from you, my God, so make us among those whom you have chosen for your closeness and guardianship, and whom you have made sincere for your affection and love, and You made him long to meet you, you satisfied him with your fulfillment, you granted him the opportunity to look at your face, you loved him with your approval, and you protected him from your abandonment and anxiety. And you placed him in the seat of truthfulness in your proximity, and you designated him with your knowledge, and you made him worthy of your worship, and you subjected him to your will, and you chose him for scenes You came and evacuated He directed his face to you, you made his heart empty for your love, you made him desire what you have, you inspired him with your remembrance, you filled him with your gratitude, and you occupied him with your obedience. And you made him one of the interests of your creation, and you chose him to commune with you, and you cut off from him everything that he cut off from you. Oh God, make us among those whose habit is to show mercy. I refer to you and Nostalgia, and they are constantly sighing and groaning, their foreheads are prostrating to your greatness, their eyes are watchful in serving you, and their tears are flowing from fear. You, and their hearts are attached to your love, and their hearts are freed from your fear, O whose lights of holiness are dazzling to the eyes of those who love you. And the praises of His face long for the hearts of those who know Him, O the source of the hearts of the longing, and the goal of the hopes of the lovers, I ask you for your love and the love of those who love you, and the love of every action that brings me close to you, and that you come That you are more beloved to me than anyone else, and that you make my love for you a guide to your satisfaction, and my longing for you a refuge from your disobedience, And trust me in looking at you, and look at me with eyes of love and kindness, and do not turn your face away from me, and make me among the people of happiness and good fortune. “And with You, O Responder, O Most Merciful of the Merciful."
        },
        {
            "TitleA": "مناجاة المتوسلين",
            "TitleE": "The supplication of supplicants",
            "NameA": "إِلَهِي لَيْسَ لِي وَسِيلَةٌ إِلَيْكَ إِلَّا عَوَاطِفُ رَأْفَتِكَ ، وَ لَا لِي ذَرِيعَةٌ إِلَيْكَ إِلَّا عَوَاطِفُ رَحْمَتِكَ ، وَ شَفَاعَةُ نَبِيِّكَ نَبِيِّ الرَّحْمَةِ وَ مُنْقِذِ الْأُمَّةِ مِنَ الْغُمَّةِ ، فَاجْعَلْهُمَا لِي سَبَباً إِلَى نَيْلِ غُفْرَانِكَ ، وَ صَيِّرْهُمَا لِي وُصْلَةً إِلَى الْفَوْزِ بِرِضْوَانِكَ ، وَ قَدْ حَلَّ رَجَائِي بِحَرَمِ كَرَمِكَ ، وَ حَطَّ طَمَعِي بِفِنَاءِ جُودِكَ ، فَحَقِّقْ فِيكَ أَمَلِي ، وَ اخْتِمْ بِالْخَيْرِ عَمَلِي ، وَ اجْعَلْنِي مِنْ صَفْوَتِكَ الَّذِينَ أَحْلَلْتَهُمْ بُحْبُوحَةَ جَنَّتِكَ ، وَ بَوَّأْتَهُمْ دَارَ كَرَامَتِكَ ، وَ أَقْرَرْتَ أَعْيُنَهُمْ بِالنَّظَرِ إِلَيْكَ يَوْمَ لِقَائِكَ ، وَ أَوْرَثْتَهُمْ مَنَازِلَ الصِّدْقِ فِي جِوَارِكَ . يَا مَنْ لَا يَفِدُ الْوَافِدُونَ عَلَى أَكْرَمَ مِنْهُ ، وَ لَا يَجِدُ الْقَاصِدُونَ أَرْحَمَ مِنْهُ ، يَا خَيْرَ مَنْ خَلَا بِهِ وَحِيدٌ ، وَ يَا أَعْطَفَ مَنْ أَوَى إِلَيْهِ طَرِيدٌ ، إِلَى سَعَةِ عَفْوِكَ مَدَدْتُ يَدِي ، وَ بِذَيْلِ كَرَمِكَ أَعْلَقْتُ كَفِّي ، فَلَا تُولِنِي الْحِرْمَانَ ، وَ لَا تَبْتَلِنِي بِالْخَيْبَةِ وَ الْخُسْرَانِ ، يَا سَمِيعَ الدُّعَاءِ ",
            "NameE": " the Most Gracious, the Most Merciful My God, I have no means of approaching You except the expressions of Your compassion, and I have no pretext to You except the expressions of Your mercy, and your intercession. Your Prophet is the Prophet of mercy and the savior of the nation from distress, so make them a reason for me to obtain your forgiveness, and make them mine. A link to achieving Your satisfaction, and He has fulfilled my hope in the sanctuary of Your generosity, and has subdued my desire for the fulfillment of Your generosity, so my hope in You has been fulfilled, and my work has ended with goodness, and Make me one of your chosen ones whom you have made possible the joy of your paradise, made their abode the abode of your dignity, and made their eyes happy to look at you on the day they meet you. K, and You have bequeathed to them places of honesty in your neighbourhood. O you, to whom incoming visitors do not find anyone more merciful than him, and those who come to them do not find anyone more merciful than him. O the best of those who are alone with Him. hand, and O Most Kind of those to whom a fugitive took refuge, to the extent of your pardon I extended my hand, and to the tail of your generosity I attached my palm, so no Grant me deprivation, and do not afflict me with disappointment and loss, O Hearer of supplication."
        },
        {
            "TitleA": "مناجاة المفتقرين",
            "TitleE": "Speaking to the needy",
            "NameA": "إِلَهِي كَسْرِي لَا يَجْبُرُهُ إِلَّا لُطْفُكَ وَ حَنَانُكَ ، وَ فَقْرِي لَا يُغْنِيهِ إِلَّا عَطْفُكَ وَ إِحْسَانُكَ ، وَ رَوْعَتِي لَا يُسَكِّنُهَا إِلَّا أَمَانُكَ ، وَ ذِلَّتِي لَا يُعِزُّهَا إِلَّا سُلْطَانُكَ ، وَ أُمْنِيَّتِي لَا يُبَلِّغُنِيهَا إِلَّا فَضْلُكَ ، وَ خَلَّتِي لَا يَسُدُّهَا إِلَّا طَوْلُكَ ، وَ حَاجَتِي لَا يَقْضِيهَا غَيْرُكَ ، وَ كَرْبِي لَا يُفَرِّجُهَا سِوَى رَحْمَتِكَ ، وَ ضُرِّي لَا يَكْشِفُهُ غَيْرُ رَأْفَتِكَ  ، وَ غُلَّتِي لَا يُبَرِّدُهَا إِلَّا وَصْلُكَ ، وَ لَوْعَتِي لَا يُطْفِئُهَا إِلَّا لِقَاؤُكَ ، وَ شَوْقِي إِلَيْكَ لَا يَبُلُّهُ إِلَّا النَّظَرُ إِلَى وَجْهِكَ ، وَ قَرَارِي لَا يَقِرُّ دُونَ دُنُوِّي مِنْكَ ، وَ لَهْفَتِي لَا يَرُدُّهَا إِلَّا رَوْحُكَ ، وَ سُقْمِي لَا يَشْفِيهِ إِلَّا طِبُّكَ ، وَ غَمِّي لَا يُزِيلُهُ إِلَّا قُرْبُكَ ، وَ جُرْحِي لَا يُبْرِئُهُ إِلَّا صَفْحُكَ ، وَ رَيْنُ قَلْبِي لَا يَجْلُوهُ إِلَّا عَفْوُكَ ، وَ وَسْوَاسُ صَدْرِي لَا يُزِيحُهُ إِلَّا أَمْرُكَ ، فَيَا مُنْتَهَى أَمَلِ الْآمِلِينَ ، وَ يَا غَايَةَ سُؤْلِ السَّائِلِينَ ، وَ يَا أَقْصَى طَلِبَةِ الطَّالِبِينَ ، وَ يَا أَعْلَى رَغْبَةِ الرَّاغِبِينَ ، وَ يَا وَلِيَّ الصَّالِحِينَ ، وَ يَا أَمَانَ الْخَائِفِينَ ، وَ يَا مُجِيبَ الْمُضْطَرِّينَ ، وَ يَا ذُخْرَ الْمُعْدِمِينَ ، وَ يَا كَنْزَ الْبَائِسِينَ ، وَ يَا غِيَاثَ الْمُسْتَغِيثِينَ ، وَ يَا قَاضِيَ حَوَائِجِ الْفُقَرَاءِ وَ الْمَسَاكِينِ ، وَ يَا أَكْرَمَ الْأَكْرَمِينَ ، وَ يَا أَرْحَمَ الرَّاحِمِينَ ، لَكَ تَخَضُّعِي وَ سُؤَالِي ، وَ إِلَيْكَ تَضَرُّعِي وَ ابْتِهَالِي ، أَسْأَلُكَ أَنْ تُنِيلَنِي مِنْ رَوْحِ رِضْوَانِكَ ، وَ تُدِيمَ عَلَيَّ نِعَمَ امْتِنَانِكَ ، وَ هَا أَنَا بِبَابِ كَرَمِكَ وَاقِفٌ ، وَ لِنَفَحَاتِ بِرِّكَ مُتَعَرِّضٌ ، وَ بِحَبْلِكَ الشَّدِيدِ مُعْتَصِمٌ ، وَ بِعُرْوَتِكَ الْوُثْقَى مُتَمَسِّكٌ . إِلَهِي ارْحَمْ عَبْدَكَ الذَّلِيلَ ذَا اللِّسَانِ الْكَلِيلِ وَ الْعَمَلِ الْقَلِيلِ ، وَ امْنُنْ عَلَيْهِ بِطَوْلِكَ الْجَزِيلِ ، وَ اكْنُفْهُ تَحْتَ ظِلِّكَ الظَّلِيلِ ، يَا كَرِيمُ يَا جَمِيلُ ، يَا أَرْحَمَ الرَّاحِمِينَ ",
            "NameE": " the Most Gracious, the Most Merciful My God, my brokenness can only be healed by your kindness and compassion, and my poverty can only be healed by your kindness and benevolence, and your horror Only your security can calm me, my humiliation can only be comforted by your authority, and my wish can only be fulfilled by your grace. My distress can only be satisfied by your kindness, my need can only be fulfilled by you, my distress can only be relieved by your mercy, and my distress can only be relieved by your compassion. And my thirst can only be cooled by your arrival, and my pain can only be extinguished by meeting you, and my longing for you can only be quenched by looking at your face. And my decision cannot be settled without being close to you, and my longing cannot be relieved except by your spirit, and my illness can only be cured by your medicine, and my illness can only be removed by your proximity. And my wound can only be healed by your forgiveness, and the rain of my heart can only be healed by your forgiveness, and the scruples of my chest cannot be removed. Except Your command, O the utmost hope of those who hope, O the ultimate desire of those who ask, O the utmost desire of the seekers, O the highest desire of those who wish, and O God. O the righteous, O security for the fearful, O responder to the distressed, O repository for the needy, and O treasure for the needy. O the help of those who call for help, O the One who fulfills the needs of the poor and the needy, O the most generous of the generous, and O the Most Merciful of the merciful, to you is my submission and my supplication, To You is my supplication and supplication. I ask You to bestow upon me the spirit of Your pleasure, and to perpetuate upon me the blessings of Your gratitude. Here I stand at the door of your generosity, I am exposed to the breaths of your righteousness, I take shelter in your strong rope, and I cling to your strongest handhold. My God, have mercy on your lowly servant, who has a harsh tongue and little work, and bestow upon him your great patience, and shelter him under your generous shade. O Generous, O Beautiful, O Most Merciful of the Merciful."
        },
        {
            "TitleA": "مناجاة العارفين",
            "TitleE": "A monologue to those who know",
            "NameA": "إِلَهِي قَصُرَتِ الْأَلْسُنُ عَنْ بُلُوغِ ثَنَائِكَ كَمَا يَلِيقُ بِجَلَالِكَ ، وَ عَجَزَتِ الْعُقُولُ عَنْ إِدْرَاكِ كُنْهِ جَمَالِكَ ، وَ انْحَسَرَتِ الْأَبْصَارُ دُونَ النَّظَرِ إِلَى سُبُحَاتِ وَجْهِكَ ، وَ لَمْ تَجْعَلْ لِلْخَلْقِ طَرِيقاً إِلَى مَعْرِفَتِكَ إِلَّا بِالْعَجْزِ عَنْ مَعْرِفَتِكَ . إِلَهِي فَاجْعَلْنَا مِنَ الَّذِينَ تَوَشَّحَتْ [ تَرَسَّخَتْ  ] أَشْجَارُ الشَّوْقِ إِلَيْكَ فِي حَدَائِقِ صُدُورِهِمْ ، وَ أَخَذَتْ لَوْعَةُ مَحَبَّتِكَ بِمَجَامِعِ قُلُوبِهِمْ ، فَهُمْ إِلَى أَوْكَارِ الْأَفْكَارِ يَأْوُونَ ، وَ فِي رِيَاضِ الْقُرْبِ وَ الْمُكَاشَفَةِ يَرْتَعُونَ ، وَ مِنْ حِيَاضِ الْمَحَبَّةِ بِكَأْسِ الْمُلَاطَفَةِ يَكْرَعُونَ ، وَ شَرَائِعِ الْمُصَافَاةِ يَرِدُونَ ، قَدْ كُشِفَ الْغِطَاءُ عَنْ أَبْصَارِهِمْ ، وَ انْجَلَتْ ظُلْمَةُ الرَّيْبِ عَنْ عَقَائِدِهِمْ مِنْ ضَمَائِرِهِمْ ، وَ انْتَفَتْ مُخَالَجَةُ الشَّكِّ عَنْ قُلُوبِهِمْ وَ سَرَائِرِهِمْ ، وَ انْشَرَحَتْ بِتَحْقِيقِ  الْمَعْرِفَةِ صُدُورُهُمْ ، وَ عَلَتْ لِسَبْقِ السَّعَادَةِ فِي الزَّهَادَةِ هِمَمُهُمْ ، وَ عَذُبَ فِي مَعِينِ الْمُعَامَلَةِ شِرْبُهُمْ ، وَ طَابَ فِي مَجْلِسِ الْأُنْسِ سِرُّهُمْ ، وَ أَمِنَ فِي مَوْطِنِ الْمَخَافَةِ سِرْبُهُمْ ، وَ اطْمَأَنَّتْ بِالرُّجُوعِ إِلَى رَبِّ الْأَرْبَابِ أَنْفُسُهُمْ ، وَ تَيَقَّنَتْ بِالْفَوْزِ وَ الْفَلَاحِ أَرْوَاحُهُمْ ، وَ قَرَّتْ بِالنَّظَرِ إِلَى مَحْبُوبِهِمْ أَعْيُنُهُمْ ، وَ اسْتَقَرَّ بِإِدْرَاكِ السُّؤْلِ وَ نَيْلِ الْمَأْمُولِ قَرَارُهُمْ ، وَ رَبِحَتْ فِي بَيْعِ الدُّنْيَا بِالْآخِرَةِ تِجَارَتُهُمْ .",
            "NameE": " the Most Gracious, the Most Merciful My God, tongues have failed to express your praise as befits your majesty, and minds have been unable to comprehend the essence of your beauty. And the eyesight receded without looking at the glory of Your face, and you did not make for creation a path to knowing You except through their inability to know You. My God, make us among those among whom the trees of longing for You have spread in the gardens of their chests, and the bitterness of Your love has taken root in the gatherings of their hearts. They dwell in the dens of thoughts, and in pastures of closeness and openness they graze, and in the basins of love with the cup of affection they graze, and they buy On the refinery they want, they may The veil was removed from their eyes, the darkness of doubt from their beliefs was lifted from their consciences, and the turmoil of doubt was removed from their hearts and souls. And their hearts were cheered by the attainment of knowledge, and their spirits were lifted by the precedence of happiness in asceticism, and their drinking was sweet in terms of their dealings, and they were pleasant in the water. People are not their secret And he was safe in the land of fear from their flock, and he was assured of returning to the Lord of lords themselves, and his souls were certain of victory and success. M, and their eyes were settled by looking at their beloved ones, and their decision was settled by understanding the question and achieving what was hoped for, and they gained in selling this world for the hereafter. 'Their trade.'"
        },
        {
            "TitleA": "مناجاة الذاكرين",
            "TitleE": "A monologue to those who remember",
            "NameA": "إِلَهِي لَوْ لَا الْوَاجِبُ مِنْ قَبُولِ أَمْرِكَ لَنَزَّهْتُكَ مِنْ ذِكْرِي إِيَّاكَ ، عَلَى أَنَّ ذِكْرِي لَكَ بِقَدْرِي لَا بِقَدْرِكَ ، وَ مَا عَسَى أَنْ يَبْلُغَ مِقْدَارِي حَتَّى أُجْعَلَ مَحَلًّا لِتَقْدِيسِكَ ، وَ مِنْ أَعْظَمِ النِّعَمِ عَلَيْنَا جَرَيَانُ ذِكْرِكَ عَلَى أَلْسِنَتِنَا ، وَ إِذْنُكَ لَنَا بِدُعَائِكَ وَ تَنْزِيهِكَ وَ تَسْبِيحِكَ . إِلَهِي فَأَلْهِمْنَا ذِكْرَكَ فِي الْخَلَإِ وَ الْمَلَإِ ، وَ اللَّيْلِ وَ النَّهَارِ ، وَ الْإِعْلَانِ وَ الْإِسْرَارِ ، وَ فِي السَّرَّاءِ وَ الضَّرَّاءِ ، وَ آنِسْنَا بِالذِّكْرِ الْخَفِيِّ ، وَ اسْتَعْمِلْنَا بِالْعَمَلِ الزَّكِيِّ ، وَ السَّعْيِ الْمَرْضِيِّ ، وَ جَازِنَا بِالْمِيزَانِ الْوَفِيِّ . إِلَهِي بِكَ هَامَتِ الْقُلُوبُ الْوَالِهَةُ ، وَ عَلَى مَعْرِفَتِكَ جُمِعَتِ الْعُقُولُ الْمُتَبَايِنَةُ ، فَلَا تَطْمَئِنُّ الْقُلُوبُ إِلَّا بِذِكْرَاكَ ، وَ لَا تَسْكُنُ النُّفُوسُ إِلَّا عِنْدَ رُؤْيَاكَ ، أَنْتَ الْمُسَبَّحُ فِي كُلِّ مَكَانٍ ، وَ الْمَعْبُودُ فِي كُلِّ زَمَانٍ ، وَ الْمَوْجُودُ فِي كُلِّ أَوَانٍ ، وَ الْمَدْعُوُّ بِكُلِّ لِسَانٍ ، وَ الْمُعَظَّمُ فِي كُلِّ جَنَانٍ ، وَ أَسْتَغْفِرُكَ مِنْ كُلِّ لَذَّةٍ بِغَيْرِ ذِكْرِكَ ، وَ مِنْ كُلِّ رَاحَةٍ بِغَيْرِ أُنْسِكَ ، وَ مِنْ كُلِّ سُرُورٍ بِغَيْرِ قُرْبِكَ ، وَ مِنْ كُلِّ شُغُلٍ بِغَيْرِ طَاعَتِكَ . إِلَهِي أَنْتَ قُلْتَ وَ قَوْلُكَ الْحَقُّ ﴿ يَا أَيُّهَا الَّذِينَ آمَنُوا اذْكُرُوا اللَّهَ ذِكْرًا كَثِيرًا * وَسَبِّحُوهُ بُكْرَةً وَأَصِيلًا ﴾ 1 ، وَ قُلْتَ وَ قَوْلُكَ الْحَقُّ ﴿ فَاذْكُرُونِي أَذْكُرْكُمْ ... ﴾ 2 فَأَمَرْتَنَا بِذِكْرِكَ وَ وَعَدْتَنَا عَلَيْهِ أَنْ تَذْكُرَنَا ، تَشْرِيفاً لَنَا وَ تَفْخِيماً وَ إِعْظَاماً ، وَ هَا نَحْنُ ذَاكِرُوكَ كَمَا أَمَرْتَنَا ، فَأَنْجِزْ لَنَا مَا وَعَدْتَنَا ، يَا ذَاكِرَ الذَّاكِرِينَ ، وَ يَا أَرْحَمَ الرَّاحِمِينَ",
            "NameE": " the Most Gracious, the Most Merciful My God, if it were not for the obligatory duty of accepting your command, I would have removed you from my remembrance of you, provided that my remembrance of you is as much as I can do forever.Your reach, and my destiny will never reach my level until I am made a place for your sanctification, and one of the greatest blessings upon us is that your remembrance continues to Our tongues, and Your permission to us through Your supplication, Your exaltation, and Your glorification. My God, inspire us with Your remembrance in private and in public, and by night and day, and in openly and secretly, in good times and in bad times, and make us familiar with hidden remembrance, and use us with pure deeds and satisfactory endeavours, and Reward us with a fair balance. My God, lost hearts have been inspired by you, and disparate minds have been brought together in your knowledge, so hearts are not at peace except through Your remembrance, and souls do not rest except when they see You. You are the One who is glorified in every place, worshiped at all times, and present at all times. The one who is invited by every tongue, and the one who is honored in every garden, and I ask forgiveness from you for every pleasure other than your remembrance, and for every comfort without forgetting you, and for every pleasure. Without your closeness, and from every occupation other than your obedience. My God, You have said, and Your saying is the truth. “O you who have believed, remember Allah abundantly, * and glorify Him morning and evening.” True: “So remember Me, and I will remember you...” 2 So You commanded us to mention You, and You promised us that you would remember Us, to honour, magnify, and exalt us. And here we are, remembering you as you commanded us, so fulfill for us what you promised us, O Rememberer of those who remember, and O Most Merciful of those who show mercy."
        },
        {
            "TitleA": "مناجاة المعتصمين ",
            "TitleE": "The Muttasim's Monologues",
            "NameA": "اللَّهُمَّ يَا مَلَاذَ اللَّائِذِينَ ، وَ يَا مَعَاذَ الْعَائِذِينَ ، وَ يَا مُنْجِيَ الْهَالِكِينَ ، وَ يَا عَاصِمَ الْبَائِسِينَ ، وَ يَا رَاحِمَ الْمَسَاكِينِ ، وَ يَا مُجِيبَ الْمُضْطَرِّينَ ، وَ يَا كَنْزَ الْمُفْتَقِرِينَ ، وَ يَا جَابِرَ الْمُنْكَسِرِينَ ، وَ يَا مَأْوَى الْمُنْقَطِعِينَ ، وَ يَا نَاصِرَ الْمُسْتَضْعَفِينَ ، وَ يَا مُجِيرَ الْخَائِفِينَ ، وَ يَا مُغِيثَ الْمَكْرُوبِينَ ، وَ يَا حِصْنَ اللَّاجِينَ ، إِنْ لَمْ أَعُذْ بِعِزَّتِكَ فَبِمَنْ أَعُوذُ ، وَ إِنْ لَمْ أَلُذْ بِقُدْرَتِكَ فَبِمَنْ أَلُوذُ ، وَ قَدْ أَلْجَأَتْنِي الذُّنُوبُ إِلَى التَّشَبُّثِ بِأَذْيَالِ عَفْوِكَ ، وَ أَحْوَجَتْنِي الْخَطَايَا إِلَى اسْتِفْتَاحِ أَبْوَابِ صَفْحِكَ ، وَ دَعَتْنِي الْإِسَاءَةُ إِلَى الْإِنَاخَةِ بِفِنَاءِ عِزِّكَ ، وَ حَمَلَتْنِي الْمَخَافَةُ مِنْ نَقِمَتِكَ عَلَى التَّمَسُّكِ بِعُرْوَةِ عَطْفِكَ ، وَ مَا حَقُّ مَنِ اعْتَصَمَ بِحَبْلِكَ أَنْ يُخْذَلَ ، وَ لَا يَلِيقُ بِمَنِ اسْتَجَارَ بِعِزِّكَ أَنْ يُسْلَمَ أَوْ يُهْمَلَ . إِلَهِي فَلَا تُخْلِنَا مِنْ حِمَايَتِكَ ، وَ لَا تُعْرِنَا مِنْ رِعَايَتِكَ ، وَ ذُدْنَا عَنْ مَوَارِدِ الْهَلَكَةِ ، فَإِنَّا بِعَيْنِكَ وَ فِي كَنَفِكَ ، وَ لَكَ أَسْأَلُكَ بِأَهْلِ خَاصَّتِكَ مِنْ مَلَائِكَتِكَ ، وَ الصَّالِحِينَ مِنْ بَرِيَّتِكَ ، أَنْ تَجْعَلَ عَلَيْنَا وَاقِيَةً تُنْجِينَا مِنَ الْهَلَكَاتِ ، وَ تُجَنِّبُنَا مِنَ الْآفَاتِ ، وَ تُكِنُّنَا مِنْ دَوَاهِي الْمُصِيبَاتِ ، وَ أَنْ تُنْزِلَ عَلَيْنَا مِنْ سَكِينَتِكَ ، وَ أَنْ تُغَشِّيَ وُجُوهَنَا بِأَنْوَارِ مَحَبَّتِكَ ، وَ أَنْ تُؤْوِيَنَا إِلَى شَدِيدِ رُكْنِكَ ، وَ أَنْ تَحْوِيَنَا فِي أَكْنَافِ عِصْمَتِكَ ، بِرَأْفَتِكَ وَ رَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ ",
            "NameE": " the Most Gracious, the Most Merciful O God, O refuge of the afflicted, O protector of those in need, O savior of the perishing, O protector of the wretched, and O comforter of O protector of the poor, O responder of the distressed, O treasurer of the needy, O restorer of the oppressed. O refuge for the bereft, O helper of the oppressed, O protector of the fearful, O succor of the distressed, O bulwark of the refugees, if I do not seek refuge... If I displease you, then to whom can I seek refuge, and if I do not seek refuge in your power, then to whom can I seek refuge? Sins have forced me to cling to the tails of your forgiveness. And sins made me need to open the doors of your forgiveness, and insults made me groan at the annihilation of your glory, and fear of vengeance made me carry me. Be committed to holding on to the bond of Your compassion, and it is not right for the one who holds fast to Your rope to be let down, and it is not appropriate for the one who has sought refuge in Your glory to be surrendered or neglected. She does not leave us alone Protect you, do not deprive us of your care, and protect us from the sources of destruction, for we are in your eyes and in your protection, and I ask you about the people of your special people. From your angels, and the righteous from your creation, to set a protector over us, saving us from destruction, sparing us from calamities, and protecting us from cures. calamities, and to send down upon us from your tranquility, and to cover our faces with the lights of your love, and to shelter us in your deepest abode, and Cover us within the confines of Your protection, with Your compassion and mercy, O Most Merciful of the Merciful."
        },
        {
            "TitleA": "مناجاة الزاهدين ",
            "TitleE": "The Ascetics' Conversation",
            "NameA": "إِلَهِي أَسْكَنْتَنَا دَاراً حَفَرَتْ لَنَا حُفَرَ مَكْرِهَا ، وَ عَلَّقَتْنَا بِأَيْدِي الْمَنَايَا فِي حَبَائِلِ غَدْرِهَا ، فَإِلَيْكَ نَلْتَجِئُ مِنْ مَكَائِدِ خُدَعِهَا ، وَ بِكَ نَعْتَصِمُ مِنَ الِاغْتِرَارِ بِزَخَارِفِ زِينَتِهَا ، فَإِنَّهَا الْمُهْلِكَةُ طُلَّابَهَا ، الْمُتْلِفَةُ حُلَّالَهَا ، الْمَحْشُوَّةُ بِالْآفَاتِ ، الْمَشْحُونَةُ بِالنَّكَبَاتِ .إِلَهِي فَزَهِّدْنَا فِيهَا وَ سَلِّمْنَا مِنْهَا بِتَوْفِيقِكَ وَ عِصْمَتِكَ ، وَ انْزَعْ عَنَّا جَلَابِيبَ  مُخَالَفَتِكَ ، وَ تَوَلَّ أُمُورَنَا بِحُسْنِ كِفَايَتِكَ ، وَ أَوْفِرْ مَزِيدَنَا مِنْ سَعَةِ رَحْمَتِكَ ، وَ أَجْمِلْ صِلَاتِنَا مِنْ فَيْضِ مَوَاهِبِكَ ، وَ اغْرِسْ فِي أَفْئِدَتِنَا أَشْجَارَ مَحَبَّتِكَ ، وَ أَتْمِمْ لَنَا أَنْوَارَ مَعْرِفَتِكَ ، وَ أَذِقْنَا حَلَاوَةَ عَفْوِكَ وَ لَذَّةَ مَغْفِرَتِكَ ، وَ أَقْرِرْ أَعْيُنَنَا يَوْمَ لِقَائِكَ بِرُؤْيَتِكَ ، وَ أَخْرِجْ حُبَّ الدُّنْيَا مِنْ قُلُوبِنَا ، كَمَا فَعَلْتَ بِالصَّالِحِينَ مِنْ صَفْوَتِكَ وَ الْأَبْرَارِ مِنْ خَاصَّتِكَ ، بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ ، وَ يَا أَكْرَمَ الْأَكْرَمِينَ",
            "NameE": " the Most Gracious, the Most Merciful. My God, You have made us dwell in an abode that has dug for us the pits of its deceit, and has tied us up in the hands of the abyss in the ropes of its treachery. So to you We seek refuge from the machinations of its deceptions, and through you we are protected from being deceived by the trappings of its adornment, for it is the destroyer of its seekers, the destroyer, its lawful. Filled with pests fraught with calamities. My God, so let us abstain from it and save us from it by Your grace and protection, and remove from us the veils of dissent from You, and take care of our affairs. Improve your sufficiency, provide us with more of the breadth of your mercy, beautify our prayers from the abundance of your talents, and plant trees of love in our hearts. K, and complete for us Illuminate your knowledge, make us taste the sweetness of your forgiveness and the pleasure of your forgiveness, and refresh our eyes on the day we meet you with your vision, and drive out the love of the worldly. From our hearts, as You did to the righteous among Your elite and the righteous among Your elite, by Your mercy, O Most Merciful of the merciful, and O Most Generous of Generous."
        },
        {
            "TitleA": "المناجاة الشعبانية",
            "TitleE": "The Shaabaniya Munajat",
            "NameA": "اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاسْمَعْ دُعائِي إذا دَعَوْتُكَ وَاسْمَعْ نِدائِي إِذا نادَيْتُكَ وَاقْبِلْ عَلَيَّ إِذا ناجَيْتُكَ ، فَقَدْ هَرَبْتُ إِلَيْكَ وَوَقَفْتُ بَيْنَ يَدَيْكَ مُسْتَكِيناً لَكَ مُتَضَرِّعاً إِلَيْكَ راجِياً لِما لَدَيْكَ ثَوابي وَتَعْلَمُ ما فِي نَفْسِي وَتَخْبُرُ حاجَتِي وَتَعْرِفُ ضَمِيرِي ، وَلايَخْفى عَلَيْكَ أَمْرُ مُنْقَلَبِي وَمَثْوايَ وَما اُرِيدُ أَنْ أُبْدِيَ بِهِ مِنْ مَنْطِقِي وَأَتَفَوَّهُ بِهِ مِنْ طَلِبَتِي وَأَرْجُوهُ لِعاقِبَتِي ، وَقَدْ جَرَتْ مَقادِيرُكَ عَلَيَّ يا سَيِّدِي فِيما يَكُونُ مِنِّي إِلى آخِرِ عُمرِي مِنْ سَرِيرَتِي وَعَلانِيَّتِي وَبِيَدِكَ لا بِيَدِ غَيْرِكَ زِيادَتِي وَنَقْصِي وَنَفْعِي وَضَرِّي ؛ إِلهِي إِنْ حَرَمْتَنِي فَمَنْ ذا الَّذِي يَرْزُقُنِي وَإِنْ خَذَلْتَنِي فَمَنْ ذا الَّذِي يَنْصُرُنِي ، إِلهِي أَعُوذُ بِكَ مِنْ غَضَبِكَ وَحُلُولِ سَخَطِكَ ، إِلهِي إِنْ كُنْتُ غَيْرَ مُسْتَأْهِلٍ لِرَحْمَتِكَ فَأَنْتَ أَهْلٌ أَنْ تَجُودَ عَلَيَّ بِفَضْلِ سَعَتِكَ ، إِلهِي كَأَنِّي بِنَفْسِي وَاقِفَةٌ بَيْنَ يَدَيْكَ وَقَدْ أَظَلَّها حُسْنُ تَوَكُّلِي عَلَيْكَ فَقُلتَ 1 ما أَنْتَ أَهْلُهُ وَتَغَمَّدْتَنِي بِعَفْوِكَ ، إِلهِي إِنْ عَفَوْتَ فَمَنْ أَوْلى مِنْكَ بِذلِكَ وَإِنْ كانَ قَدْ دَنا أَجَلِي وَلَمْ يُدْنِنِي 2 مِنْكَ عَمَلِي فَقَدْ جَعَلْتُ الاِقْرارَ بِالذَّنْبِ إِلَيْكَ وَسِيلَتِي ، إِلهِي قَدْ جُرْتُ عَلى نَفْسِي فِي النَّظَرِ لَها فَلَها الوَيْلُ إِنْ لَمْ تَغْفِرْ لَها ، إِلهِي لَمْ يَزَلْ بِرُّكَ عَلَيَّ أَيَّامَ حَياتِي فَلا تَقْطَعْ بِرِّكَ عَنِّي فِي مَماتي ، إِلهِي كَيْفَ آيَسُ مِنْ حُسْنِ نَظَرِكَ لِي بَعْدَ مَماتِي وَأَنْتَ لَمْ تُوَلِّنِي 3 إِلاّ الجَمِيلَ فِي حَياتِي ، إِلهِي تَوَلَّ مِنْ أَمْرِي ما أَنْتَ أَهْلُهُ وَعُدْ عَلَيَّ 4 بِفَضْلِكَ عَلى مُذْنِبٍ قَدْ غَمَرَهُ جَهْلُهُ ، إِلهِي قَدْ سَتَرْتَ عَلَيَّ ذُنُوبا فِي الدُّنْيا وَأَنا أَحْوَجُ إِلى سَتْرِها عَلَيَّ مِنْكَ فِي الآخرى 5 إِذْ لَمْ تُظْهِرْها لاَحَدٍ مِنْ عِبادِكَ الصّالِحِينَ فَلا تَفْضَحْنِي يَوْمَ القِيامَةِ عَلى رؤوسِ الاَشْهادِ ، إِلهِي جُودُكَ بَسَطَ أَمَلِي وَعَفْوُكَ أَفْضَلُ مِنْ عَمَلِي ، إِلهِي فَسُرَّنِي بِلِقائِكَ يَوْمَ تَقْضِي فِيهِ بَيْنَ عِبادِكَ ، إِلهِي اعْتِذاري إِلَيْكَ اعْتذارُ مَنْ لَمْ يَسْتغْنِ عَنْ قَبُولِ عُذْرِهِ فَاقْبَلْ عُذْرِي يا أكْرَمَ مَنْ اعْتَذَرَ إِلَيْهِ المُسِيئُونَ ، إِلهِي لاتَرُدَّ حاجَتِي وَلاتُخَيِّبْ طَمَعِي وَلاتَقْطَعْ مِنْكَ رَجائِي وَأَمَلِي ، إِلهِي لَوْ أَرَدْتَ هَوانِي لَمْ تَهْدِنِي وَلَوْ أَرَدْتَ فَضِيحَتي لَمْ تُعافِنِي ، إِلهِي ما أَظُنُّكَ تَرُدُّنِي فِي حاجَةٍ قَدْ أَفْنَيْتُ عُمْرِي فِي طَلَبِها مِنْكَ ، إِلهِي فَلَكَ الحَمْدُ أَبَداً أَبَداً دائِماً سَرْمَداً يَزِيدُ وَلا يَبِيدُ كَما تُحِبُّ وَتَرْضى ، إِلهِي إِنْ أَخَذْتَنِي بِجُرْمِي أَخَذْتُكَ بِعَفْوِكَ وَإِنْ أَخَذْتَنِي بِذُنُوبِي أَخَذْتُكَ بِمَغْفِرَتِكَ وَإِنْ أَدْخَلْتَنِي النَّارَ أَعْلَمْتُ أَهْلَها أَنِّي اُحِبُّكَ ، إِلهِي إِنْ كانَ صَغُرَ فِي جَنْبِ طاعَتِكَ عَمَلِي فَقَدْ كَبُرَ فِي جَنْبِ رَجائِكَ أَمَلِي ، إِلهِي كَيْفَ أَنْقَلِبُ مِنْ عِنْدِكَ بِالخَيْبَةِ مَحْرُوما وَقَدْ كانَ حُسْنُ ظَنِّي بِجُودِكَ أَنْ تَقْلِبَنِي بالنَّجاةِ مَرْحُوما ، إِلهِي وَقَدْ أَفْنَيْتُ عُمْرِي فِي شِرَّةِ السَّهْوِ عَنْكَ وَأَبْلَيْتُ شَبابِي فِي سَكْرَةِ التَّباعُدِ مِنْكَ فَلَمْ أَسْتَيْقِظْ أَيَّامَ اغْتِرارِي بِكَ وَرُكُونِي إِلى سَبِيلِ سَخَطِكَ ، إِلهِي وَأَنا عَبْدُكَ وَابْنُ عَبْدِكَ قائِمٌ بَيْنَ يَدَيْكَ مُتَوَسِّلُّ بِكَرَمِكَ إِلَيْكَ ، إِلهِي أَنا عَبْدٌ أَتَنَصَّلُ إِلَيْكَ مِمَّا كُنْتُ أُواجِهُكَ بِهِ مِنْ قِلَّةِ اسْتِحيائِي مِنْ نَظَرِكَ وَأَطْلُبُ العَفْوَ مِنْكَ إِذِ العَفْوُ نَعْتٌ لِكَرَمِكَ ، إِلهِي لَمْ يَكُنْ لِي حَوْلٌ فَأَنْتَقِل بِهِ عَنْ مَعْصِيَتِكَ إِلاّ فِي وَقْتٍ أَيْقَظْتَنِي لِمَحَبَّتِكَ وَكَما أَرَدْتَ أَنْ أَكُونَ كُنْتُ فَشَكَرْتُكَ بإدْخالِي فِي كَرَمِكَ وَلِتَطْهِيرِ قَلْبِي مِنْ أَوْساخِ الغَفْلَةِ عَنْكَ. إِلهِي انْظُرْ إلى نَظَرَ مَنْ نادَيْتَهُ فَأَجابَكَ وَاسْتَعْمَلْتَهُ بِمَعُونَتِكَ فَأَطاعَكَ يا قَرِيبا لايَبْعُدُ عَنْ المُغْتَرِّ بِهِ يا جَواداً لايَبْخلُ عَمَّنْ رَجا ثَوابَهُ ، إِلهِي هَبْ لِي قَلْبا يُدْنِيهِ مِنْكَ شَوْقُهُ وَلِسانا يُرْفَعُ إِلَيْكَ صِدْقُهُ وَنَظَراً يُقَرِّبُهُ مِنْكَ حَقُّهُ ، إِلهِي إِنَّ مَنْ تَعَرَّفَ بِكَ غَيْرُ مَجْهُولٍ وَمِنْ لاذَ بِكَ غَيْرُ مخْذُولٍ وَمَنْ أَقْبَلْتَ عَلَيْهِ غَيْرُ مَمْلُوكٍ 6. إِلهِي إنَّ مَنْ انْتَهَجَ بِكَ لَمُسْتَنِيرٌ وَإِنَّ مَنِ اعْتَصَمَ بِكَ لَمُسْتَجِيرٌ وَقَدْ لُذْتُ بِكَ يا إِلهِي فَلا تُخَيِّبْ ظَنِّي مِنْ رَحْمَتِكَ وَلا تَحْجُبْنِي عَنْ رَأفَتِكَ ، إِلهِي أَقِمْنِي فِي أَهْلِ وِلايَتِكَ مُقامَ مَنْ رَجا الزِّيادَةَ مِنْ محَبَّتِكَ ، إِلهِي وَأَلْهِمْنِي وَلَها بِذِكْرِكَ إِلى ذِكْرِكَ وَهِمَّتِي فِي رَوْحِ نَجاحِ أَسْمائِكَ وَمَحَلِّ قُدْسِكَ. إِلهِي بِكَ عَلَيْكَ إِلاّ أَلْحَقْتَنِي بِمَحَلِّ أَهْلِ طاعَتِكَ وَالمَثْوى الصَّالِحِ مِنْ مَرْضاتَِك فَإِنِّي لا أَقْدِرُ لِنَفْسِي دَفْعاً وَلا أَمْلِكُ لَها نَفْعاً ، إِلهِي أَنا عَبْدُكَ الضَّعِيفُ المُذْنِبُ وَمَمْلُوكُكَ المُنِيبُ 7 فَلا تَجْعَلْنِي مِمَّنْ صَرَفْتَ عَنْهُ وَجْهَكَ وَحَجَبَهُ سَهْوُهُ عَنْ عَفْوِكَ ، إِلهِي هَبْ لِي كَمال الاِنقطاعِ إِلَيْكَ وَأَنِرْ أَبْصارَ قُلُوبنا بِضِياءِ نَظَرِها إِلَيْكَ حَتّى تَخْرِقَ أَبْصارُ القُلُوبِ حُجُبَ النُّورِ فَتَصِلَ إِلى مَعْدِنِ العَظَمَةِ وَتَصِيرَ أَرْواحُنا مُعَلَّقَةً بِعِزِّ قُدْسِكَ. إِلهِي وَاجْعَلْنِي مِمَّنْ نادَيْتَهُ فَأَجابَكَ وَلاحَظْتَهُ فَصَعِقَ لِجَلالِكَ فَناجَيْتَهُ سِرَّا وَعَمِلَ لَكَ جَهْراً ، إِلهِي لَمْ اُسَلِّطْ عَلى حُسْنِ ظَنِّي قُنُوطَ الاَياسِ وَلا انْقَطَعَ رَجائِي مِنْ جَميلِ كَرَمِكَ ، إِلهِي إنْ كانَتِ الخَطايا قَدْ أَسْقَطَتْنِي لَدَيْكَ فَاصْفَحْ عَنِّي بِحُسْنِ تَوَكُّلِي عَلَيْكَ ، إِلهِي إِنْ حَطَّتْنِي الذُّنُوبُ مِنْ مَكارِمِ لُطْفِكَ فَقَدْ نَبَّهَنِي اليَّقِينُ إِلى كَرَمِ عَطْفِكَ ، إِلهِي إِنْ أَنامَتْنِي الغَفْلَةُ عَنِ الاِسْتِعْدادِ لِلِقائِكَ فَقَدْ نَبَّهَتْنِي المَعْرِفَةُ بِكَرَمِ آلائِكَ ، إِلهِي إِنْ دَعانِي إِلى النَّارِ عَظِيمُ عِقابِكَ فَقَدْ دَعانِي إِلى الجَنَّةِ جَزِيلُ ثَوابِكَ ، إِلهِي فَلَكَ أَسْأَلُ وَإِلَيْكَ أَبْتَهِلُ وَأَرْغَبُ وَأَسْأَلُكَ أَنْ تُصَلِّيَ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأَنْ تَجْعَلَنِي مِمَّنْ يُدِيمُ ذِكْرَكَ وَلايَنْقُضُ عَهْدَكَ وَلايَغْفَلُ عَنْ شُكْرِكَ وَلا يَسْتَخِفُّ بِأَمْرِكَ ، إِلهِي وَأَلْحِقْنِي بِنُورِ عِزِّكَ الاَبْهَجِ فَأَكُونَ لَكَ عارِفاً وَعَنْ سِواكَ مُنْحَرِفاً وَمِنْكَ خائِفاً مُراقِباً يا ذا الجَلالِ وَالاِكْرامِ وَصلَّى الله عَلى مُحَمَّدٍ رَسُولِهِ وَآلِهِ الطَّاهِرينَ وَسَلَّمَ تَسْلِيماً كَثِيراً 8.",
            "NameE": "O God, bless Muhammad and the family of Muhammad, and hear my supplication when I call upon you, and hear my call when I call upon you, and accept me when I rescue you, for I have fled to you and stood before you. We rely on You, supplicating to You and hoping for You as my reward, and You know what is in my soul, and You inform me of my needs, and You know my conscience, and nothing is hidden from You. My turning, my resting place, and what I want to express my reasoning with, and utter my request with, and hope for in my outcome, and Your decrees have been carried out upon me, my lord, in what may be. From me until the end of my life, from my bed and my public, and in your hand, and in no one else's hand, is my increase and my deficiency, my benefit and my harm. My God, if you deprive me, then who is there that can provide for me? Who He is the one who helps me. My God, I seek refuge in You from Your wrath and the eruption of Your wrath. My God, if I am not worthy of Your mercy, then You are worthy of being gracious to me. Because of your patience, my God, it is as if I myself were standing in your hands, shaded by the goodness of my trust in you, and you said, “You are not worthy” and you covered me with your forgiveness. My God, if He forgives And whoever is better From you in this, even though my time has approached and my deeds have not brought me closer to you, I have made confessing my sin to you my way. If you do not forgive her, my God, your righteousness upon me does not cease in the days of my life. Do not cut off your righteousness from me when I die. My God, how? I despair of your good consideration of me after my death, and you have not given me anything but the good in my life. He was overwhelmed by his ignorance. My God, You have covered my sins in this world, and I am in need of You covering them for me in the next. 5 When You have not shown it to any of your righteous servants, so do not disgrace me on the Day of Resurrection in the presence of witnesses. My God, your generosity has extended my hope and your forgiveness is better than my work. My God, make me happy with I meet you on a day in which you will judge among your servants. My God, my apology to you is the apology of one who cannot do without accepting his excuse, so accept my excuse, O Most Generous of the one to whom the touch apologizes. He groaned My God, do not reject my need, do not disappoint my greed, and do not cut off my hope and hope from You. My God, if you had desired my indignities, you would not have guided me, and if you had wanted to expose me, you would not have spared me. My God, I do not think of you. You ask me for a need that I have spent my entire life requesting from you. My God, praise be to You, forever and ever, everlasting, increasing and not ceasing, as You love and are pleased with. My God, if you hold me accountable for my crime, I will hold you accountable for your forgiveness, and if you hold me accountable for my sins, I will hold you for your forgiveness, and if you cause me to enter Hell, I will let its people know that I will live. By You, my God, if my work was small in your obedience to You, then my hope has grown in the side of your hope. My God, how can I turn away from You in disappointment, deprived, when it was good? I believe in your goodness that you will save me, merciful. My God, I have spent my life in the evil of neglecting You, and I have spent my youth in the intoxication of being far from You, and I did not wake up to the days when I was deceived by You and abandoned myself to a path of lavishness. Thy, my God, and I am your servant, and the son of your servant is standing before you, beseeching your generosity to you. Greetings from I look at you and I ask for your forgiveness, since forgiveness is an attribute of your generosity. My God, there was no way for me to turn away from disobeying you, except at a time when you woke me up for a moment. I am your home and as you wanted me to be, so I thanked you for admitting me to your generosity and for cleansing my heart of the filth of neglect of you. My God, look at the look of the one to whom you called and he answered you and you used him with your help and he obeyed you, O relative who is not far from the one who is deceived by him, O horse who is not stingy from the one whose reward he hopes for, my God. I have a heart whose longing brings it close to you, a tongue whose sincerity raises itself to you, and a look that brings its truth closer to you. My God, whoever recognizes you is not unknown, and whoever seeks refuge in you is not unknown. He will be abandoned, and whoever you accept will not be controlled. 6. My God, whoever follows you will be enlightened, and whoever holds fast to you will be protected. I have taken refuge in you, my God, so do not be afraid. Trust me in your mercy and do not withhold me from your mercy. My God, place me among the people of your authority in the place of one who hopes for an increase in your love. My God, inspire me and her with this. CKK To your remembrance and my inspiration in the spirit of the success of your names and your holy place. My God, I beg you, unless you join me in the place of your obedient people and a good abode from your pleasures, for I am not able to defend myself nor can I benefit from it. I am my God. Your weak and guilty servant and Your repentant king. 7 So do not make me among those from whom You have turned Your face away and whose oversight has withheld Your pardon. My God, grant me complete severance from You. Enlighten the eyes of our hearts With the light of its gaze upon you, such that the eyes of hearts pierce the veils of light."
        }
    ]
}