{
    "Prayer": [
        {
            "TitleA": "تعقيبات صلاة الصبح",
            "TitleE": "Comments for the morning prayer",
            "DscrpE": "O God, bless Muhammad and the family of Muhammad and guide me to the truth in what I disagreed about, with Your permission. Indeed, You guide whomever You wish to a straight path. And you say ten times: O God, bless Muhammad and the family of Muhammad, the guardians. those who are satisfied and accepted with your best prayers, and bless them with your best blessings. May peace be upon them, their souls, and their bodies, and God’s mercy and blessings.\nAnd this prayer also occurs on Friday afternoon, with great grace. And also say: O God, grant me life for what you revived Ali ibn Abi Talib and make me die for what Ali ibn Abi Talib died for (Ali Peace be upon him) And say a hundred One hundred times: I ask God for forgiveness and I repent to Him. And a hundred times: I ask God for well-being. A hundred times: I seek refuge with God from Hell. A hundred times: And I ask Him for Paradise. A hundred times: I ask God for the beautiful fair eye. A hundred times: There is no god but God, the King, the clear truth. And a hundred times: Once: Monotheism, and a hundred times: May God’s blessings be upon Muhammad and the family of Muhammad. And a hundred times: Glory be to God, and praise be to God, and there is no god but God, and God is great, and there is no power nor strength except in God, the Most High, the Great. And a hundred times: Whatever God wills, it happens, and there is no power or strength except in God, the Most High, the Great. \nThen say: I have become, O God, protected by Your invincible protection that cannot be reached or attempted from the evil of every oppressor and intruder among all whom You have created, and what You have created from among Your silent and speaking creation, in a paradise from every fearful one. With apparel, displaying the loyalty of the household of your Prophet, concealing myself from every one who seeks to harm me with a strong wall. Sincerity in recognizing their right, and clinging to their rope, being certain that the right is theirs, with them, in them, and in them, the relatives of those who follow them, and the foreigners of those who side with them, so protect me, O God, from the evil of all that I fear, O Great One. I have withheld the hostiles from me by the Creator of the heavens and the earth. Indeed, We have made before them a barrier and behind them a barrier, then We have covered them so that they do not see. ",
            "DscrpA": "اللهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاهدِني لِما اختُلِفَ فيهِ مِنَ الحَقِّ بِإذنِكَ، إنَّكَ تَهدي مَن تَشاءُ إلى صِراطٍ مُستَقيمٍ. \nوتقول عشر مرّات: اللهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآل مُحَمَّدٍ الأوصياءِ الرَّاضينَ المَرضيّينَ بِأفضَلِ صَلَواتِـكَ، وَبارك عَلَيهِم بِأفضَلِ بَرَكاتِكَ، وَالسَّلامُ عَلَيهِم وَعَلى أرواحِهِم وَأجسادِهِم وَرَحمَةُ اللهِ وَبَرَكاتُهُ. \nوهذه الصلاة واردة يوم الجمعة أيضاً عصراً بفضل عظيم. وقل أيضاً: اللهُمَّ أحيِني عَلى ما أحيَيتَ عَلَيهِ عَليَّ بن أبي طالِبٍ وَأمِتني عَلى ما ماتَ عَلَيهِ عَلي بنَ أبي طالِبٍ (عليه السلام) . وقل مائة مرّة: استَغفِرُ الله وَأتوبُ إلَيهِ. \nومائة مرّة: أسألُ اللهَ العافيَةَ. ومائة مرّة: أستَجيرُ بِالله مِنَ النَّارِ .ومائة مرّة: وَأسألَهُ الجَنَّةَ. ومائة مرّة: أسألُ الله الحورَ العينَ. ومائة مرّة: لا إلهَ إلاّ اللهُ المَلِكُ الحَقُّ المُبينُ .ومائة مرّة: التوحيد. ومائة مرّة: صَلّى اللهُ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ. ومائة مرّة:سُبحانَ اللهِ، وَالحَمدُ للهِ ، وَلا إلهَ إلاّ اللهُ، وَاللهُ أكبَرُ، وَلا حَولَ وَلا قوَّةَ إلاّ بِالله العَليِّ العَظيمِ . ومائة مرّة: ما شاءَ الله كانَ، وَلا حَولَ وَلا قوَّةَ إلاّ بِالله العَليِّ العَظيمِ. \nثمّ قل: أصبَحتُ اللهُمَّ مُعتَصِماً بِذِمامِكَ المَنيعِ الَّذي لا يُطاوَلُ وَلا يُحاوَلُ مِن شَرِّ كُلِّ غاشِمٍ وَطارِقٍ مِن سائرِ مَن خَلَقتَ وَما خَلَقتَ مِن خَلقِكَ الصَّامِت وَالنّاطِقِ في جُنَّةٍ مِن كُلِّ مَخوفٍ بِلِباسٍ سابِغَةٍ وَلاءِ أهلِ بَيتِ نَبيِّكَ مُحتَجِباً مِن كُلِّ قاصِدٍ لي إلى أذَيِّةٍ بِجِدارٍ حَصينِ الاخلاصِ في الاعتِرافِ بِحَقِّهِم، وَالتَّمَسُّكِ بِحَبلِهِم موقِناً أنَّ الحَقَّ لَهُم وَمَعَهُم وَفيهِم وَبِهِم أوالي مَن وَالَوا وَأجانِبُ مَن جانَبوا فَأعِذني اللهُمَّ بِهِم مِن شَرِّ كُلِّ ما أتَّقيهِ يا عَظيمُ حَجَزتُ الأعاديَ عَنّي بِبَديعِ السَّماواتِ وَالأرضِ إنّا جَعَلنا مِن بَين أيديهِم سَدّاً وَمِن خَلفِهِم سَدّاً فَأغشَيناهُم فَهُم لا يُبصِرونَ."
        },
        {
            "TitleA": "تعقيبات صلاه الظهر",
            "TitleE": "Comments for the noon prayer",
            "DscrpE": "There is no god but God, the Great, the Forbearing, there is no god but God, Lord of the Noble Throne, praise be to God, Lord of the worlds. Oh God, I ask you for the reasons for your mercy and the confirmation of your forgiveness, and the spoils of all righteousness, and safety From every sin. Oh God, do not leave me a sin without forgiving it. There is no worry but that You relieve it, there is no sickness but that you heal it, there is no defect but that you cover it, there is no sustenance except that you have extended it, there is no fear except that you have secured it, there is no evil except that you have averted it, there is no need that you are satisfied with and for me, There is no way but its cause; O Most Merciful of the Merciful, Amen, Lord of the Worlds.\nAnd you say ten times: In God I hold fast, in God I trust, and in God I put my trust.\nThen you say: Oh God, if my sins are great, then You are greater, and if my negligence is great, then You are greater, and if my miserliness persists, then You are better, Oh God, forgive Forgive me for my great sins with your great pardon, and my negligence with your apparent generosity. And suppress my stinginess with the grace of your goodness. Oh God, whatever blessing we have is from you, there is no god but you. I ask your forgiveness and I repent to you.",
            "DscrpA": "لا إلهَ إلاّ اللهُ العَظيمُ الحَليمُ، لا إلهَ إلاّ الله رَبُّ العَرشِ الكَريمُ، الحَمدُ للهِ رَبِّ العالَمينَ. اللهُمَّ إنّي أسألُكَ مُوجِباتِ رَحمَتِكَ وَعَزائِمَ مَغفِرَتِكَ، وَالغَنيمَةَ مِن كُلِّ بِرٍّ، وَالسَّلامَةَ مِن كُلِّ إثمٍ. اللهُمَّ لا تَدَع لي ذَنباً إلاّ غَفَرتَهُ، وَلا هَمّاً إلاّ فَرَّجتَهُ، وَلا سُقماً إلاّ شَفَيتَهُ، وَلا عَيباً إلاّ سَتَرتَهُ، وَلا رِزقاً إلاّ بَسَطتَهُ، وَلا خَوفاً إلاّ آمَنتَهُ، وَلا سوءاً إلاّ صَرَفتَهُ، وَلا حاجَةً هيَ لَكَ رِضاً وَليَ فيها صَلاحٌ إلاّ قَضَيتَها؛ يا أرحَمَ الرَّاحِمينَ آمينَ رَبَّ العالَمينَ. \nوَتَقول عشر مَرات: بِاللهِ اعتَصَمتُ وَبِالله أثِقُ وَعَلى الله أتَوَكَّلُ. \nثمّ تقول: اللهُمَّ إن عَظُمَت ذُنوبي فَأنتَ أعظَمُ، وَإن كَبُرَ تَفريطي فَأنتَ أكبَرُ، وَإن دامَ بُخلي فَأنتَ أجوَدُ، اللهُمَّ اغفِر لي عَظيمَ ذُنوبي بِعَظيمِ عَفوِكَ، وَكَثيرَ تَفريطي بِظاهِرِ كَرَمِكَ، وَاقمَع بُخلي بِفَضلِ جودِكَ. اللهُمَّ ما بِنا مِن نِعمَةٍ فَمِنكَ لا إلهَ إلاّ أنتَ. أستَغفِرُكَ وَأتوبُ إلَيكَ."
        },
        {
            "TitleA": "تعقيبات صلاه العصر",
            "TitleE": "Afternoon prayer comments",
            "DscrpE": "I ask forgiveness from God, besides whom there is no god, the Ever-Living, the Most Merciful, the Most Merciful, the Possessor of Majesty and Honour, and I ask Him to repent for me like a humiliated, submissive, poor, wretched, needy, needy, sheltering servant, who does not have a soul. It is of benefit, harm, death, life, and resurrection. Then you say: Oh God, I seek refuge in You from a soul that is not satisfied, from a heart that is not humble, from knowledge that is not beneficial, from a prayer that is not offered, and from a supplication that is not heard. Oh God, I ask you for ease after hardship and relief after distress and hardship. Fear after hardship. Oh God, whatever blessing we have is from you, there is no god. Except you. I ask your forgiveness and I repent to you. On the authority of Al-Sadiq (peace be upon him) who said: Whoever asks forgiveness from God Almighty after the afternoon prayer seventy times, God will forgive him seven hundred sins. It was narrated on the authority of Imam Muhammad Al-Taqi that he said: Whoever recites (Indeed, We sent it down on the Night of Decree) after the afternoon prayer ten times. It passed to him the actions of the creatures on that day. It is recommended to pray for dozens of people every morning and evening, and the best time is after the afternoon on Friday, and the supplication will come later.",
            "DscrpA": "أستَغفِرُ اللهَ الَّذي لا إلهَ إلاّ هُوَ الحَيُّ القَيّومُ الرَّحمنُ الرَّحيمُ ذو الجَلالِ وَالإكرامِ، وَأسألُهُ أن يَتوبَ عَلَيَّ تَوبَةَ عَبدٍ ذَليلٍ خاضِعٍ فَقيرٍ بائِسٍ مِسكينٍ مُستَكينٍ مُستَجيرٍ، لا يملك لِنَفسِهِ نَفعاً وَلا ضَرّاً وَلا مَوتاً وَلا حياةً وَلا نُشوراً. ثمّ تقول: اللهُمَّ إنّي أعوذُ بِكَ مِن نَفسٍ لا تَشبَعُ، وَمِن قَلبٍ لا يَخشَعُ، وَمِن عِلمٍ لا يَنفَعُ، وَمِن صَلاةٍ لا تُرفَعُ، وَمِن دُعاءٍ لا يُسمَعُ. اللهُمَّ إنّي أسألُكَ اليُسرَ بَعدَ العُسرِ وَالفَرَجَ بَعدَ الكَربِ وَالرَّخاءَ بَعدَ الشِّدَّةِ. اللَّهُمَّ ما بِنا مِن نِعمَةٍ فَمِنكَ لا إلهَ إلاّ أنتَ. أستَغفِرُكَ وَأتوبُ إلَيكَ. وعَن الصادق (عليه السلام) قالَ: مَن اَستَغفر الله تعالى بَعدَ صلاة العصر سَبعين مرَّةً غفر الله لَهُ سبعمائة ذنب. وروي عَن الإمام محمد التقي قالَ: مَن قرأ (إنّا أنزَلناهُ في لَيلَةِ القَدرِ) بَعدَ العصر عشر مَرات، مرت لَهُ على مثل اعمال الخلائق في ذلك اليوم. وَيُستحب دعاء العشرات في كُلّ صباحٍ ومَساء، وأفضلُ أوقاته بعد العصر يوم الجمعة وسيأتي الدعاء فيما بعد."
        },
        {
            "TitleA": "تعقيبات صلاه المغرب",
            "TitleE": "Comments for the Maghrib prayer",
            "DscrpE": "She says after praising Al-Zahra (peace be upon her): Indeed, God and His angels send blessings upon the Prophet. O you who have believed, bless him and grant him peace. O God, bless Muhammad the Prophet, his descendants, and his family. \nThen you say seven times: In the name of God The Most Gracious, the Most Merciful, and there is no power nor strength except in God, the Most High, the Great.\nAnd three: Praise be to God, who does what He wills and no one else does what He wills.\nThen say: Glory be to You, there is no god but You, forgive me all my sins. He only forgives all sins You.\nThen you pray the Maghrib voluntary prayer, which is four rak’ahs with two greetings, and you do not say anything between them. The Sheikh said: It was narrated that he recited in the first rak’ah: Surah: Say, O you disbelievers, and in the second: Say, He is God, the One. And in the last two rak’ahs he recited whatever he wanted.\nIt was narrated. Imam Ali al-Naqi (peace be upon him) used to recite Surah al-Hamd in the third rak’ah, and the beginning of Surat al-Hadid until:…And He is All-Knowing of what is at the beginning, and in the fourth rak’ah, al-Hamd, and at the end of Surah al-Hashr, that is, from If We had sent down this Qur’an… until the end of the surah. It is desirable to say in the last prostration of voluntary prayers every night, especially Friday night, seven times: Oh God, I ask you, by your noble face, your great name, and your ancient kingdom, to bless Muhammad and his family, and to forgive me my great sin. Only the great forgives the great. \nIf you have completed the voluntary prayer, then follow with whatever you wish, and say ten times: God willing, there is no power except in God, ask forgiveness from God. \nThen you say: Oh God, I ask you for the reasons for your mercy and the means of your forgiveness, and salvation from the Fire and from every affliction, and winning Paradise and satisfaction in the abode of peace and the presence of your Prophet Muhammad, peace be upon him. May peace be upon him. Oh God, whatever blessing we have is from you, there is no god but you, I ask your forgiveness and I repent to you. \nThe Ghafila prayer is performed between Maghrib and Ishaa, which is two rak'ahs, reciting after the praise in the first: And Dhul-Nun, when he went away in anger, he thought that We would not defeat him, so he called out in the darkness: There is no god but You. Glory be to You. Indeed, I was of the wrongdoers, so we responded to And We saved him from distress, and thus We save the believers. \nAnd in the second: And with Him are the keys of the unseen, no one knows them except Him, and He knows what is on land and sea, and not a leaf falls but He knows it, and no grain in the darknesses of the earth, nor any wet or dry thing but it is in a clear Book. \nThen you take your hands to Qunoot and say: Oh God, I ask you with the keys of the unseen that only you know to bless Muhammad and his family and to do such-and-such to me, and mention your need instead of this word. \nThen you say: Oh God, You are the Grantor of my blessings and the One who is capable of my requests. You know my need, so I ask You by the right of Muhammad and his family, peace be upon them, for what You granted it for me. And ask your need, as it has been narrated that whoever performs this prayer and asks God for his need, God will give him what he asked",
            "DscrpA": "تقول بَعدَ تسبيح الزهراء (عليها السلام): إنَّ اللهَ وَمَلائِكَتَهُ يُصَلّونَ عَلى النَّبيِّ، يا أيُّها الَّذينَ آمَنوا صَلّوا عَلَيهِ وَسَلِّموا تَسليماً. اللهُمَّ صَلِّ عَلى مُحَمَّدٍ النَّبيِّ وَعَلى ذُرّيَّتِهِ وَعَلى أهلِ بَيتِهِ. \nثُمَّ تقول سَبع مَرات: بِسمِ اللهِ الرَّحمنِ الرَّحيمِ وَلا حَول وَلا قوَّةَ إلاّ بِالله العَليِّ العَظيمِ. \nوثلاثاً: الحَمدُ للهِ الَّذي يَفعَلُ ما يَشاءُ وَلا يَفعَلُ ما يَشاءُ غَيرُه. \nثمّ قل: سُبحانَكَ لا إلهَ إلاّ أنتَ اغفِر لي ذُنوبي كُلَّها جَميعاً، فَإنَّهُ لا يَغفِرُ الذُّنوبَ كُلَّها جَميعاً إلاّ أنتَ. \nثمّ تصلّي نافلة المغرب وهي أربع ركعات بسلامين ولا تتكلّم بينهما بشيء. وقال الشيخ: روي أنّه يقرأ في الركعة الاُولى: سورة: قُل يا أيُّها الكافِرونَ، وفي الثانية: قُل هُوَ الله أحَدٌ. وَيَقرأ في الآخريين ما شاء. \nوروي أنّ الإمام عَليّ النقي (عليه السلام) كانَ يقرأ في الركعة الثالثة سورة الحَمد وأوّل سورة الحديد إلى:… وَهُوَ عَلِيمٌ بِذاتِ الصُّدُورِ، وفي الرابعة الحَمد، وآخر سورة الحشر أي مِن لَو أنزَلنا هذا القُرآنَ… إلى آخر السورة. وَيُستحب أن تقول في السجدة الأخيره مِن النوافل في كُل ليلة سيما لَيلَة الجمعة سَبع مَرات: اللهُمَّ إنّي أسألُكَ بِوَجهِكَ الكَريمِ وَاسمِكَ العَظيمِ وَمُلكِكَ القَديمِ أن تُصَلّيَ عَلى مُحَمَّدٍ وَآلِهِ، وَأن تَغفِرَ لي ذَنبيَ العَظيمَ، إنَّهُ لا يَغفِرُ العَظيمَ إلاّ العَظيمُ. \nفإذا فرغت مِنَ النافلة فعقب بما شئتَ، وَتَقول عشراً: ما شاءَ الله لا قُوَّةَ إِلاّ بِالله اسْتَغْفِرُ الله. \nثمّ تقول: اللهُمَّ إنّي أسألُكَ موجِباتِ رَحمَتِكَ وَعَزائِمَ مَغفِرَتِكَ، وَالنَّجاةَ مِنَ النَّارِ وَمِن كُلِّ بَليَّةٍ، وَالفَوزَ بِالجَنَّةِ وَالرِّضوان في دارِ السَّلامِ وَجِوارِ نَبيِّكَ مُحَمَّدٍ عَلَيهِ وَآلِهِ السَّلامُ. اللهُمَّ ما بِنا مِن نِعمَةٍ فَمِنكَ لا إلهَ إلاّ أنتَ، أستَغفِرُكَ وَأتوبُ إلَيكَ. \nوَتُصلي الغفيلة بين المَغرب والعشاء وهي ركعتان تقرأ بَعدَ الحَمد في الأولى: وَذا النّونِ إذ ذَهَبَ مُغاضِباً فَظَنَّ أن لَن نَقدِرَ عَلَيهِ فَنادى في الظُّلُماتِ أن لا إلهَ إلاّ أنتَ سُبحانَكَ إنّي كُنتُ مِنَ الظَّالِمينَ فَاستَجَبنا لَهُ وَنَجَّيناهُ مِنَ الغَمِّ وَكَذلِكَ نُنجي المُؤمِنينَ. \nوفي الثانية: وَعِندَهُ مَفاتِحُ الغَيبِ لا يَعلَمُها إلاّ هُوَ وَيَعلَمُ ما في البَرِّ وَالبَحرِ وَما تَسقُطُ مِن وَرَقَةٍ إلاّ يَعلَمُها وَلا حَبَّةٍ في ظُلُماتِ الأرضِ وَلا رَطبٍ وَلا يابِسٍ إلاّ في كِتابٍ مُبينٍ. \nثمّ تأخذ يديك للقنوت وتقول: اللهُمَّ إنّي أسألُكَ بِمَفاتِحِ الغَيبِ الَّتي لا يَعلَمُها إلاّ أنتَ أن تُصَلّيَ عَلى مُحَمَّدٍ وَآلِهِ وَأن تَفعَلِ بي كَذا وَكَذا، وتذكر حاجتك عوض هذه الكلمة. \nثمّ تقول: اللهُمَّ أنتَ وَليُّ نِعمَتي وَالقادِرُ عَلى طَلِبَتي تَعلَمُ حاجَتي فَأسألُكَ بِحَقِّ مُحَمَّدٍ وَآلِهِ عَلَيهِ وَعَلَيْهمُ السَّلامُ لَمّا قَضَيتَها لي. وَتَسْأَل حاجتك، فقد روي أَن مَن أتى بهذه الصلاة وسأل الله حاجته اعطاهُ الله ما سَأل."
        },
        {
            "TitleA": "تعقيبات صلاه العشاء",
            "TitleE": "Comments for the evening prayer",
            "DscrpE": "O God, I have no knowledge of the location of my livelihood, but I seek it through the dangers that come to my heart, so I travel across countries seeking it, for while I am seeking it I am like a bewilderment. I do not know whether it is a plain, a mountain, or On earth, in the sky, or in On land or in the sea? And at whose hands, and by whom? And I have known that its knowledge is with You and its causes are in Your Hand, and You are the one who divides it with Your kindness and causes it with Your mercy. Oh God, bless Muhammad. God and his family, and make, O Lord, Your provision for me ample, my request easy, and my destination near, and do not bother me with any request. You have not decreed for me any sustenance therein, for You are free from my torment and I am in need of Your mercy. So bless Muhammad and his family and bless Your servant by Your grace. Indeed, You are of great bounty. I say: This is one of the supplications for sustenance, and it is also desirable. To recite after the evening meal Surah: Indeed, We sent it down seven times One hundred verses from the Qur’an should be recited during the pace, which is two rak’ahs, sitting after dinner, and it is desirable to replace the hundred verses with Surah: If the Incident Occurs in one rak’ah, and Surah: Say, He is God, One in the other rak’ah",
            "DscrpA": "اللهُمَّ إنَّهُ لَيسَ لي عِلمٌ بِمَوضِعِ رِزقي وَإنَّما أطلُبُهُ بِخَطَراتٍ تَخطُرُ عَلى قَلبي، فَأجولُ في طَلَبِهِ البُلدانَ، فَأنا فيما أنا طالِبٌ كَالحَيرانِ، لا أدري أفي سَهلٍ هوَ، أم في جَبَلٍ، أم في أرضٍ، أم في سَماءٍ، أم في بَرٍّ أم في بَحرٍ ؟ وَعَلى يَدَي مَن، وَمِن قِبَلِ مَن؟ وَقَد عَلِمتُ أنَّ عِلمَهُ عِندَكَ وَأسبابَهُ بيَدِكَ، وَأنتَ الَّذي تَقسِمُهُ بِلُطفِكَ، وَتُسَبِّبُهُ بِرَحمَتِكَ. اللهُمَّ فَصَلِّ عَلى مُحَمَّدٍ وَآلِهِ، وَاجعَل يا رَبِّ رِزقَكَ لي وَاسِعاً وَمَطلَبَهُ سَهلاً وَمَأخَذَهُ قَريباً، وَلا تُعَـنِّـني بِطَلَبِ ما لَم تُقَدِّر لي فيهِ رِزقاً، فَإنَّكَ غَنيُّ عَن عَذابي وَأنا فَقيرٌ إلى رَحمَتِكَ، فَصَلِّ عَلى مُحَمَّدٍ وَآلِهِ وَجُد عَلى عَبدِكَ بِفَضلِكَ، إنَّكَ ذو فَضلٍ عَظيمٍ. \nأقول: هذا مِن أدعية الرزق، وَيُستحب أيضاً أن يقرأ عقيب العشاء سورة: إنَّا أنزَلناهُ سَبع مَرات، وأن يقرأ في الوتيرة وهي ركعتان جالسا بَعدَ العشاء مائة آية من القرآن، وَيُستحب أن يُعتاض عَن المائة آية سورة:إذا وَقَعَتِ الواقِعَة في ركعة، وسورة: قُل هُوَ الله أحَد في الركعة الأخرى."
        }
    ]
}