{
    "SalaِtAnbiaa": [
        {
            "TitleA": "الصلاة على النبي صلى الله عليه وسلم",
            "TitleE": "Peace be upon the Prophet (PBUH)",
            "DscrpE": "O God, bless Muhammad as He carried Your revelation and conveyed Your messages, and bless Muhammad as He made lawful Your lawful, made unlawful Your unlawful, taught Your Book, and bestowed blessings upon Muhammad Just as he established prayer, paid zakat, called for your religion, and bless Muhammad as he fulfilled your promise, And I am afraid of Your threat, and bless Muhammad as You forgave him sins, covered his faults and relieved him of distress, and bless Muhammad as You averted misery through him, and You Through him you healed the grief, answered the prayers through him, saved him from calamity, and bestowed blessings upon Muhammad as you showed mercy to the servants and revived him through him. the country, and with it you divided the tyrants, and destroyed the Pharaohs with it, and bless Muhammad as you weakened the wealth through him, and averted terrors through him, and destroyed the lands through him. An idol, and with it You showed mercy to people, and bless Muhammad as You sent him with the best of religions, and with it you strengthened faith, and with it you vindicated idols, and with it you glorified the House. Sacred, and bless Muhammad and his pure and virtuous household and send your greetings of peace.",
            "DscrpA": "اَللّـهُمَّ صَلِّ عَلَى مُحَمَّدٍ كَمَا حَمَلَ وَحْيَكَ، وَبَلَّغَ رِسَالاتِكَ، وَصَلِّ عَلَى مُحَمَّدٍ كَمَا أَحَلَّ حَلالَكَ، وَحَرَّمَ حَرامَكَ، وَعَلَّمَ كِتابَكَ، وَصَلِّ عَلَى مُحَمَّدٍ كَمَا أَقامَ الصَّلَاةَ، وَآتَى الزَّكَاةَ، وَدَعا اِلى دينِكَ، وَصَلِّ عَلَى مُحَمَّدٍ كَمَا صَدَّقَ بِوَعْدِكَ، وَأَشْفَقَ مِنْ وَعيدِكَ، وَصَلِّ عَلَى مُحَمَّدٍ كَمَا غَفَرْتَ بِهِ الذُّنُوبَ، وَسَتَرْتَ بِهِ الْعُيُوبَ وَفَرَّجْتَ بِهِ الْكُرُوبَ، وَصَلِّ عَلَى مُحَمَّدٍ كَمَا دَفَعْتَ بِهِ الشَّقاءَ، وَكَشَفْتَ بِهِ الْغَمّاءَ، وَأَجَبْتَ بِهِ الدُّعاءَ، وَنَجَّيْتَ بِهِ مِنَ الْبَلاءِ، وَصَلِّ عَلَى مُحَمَّدٍ كَمَا رَحِمْتَ بِهِ الْعِبادَ، وَأَحْيَيْتَ بِهِ الْبِلادَ، وَقَصَمْتَ بِهِ الْجَبابِرَةَ، وَأَهْلَكْتَ بِهِ الْفَراعِنَةَ، وَصَلِّ عَلَى مُحَمَّدٍ كَمَا أَضْعَفْتَ بِهِ الأَمْوالَ، وَأَحْرَزْتَ بِهِ مِنَ الأَهْوالِ، وَكَسَرْتَ بِهِ الأَصْنامَ، وَرَحِمْتَ بِهِ الأَنامَ، وَصَلِّ عَلَى مُحَمَّدٍ كَما بَعَثْتَهُ بِخَيْرِ الأَدْيانِ، وَأَعْزَزْتَ بِهِ الإيْمانَ، وَتَبَّرْتَ بِهِ الأَوْثانَ، وَعَظَّمْتَ بِهِ الْبَيْتَ الْحَرامَ، وَصَلِّ عَلَى مُحَمَّدٍ وَأَهْلِ بَيْتِهِ الطّاهِرِينَ الأَخْيارِ وَسَلِّمْ تَسْليماً."
        },
        {
            "TitleA": "الصلاة على امير المؤمنين عليه السلام",
            "TitleE": "Peace be upon the Commander of the Faithful (peace be upon him)",
            "DscrpE": "O God, bless the Commander of the Faithful, Ali bin Abi Talib, the brother of your Prophet, his guardian, his guardian, his minister, the repository of his knowledge, the place of his secrets, and The father of His wisdom, the speaker of His proof, the one who calls for His law, His successor in his nation, the one who relieves distress from its face, the destroyer of infidelity, and the one who suppresses the immorality which You have made. Your Prophet is in the position of Aaron to Moses O God, befriend whoever supports him, antagonize whoever opposes him, support whoever supports him, abandon whoever abandons him, curse whoever aspires to him among the ancients and the last, and may the best of blessings be upon him. I wish upon one of the guardians of your prophets, O Lord of the worlds.",
            "DscrpA": "اَللّهُمَّ صَلِّ عَلَى أَمِيرِ المُؤْمِنِينَ عَلِيِّ بْنِ أَبِي طَالِبٍ أَخِي نَبِيِّكَ وَوَلِيِّهِ وَصَفِيِّهِ وَوَزِيرِهِ وَمُسْتَوْدَعِ عِلْمِهِ وَمَوْضِعِ سِرِّهِ وَبَابِ حِكْمَتِهِ وَالنَّاطِقِ بِحُجَّتِهِ وَالداعِي إِلى شَرِيعَتِهِ وَخَلِيفَتِهِ فِي أُمَّتِهِ وَمُفَرِّجَ الكَرْبِ عَنْ وَجْهِهِ، قاصِمِ الكَفَرَةِ وَمُرْغِمِ الفَجَرَةِ الَّذِي جَعَلْتَهُ مِنْ نَبِيِّكَ بِمَنْزِلَةِ هارُونَ مِنْ مُوسى، اللّهُمَّ وَالِ مَنْ وَالَاهُ وَعَادِ مَنْ عاداهُ وَانْصُرْ مَنْ نَصَرَهُ وَاخْذُلْ مَنْ خَذَلَهُ، وَالْعَنْ مَنْ نَصَبَ لَهُ مِنَ الأوَّلِينَ وَالآخِرِينَ، وَصَلِّ عَلَيْهِ أَفْضَلَ ما صَلَّيْتَ عَلى أَحَدٍ مِنْ أَوْصِياء أَنْبِيائِكَ يَا رَبَّ العالَمِينَ."
        },
        {
            "TitleA": "الصّلاة على سيّدة النّساء فاطمة عليها السلام",
            "TitleE": "Prayers be upon the Lady of Women Fatima (peace be upon her)",
            "DscrpE": "O God, bless the truthful Fatima, the pure beloved of your beloved and your prophet and the mother of your loved ones and pure ones whom you have chosen, favored and chosen.On the women of the worlds, O God, be the seeker for her from those who wronged her and belittled her rights, and be the rebel, O God, for the blood of her children, O God, and as You made her the mother of the Imams of guidance and the companion of the companion The banner and the noble woman are at Most High, bestow upon her and her mother a blessing that will honor the face of Muhammad, may God’s prayers and peace be upon him and his family, and please the eyes of her descendants, and convey to them about me at this hour. Greetings and peace be upon you.",
            "DscrpA": "اَللّهُمَّ صَلِّ عَلَى الصِّدِّيقَةِ فاطِمَةَ الزَّكِيَّةِ حَبِيبَةِ حَبِيبِكَ وَنَبِيِّكَ وَأُمِّ أَحِبَّائِكَ وَأَصْفِيائِكَ الَّتِي انْتَجَبْتَها وَفَضَّلْتَها وَاخْتَرْتَها عَلى نِسَاءِ العالَمِينَ، اللّهُمَّ كُنِ الطَّالِبَ لَها مِمَّنْ ظَلَمَها وَاسْتَخَفَّ بِحَقِّها وَكُنِ الثَّائِرَ اللّهُمَّ بِدَمِ أَوْلادِها، اللّهُمَّ وَكَما جَعَلْتَها أُمَّ أَئِمَّةِ الهُدى وَحَلِيلَةَ صاحِبِ اللِّواءِ وَالكَرِيمَةَ عِنْدَ المَلاء الأعْلى، فَصَلِّ عَلَيْها وَعَلى أُمِّها صَلاةً تُكْرِمُ بِها وَجْهَ مُحَمَّدٍ صَلى الله عَلَيْهِ وَآلِهِ وَتُقِرُّ بِها أَعْيُنَ ذُرِّيَّتِها، وَأبْلِغْهُمْ عَنِّي فِي هذِهِ السَّاعَةِ أَفْضَلَ التَّحِيَّةِ وَالسَّلامِ."
        },
        {
            "TitleA": "الصّلاة على الحسن والحسين عليه السلام",
            "TitleE": "Peace be upon Al-Hassan and Al-Hussein (peace be upon him)",
            "DscrpE": "O God, bless Al-Hasan and Al-Hussein, Your servants, Your guardian, the two sons of Your Messenger, the two grandsons of mercy, and the masters of the youth of the people of Paradise, the best of all that You have bestowed upon One of the children of the prophets and messengers. O God, bless Al-Hasan, son of the Master of the Prophets and the guardian of the Commander of the Faithful. Peace be upon you, son of the Messenger of God. Peace be upon you, son of Master of the Guardians, I bear witness that you, O son of the Commander of the Faithful, are God’s trustworthy and the son of His trustworthy person. You lived as an oppressed person and died as a martyr, and I bear witness that you are the pure, guiding, and caring Imam. My friend, O God, bless him and convey his soul and body to me at this hour, the best greetings and peace, O God, bless Al-Hussein bin Ali, the oppressed, the martyr who was killed by you. Furah and Tareh The Fajrah. Peace be upon you, O Abu Abdullah. Peace be upon you, son of the Messenger of God. Peace be upon you, son of the Commander of the Faithful. I bear witness with certainty that you are the Trustee of God and the son of His Trustee. You were killed. You were wronged and died as a martyr, and I bear witness that God Almighty seeks your revenge and fulfills what He promised you of victory and support in the destruction of your enemy and the manifestation of your call. And I bear witness that you fulfilled your covenant with God and strove in the path of God and worshiped God sincerely until certainty came to you. \nMay God curse a nation that killed you, and God cursed a nation that failed you, and God cursed a nation that rebelled against you, and I disavow before God Almighty those who lied to you, belittled your rights, and made your blood lawful, b. You are my father and my mother, O Abu Abdullah. May God curse your killer, may God curse your betrayer, and may God curse whoever heard your plea but did not answer you and did not support you. May God curse you. Who took your wives captive? To God I am innocent of them and of those who supported them and supported them and helped them against it, and I bear witness that you and the Imams from your progeny are the word of piety and the door of guidance and the right handhold. I have confidence and the argument is against the people of the world, and I bear witness that I am a believer in you, and I am certain of your status, and to you I follow myself, the laws of my religion, the conclusions of my deeds, and my turning point in My world and my hereafter.",
            "DscrpA": "اَللّهُمَّ صَلِّ عَلَى الحَسَنِ وَالحُسَيْنِ عَبْدَيْكَ وَوَلِيَّيْكَ وَابْنَيْ رَسُولِكَ وَسِبْطَي الرَّحْمَةِ وَسَيِّدَي شَبابِ أَهْلِ الجَنَّةِ أَفْضَلَ مَا صَلَّيْتَ عَلى أَحَدٍ مِنْ أَوْلادِ النَّبِيِّينَ وَالمُرْسَلِينَ، اللّهُمَّ صَلِّ عَلَى الحَسَنِ بْنِ سَيِّدِ النَّبِيِّينَ وَوَصِيِّ أَمِيرِ المُؤْمِنِينَ، السَّلامُ عَلَيْكَ يابْنَ رَسُولِ اللهِ، السَّلامُ عَلَيْكَ يابْنَ سَيِّدِ الوَصِيِّيَنَ، أَشْهَدُ أَنَّكَ يابْنَ أَمِيرِ المُؤْمِنِينَ أَمِينُ اللهِ وَابْنُ أَمِينِهِ، عِشْتَ مَظْلُوماً وَمَضْيَت شَهِيداً، وَأَشْهَدُ أَنَّكَ الإمَامُ الزَّكِيُّ الهادِيُ المَهْدِيُّ، اللّهُمَّ صَلِّ عَلَيْهِ وَبَلِّغْ رُوحَهُ وَجَسَدَهُ عَنِّي فِي هذِهِ السَّاعَةِ أَفْضَلَ التَّحِيَّةِ وَالسَّلامِ، اللّهُمَّ صَلِّ عَلَى الحُسَيْنِ بْنِ عَلِيٍّ المَظْلُومِ الشَّهِيدِ قَتِيلِ الكَفَرَةِ وَطَرِيحِ الفَجَرَةِ، السَّلامُ عَلَيْكَ يا أَبا عَبْدِاللهِ، السَّلامُ عَلَيْكَ يابْنَ رَسُولِ اللهِ، السَّلامُ عَلَيْكَ يابْنَ أَمِيرِ المُؤْمِنِينَ، أَشْهَدُ مُوقِناً أَنَّكَ أَمِينُ اللهِ وَابْنُ أَمِينِهِ، قُتِلْتَ مَظْلُوماً وَمَضْيَت شَهِيداً، وَأَشْهَدُ أَنَّ اللهَ تَعالى الطَّالِبُ بِثأرِكَ وَمُنْجِزٌ ما وَعَدَكَ مِنَ النَّصْرِ وَالتَّأْيِيدِ فِي هَلاكِ عَدُوِّكَ وَإِظْهارِ دَعْوَتِكَ، وَأَشْهَدُ أَنَّكَ وَفَيْتَ بِعَهْدِ اللهِ وَجاهَدْتَ فِي سَبِيلِ اللهِ وَعَبَدْتَ اللهَ مُخْلِصاً حَتى أَتاكَ اليَّقِينُ. \nلَعَنَ اللهُ أُمَّةً قَتَلَتْكَ وَلَعَنَ اللهُ أُمَّةً خَذَلَتْكَ وَلَعَنَ اللهُ أُمَّةً أَلَّبَتْ عَلَيْكَ، وَأَبْرأُ إِلى اللهِ تَعالى مِمَّنْ أَكْذَبَكَ وَاسْتَخَفَّ بِحَقِّكَ وَاسْتَحَلَّ دَمَكَ، بِأَبِي أَنْتَ وَأُمِّي يا أَبا عَبْدِاللهِ لَعَنَ اللهُ قاتِلَكَ وَلَعَنَ اللهُ خاذِلَكَ وَلَعَنَ اللهُ مَنْ سَمِعَ واعِيَتَكَ فَلَمْ يُجِبْكَ وَلَمْ يَنْصُرْكَ وَلَعَنَ اللهُ مَنْ سَبَى نِساءَكَ؛ أَنَاْ إِلَى اللهِ مِنْهُمْ بَرِيءٌ وَمِمَّنْ وَالَاهُمْ وَمالَاَهُمْ وَأَعانَهُمْ عَلَيْهِ، وَأَشْهَدُ أَنَّكَ وَالأَئِمَّةَ مِنْ وُلْدِكَ كَلِمَةُ التَّقْوى وَبابُ الهُدى وَالعُرْوَةُ الوُثْقى وَالحُجَّةُ عَلَى أَهْلِ الدُّنْيا، وَأَشْهَدُ أَنِّي بِكُمْ مُؤْمِنٌ وَبِمَنْزِلَتِكُمْ مُوقِنٌ وَلَكُمْ تابِعٌ بِذاتِ نَفْسِي وَشَرائِعِ دِينِي وَخَواتِيمِ عَمَلِي وَمُنْقَلَبِي فِي دُنْيايَ وَآخِرَتِي."
        },
        {
            "TitleA": "الصّلاة على عليّ بن الحسين عليه السلام",
            "TitleE": "Peace be upon Ali bin Al-Hussein (peace be upon him)",
            "DscrpE": "O God, bless Ali bin Al-Hussein, the Master of the worshipers, whom You have extracted for Yourself and made from him the Imams of guidance who guide with the truth and do justice by it. You chose him for Yourself and purified him of impurity and chose him and made him a guide and guide. O God, bestow upon him the best of what You have bestowed upon any of the offspring of the Prophet. Come on until you reach it Whatever pleases his eye in this world and the hereafter. Indeed, You are Mighty, Wise.",
            "DscrpA": "اَللّهُمَّ صَلِّ عَلى عَلِيِّ بْنِ الحُسَيْنِ سَيِّدِ العابِدِينَ الَّذِي اسْتَخْلَصْتَهُ لِنَفْسِكَ وَجَعَلْتَ مِنْهُ أَئِمَّةَ الهُدى الَّذِينَ يَهْدُونَ بِالحَقِّ وَبِهِ يَعْدِلُونَ، اِخْتَرْتَهُ لِنَفْسِكَ وَطَهَّرْتَهُ مِنَ الرِّجْسِ وَاصْطَفَيْتَهُ وَجَعَلْتَهُ هادِياً مَهْدِيّاً، اللّهُمَّ فَصَلِّ عَلَيْهِ أَفْضَلَ ما صَلَّيْتَ عَلى أَحَدٍ مِنْ ذُرِّيَّةِ أَنْبِيائِكَ حَتى تَبْلُغَ بِهِ ما تَقِرُّ بِهِ عَيْنُهُ فِي الدُّنْيا وَالآخِرةِ إِنَّكَ عَزِيزٌ حَكِيمٌ."
        },
        {
            "TitleA": "الصّلاة على محمّد بن عليّ عليه السلام",
            "TitleE": "Peace be upon Muhammad bin Ali (peace be upon him)",
            "DscrpE": "O God, bless Muhammad bin Ali, the bearer of knowledge, the imam of guidance, the leader of the people of piety, and the chosen one from among your servants, O God, as you made him a flag for your servants and A fire for your country, a repository of your wisdom, and an interpreter of your revelation. You commanded obedience to him and warned against disobeying him. So bless him, O Lord, the best you have ever blessed him. One of the descendants of Your prophets, Your pure ones, Your messengers, and Your trustworthy ones, O Lord of the Worlds.",
            "DscrpA": "اَللّهُمَّ صَلِّ عَلَى مُحَمَّدٍ بْنِ عَلِيٍّ باقِرِ العِلْمِ وَإِمامِ الهُدى، وَقائِدِ أَهْلِ التَّقْوى وَالمُنْتَجَبِ مِنْ عِبادِكَ، اللّهُمَّ وَكَمَا جَعَلْتَهُ عَلَمَاً لِعِبادِكَ وَمَناراً لِبِلادِكَ، وَمُسْتَوْدَعاً لِحِكْمَتِكَ وَمُتَرْجِمَاً لِوَحْيِكَ، وَأَمَرْتَ بِطاعَتِهِ وَحَذَّرْتَ مِنْ مَعْصِيَتِهِ، فَصَلِّ عَلَيْهِ يا رَبِّ أَفْضَلَ ما صَلَّيْتَ عَلَى أَحَدٍ مِنْ ذُرِّيَّةِ أَنْبِيائِكَ وأَصْفِيائِكَ، وَرُسُلِكَ وَأُمَنائِكَ يا رَبَّ العالَمِينَ."
        },
        {
            "TitleA": "الصّلاة على جعفر بن محمّد عليه السلام",
            "TitleE": "Peace be upon Jaafar bin Muhammad (peace be upon him)",
            "DscrpE": "O God, bless Ja`far ibn Muhammad al-Sadiq, the treasurer of knowledge, the one who calls to you in truth, the clear light. Oh God, as you have made him the source of your words and your revelation, and the treasurer of You are the master of your monotheism, your guardian and the guardian of your religion, so bestow upon him the best that you have ever bestowed upon any of your pure ones and your proofs. Indeed, you are Praiseworthy and Glorious.",
            "DscrpA": "اَللّهُمَّ صَلِّ عَلَى جَعْفَرِ بْنِ مُحَمَّدٍ الصَّادِقِ خازِنِ العِلْمِ، الدَّاعي إِلَيْكَ بِالحَقِّ النُّورِ المُبِينِ، اللّهُمَّ وَكَما جَعَلْتَهُ مَعْدِنَ كَلامِكَ وَوَحْيِكَ، وَخازِنَ عِلْمِكَ وَلِسانَ تَوْحِيدِكَ، وَوَلِيَّ أَمْرِكَ وَمُسْتَحْفِظَ دِينِكَ، فَصَلِّ عَلَيْهِ أَفْضَلَ ما صَلَّيْتَ عَلى أَحَدٍ مِنْ أَصْفِيائِكَ وَحُجَجِكَ، إِنَّكَ حَمِيدٌ مَجِيدٌ."
        },
        {
            "TitleA": "الصّلاة على موسى بن جعفر عليه السلام",
            "TitleE": "Prayers be upon Musa bin Jaafar (peace be upon him)",
            "DscrpE": "O God, bless the trustworthy and trustworthy Musa bin Jafar, the righteous, loyal, pure, and pure, the clear light, the diligent one who is expected, the one who is patient in the face of harm in you, O God, as he has reached On the authority of his forefathers, he was entrusted with your commands and prohibitions, and he was burdened with proof and suffered hardship among the people of honor while he was faced with Of the ignorant people of his people, my Lord, bestow upon him the best and most perfect blessings that You have bestowed upon any one of those who obeyed You and were sincere to Your servants. Indeed, You are Forgiving and Merciful.",
            "DscrpA": "اَللّهُمَّ صَلِّ عَلَى الأَمِينِ المُؤْتَمَنِ مُوسى بْنِ جَعْفَرٍ، البَرِّ الوَفِيِّ الطَّاهِرِ الزَّكِيّ، النُورِ المُبِينِ المُجْتَهِدِ المُحْتَسِبِ، الصَّابِرِ عَلى الأَذى فِيكَ، اللّهُمَّ وَكَمَا بَلَّغَ عَنْ آبائِهِ ما اسْتُودِعَ مِنْ أَمْرِكَ وَنَهْيِكَ، وَحَمَلَ عَلَى المَحَجَّةِ وَكابَدَ أَهْلَ العِزَّةِ وَالشِّدَّةِ فِيما كانَ يَلْقى مِنْ جُهَّالِ قَوْمِهِ، رَبِّ فَصَلِّ عَلَيْهِ أَفْضَلَ وَأَكْمَلَ ما صَلَّيْتَ عَلى أَحَدٍ مِمَّنْ أَطاعَكَ وَنَصَحَ لِعِبادِكَ، إِنَّكَ غَفُورٌ رَحِيمٌ."
        },
        {
            "TitleA": "الصّلاة على عليّ بن موسى عليه السلام",
            "TitleE": "Peace be upon Ali bin Musa (peace be upon him)",
            "DscrpE": "O God, bless Ali ibn Musa, whom You have been pleased with, and with whom You have been pleased with whomsoever You wish of Your creation, O God, as You have made him a proof over Your creation, and upholding Your command. And a supporter of your religion and a witness to your servants, and as he advised them in secret and in public and called to your path with wisdom and beautiful exhortation, so bless him. The best thing you have ever blessed one of your friends and the best of your creation. Indeed, you are generous and generous.",
            "DscrpA": "اَللّهُمَّ صَلِّ عَلَى عَلِيِّ بْنِ مُوسى الَّذِي ارْتَضَيْتَهُ وَرَضَّيْتَ بِهِ مَنْ شِئْتَ مِنْ خَلْقِكَ، اللّهُمَّ وَكَمَا جَعَلْتَهُ حُجَّةً عَلَى خَلْقِكَ، وَقائِماً بِأَمْرِكَ وَناصِراً لِدِينِكَ وَشاهِداً عَلى عِبادِكَ، وَكَما نَصَحَ لَهُمْ فِي السِّرِّ وَالعَلانِيَةِ وَدَعا إِلى سَبِيلِكَ بِالحِكْمَةِ وَالمَوْعِظَةِ الحَسَنَةِ، فَصَلِّ عَلَيْهِ أَفْضَلَ ما صَلَّيْتَ عَلَى أَحَدٍ مِنْ أَوْلِيائِكَ وَخِيَرَتِكَ مِنْ خَلْقِكَ، إِنَّكَ جَوادٌ كَرِيمٌ."
        },
        {
            "TitleA": "الصّلاة على محمّد بن عليّ بن موسى عليه السلام",
            "TitleE": "Peace be upon Muhammad bin Ali bin Musa (peace be upon him)",
            "DscrpE": "O God, bless Muhammad ibn Ali ibn Musa, the knowledge of piety, the light of guidance, the source of loyalty, the branch of the pious, the successor of the guardians, and the trustee of Your revelation, Oh God, just as You have guided by it from misguidance and saved by it from confusion, and by it You have guided whoever is guided by it and purified by it whoever is pure, so pray “On him is the best thing I have ever prayed for any of your guardians and the rest of your successors. Indeed, You are Mighty, Wise.",
            "DscrpA": "اَللّهُمَّ صَلِّ عَلَى مُحَمَّدِ بْنِ عَلِيِّ بْنِ مُوسى عَلَمِ التُّقى وَنُورِ الهُدَى، وَمَعْدِنِ الوَفاءِ وَفَرْعِ الأَزْكِياءِ، وَخَلِيفَةِ الأَوْصِياءِ وَأَمِينِكَ عَلَى وَحْيِكَ، اللّهُمَّ فَكَمَا هَدَيْتَ بِهِ مِنَ الضَّلالَةِ وَاسْتَنْقَذْتَ بِهِ مِنَ الحَيْرَةِ، وَأَرْشَدْتَ بِهِ مَنِ اهْتَدَى وَزَكَّيْتَ بِهِ مَنْ تَزَكّى، فَصَلِّ عَلَيْهِ أَفْضَلَ مَا صَلَّيْتَ عَلَى أَحَدٍ مِنْ أَوْلِيائِكَ وَبَقِيَّةِ أَوْصِيائِكَ، إِنَّكَ عَزِيزٌ حَكِيمٌ."
        },
        {
            "TitleA": "الصّلاة على عليّ بن محمّد عليه السلام",
            "TitleE": "Peace be upon Ali bin Muhammad (peace be upon him)",
            "DscrpE": "O God, bless Ali bin Muhammad, the guardian of the guardians, the imam of the pious, the successor to the imams of the religion, and the proof for all of creation. O God, as you made him a light... Through it you will illuminate the believers, so he was given good tidings of your great reward, he warned of your painful punishment, he warned of your punishment, he was reminded of your verses, and he made lawful what is permissible for you and forbids what is forbidden, and explains your laws and duties and encourages your worship, and enjoins obedience to you and forbids disobedience to you, so bestow upon him the best of what you have bestowed upon him. Of Your saints and the descendants of Your prophets, O God of the worlds.",
            "DscrpA": "اَللّهُمَّ صَلِّ عَلَى عَلِيِّ بْنِ مُحَمَّدٍ وَصِيِّ الأَوْصِياء، وَإِمامِ الأَتْقِياءِ، وَخَلَفِ أَئِمَّةِ الدِّينِ، وَالحُجَّةِ عَلى الخَلائِقِ أَجْمَعِينَ، اللّهُمَّ كَمَا جَعَلْتَهُ نُوراً يَسْتَضِيءُ بِهِ المُؤْمِنُونَ، فَبَشَّرَ بِالجَزِيلِ مِنْ ثَوابكَ، وَأَنْذَرَ بِالأَلِيمِ مِنْ عِقابِكَ، وَحَذَّرَ بَأسَكَ وَذَكَّرَ بآياتِكَ، وَأَحَلَّ حَلالَكَ وَحَرَّمَ حَرامَكَ، وَبَيَّنَ شَرائِعَكَ وَفَرائِضَكَ وَحَضَّ عَلَى عِبادَتِكَ، وَأَمَرَ بِطاعَتِكَ وَنَهى عَنْ مَعْصِيَتِكَ، فَصَلِّ عَلَيْهِ أَفْضَلَ مَا صَلَّيْتَ عَلَى أَحَدٍ مِنْ أَوْلِيائِكَ وَذُرِّيَّةِ أَنْبِيائِكَ، يا إِلهَ العالَمِينَ."
        },
        {
            "TitleA": "الصّلاة على الحسن بن عليّ بن محمّد عليه السلام",
            "TitleE": "Peace be upon Al-Hassan bin Ali bin Muhammad (peace be upon him)",
            "DscrpE": "O God, bless Al-Hasan bin Ali bin Muhammad, the righteous and pious, the truthful and loyal, the shining light, the treasurer of your knowledge and the reminder of your monotheism, and your guardian and successor to the Imams. The religion is the rightly guided, and the proof for the people of the world, so bless him, O Lord, the best you have ever blessed any of your pure ones. And your proofs and the children of your messengers, O God of the worlds.",
            "DscrpA": "َاللّهُمَّ صَلِّ عَلَى الحَسَنِ بْنِ عَلِيِّ بْنِ مُحَمَّدٍ البَرِّ التَّقِيِّ، الصَّادِقِ الوَفِيِّ النُورِ المُضِيءِ، خازِنِ عِلْمِكَ وَالمُذَكِّرِ بِتَوْحِيدِكَ، وَوَلِيِّ أمْرِكَ وَخَلَفِ أئِمَّةِ الدِّينِ الهُداةِ الرَّاشِدِينَ، وَالحُجَّةِ عَلَى أهْلِ الدُّنْيا، فَصَلِّ عَلَيْهِ يا رَبِّ أَفْضَلَ مَا صَلَّيْتَ عَلَى أَحَدٍ مِنْ أَصْفِيائِكَ وَحُجَجِكَ وَأَوْلادِ رُسُلِكَ، يا إِلهَ العالَمِينَ."
        },
        {
            "TitleA": "الصّلاة على وليّ الامر المنتظر عليه السلام",
            "TitleE": "Prayers be upon the Awaited Guardian (peace be upon him)",
            "DscrpE": "O God, bless your guardian and the son of your friends, whose obedience you have made obligatory, and whose rights you have imposed, and which you have removed from them impurity, and who you have purified with a perfect purification. O, O God, support him and support through him your religion, and support through him your friends, his guardians, his followers, and his supporters, and make us among them. O God, protect him from the evil of every transgressor. And a tyrant and from the evil of all of Your creation, And guard it in front of it and behind it and on its right and on its left. Guard it and prevent it from being brought to it by harm, and protect in it Your Messenger and the family of Your Messenger. Show justice through it and support it with victory, support those who help it and abandon those who abandon it, and crush with it the giants of disbelief and kill with it the infidels, the hypocrites, and all the atheists. Yin, where they were from the east The earth and its wests, its land and its sea, and fill the earth with justice, and demonstrate with it the religion of your Prophet, peace be upon him and his family, and make me, O God, among his supporters and helpers. And his followers and his Shiites, and show me in the family of Muhammad what they hope for, and in their enemy what they fear, the God of Truth, Amen.",
            "DscrpA": "اَللّهُمَّ صَلِّ عَلَى وَلِيِّكَ وَابْنِ أَوْلِيائِكَ الَّذِينَ فَرَضْتَ طاعَتَهُمْ، وَأَوْجَبْتَ حَقَّهُمْ وَأَذْهَبْتَ عَنْهُمْ الرِّجْسَ وَطَهَّرْتَهُمْ تَطْهِيراً، اللّهُمَّ انْصُرْهُ وَانْتَصِرْ بِهِ لِدِينِكَ، وَانْصُرْ بِهِ أَوْلِياءَكَ وَأَوْلِياءَهُ وَشِيعَتَهُ وَأَنْصارَهُ وَاجْعَلْنا مِنْهُمْ، اللّهُمَّ أَعِذْهُ مِنْ شَرِّ كُلِّ باغٍ وَطاغٍ وَمِنْ شَرِّ جَمِيعِ خَلْقِكَ، وَاحْفَظْهُ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ وَعَنْ يَمِينِهِ وَعَنْ شِمالِهِ، وَاحْرُسْهُ وَامْنَعْهُ أَنْ يُوصَلَ إِلَيْهِ بِسُوءٍ، وَاحْفَظْ فِيهِ رَسُولَكَ وَآلَ رَسُولِكَ، وَأَظْهِرْ بِهِ العَدْلَ وَأَيِّدْهُ بِالنَّصْرِ، وَانْصُرْ ناصِرِيهِ وَاخْذُلْ خاذِلِيهِ، وَاقْصِمْ بِهِ جَبابِرَةَ الكُفْرِ وَاقْتُلْ بِهِ الكُفَّارَ وَالمُنافِقِينَ وَجَمِيعَ المُلْحِدِينَ، حَيْثُ كانُوا مِنْ مَشارِقِ الأَرْضِ وَمَغارِبِها وَبَرِّها وَبَحْرِها، وَامْلَأْ بِهِ الأَرْضَ عَدْلاً، وَأَظْهِرْ بِهِ دِينَ نَبِيِّكَ عَلَيْهِ وَآلِهِ السَّلامُ، وَاجْعَلْنِي اللّهُمَّ مِنْ أَنْصارِهِ وَأَعْوانِهِ وَأَتْباعِهِ وَشِيعَتِهِ، وَأَرِنِي فِي آلِ مُحَمَّدٍ ما يَأْمَلُونَ، وَفِي عَدُوِّهِمْ ما يَحْذَرُونَ، إِلهَ الحَقِّ آمِينَ."
        }
    ]
}