{
    "Days": [
        {
            "TitleA": "زيارة يَوْمُ السّبتِ",
            "TitleE": "Visit on Saturday",
            "DscrpE": "The visit of the Prophet (may God’s prayers and peace be upon him and his family) I bear witness that there is no god but Allah alone, with no partner, and I bear witness that you are His Messenger and that you are Muhammad bin Abdullah, and I bear witness that How you have conveyed the messages of your Lord, advised your nation, and striven in the way of God with wisdom and beautiful exhortation, and fulfilled what was due to you. It is true that you were kind to the believers and were harsh with the disbelievers and worshiped God sincerely until certainty came to you, and through you God reached the most honorable position of the honored ones. Praise be to God who We have been saved by You from polytheism and misguidance. O God, bless Muhammad and his family and make Your prayers and the prayers of Your close angels, Your sent prophets, and Your righteous servants And the inhabitants of the heavens and the earths and whoever glorifies You, O Lord of the worlds, from the first and the last, upon Muhammad, Your servant, Your Messenger, Your Prophet, Your trustworthy, Your Answerer, Your beloved, Your purest, Your chosen one, Your chosen one, and Your sincere one. I have chosen you from among your creation, and bestowed upon him grace, virtue, means, and high rank, and raised him to a praiseworthy position in which the first and the last, God will envy him. They are that you said, “And if they had wronged themselves, they had come to you and asked forgiveness of God, and the Messenger had asked forgiveness for them, they would have found God.” Accepting and merciful, my God, I have come to your Prophet seeking forgiveness, repenting of my sins. Bless Muhammad and his family and forgive them for me. O our master, I turn to you and your household. To God Almighty, your Lord and my Lord, so that He may forgive me. Then say three times: To God we belong and to Him we shall return. Then say: We have afflicted you, O beloved of our hearts, for how great is it. What is afflicting you, where revelation has been cut off from us and where we have lost you? To Allah we belong, and to Him we shall return, O our master, O Messenger of God, may God’s prayers be upon you and your pure family. This is the day of the Sabbath. And it is your day and I am your guest and your neighbor, so host me and reward me, for you are generous and love hospitality and are commanded to provide rent, so host me and provide me with good hospitality and reward us. Our good reward is in the status of God With you and with your family, and in their position with him, and with the knowledge he has entrusted to you, he is the most generous of all. The author of the book, Abbas Al-Qumi, who has been pardoned, says: Whenever I visited him (may God’s prayers and peace be upon him and his family) with this visit, I began by visiting him in the manner that Imam Al-Rida (peace be upon him) Al-Bazanti taught, and then I read about this visit. It has been narrated with an authentic chain of transmission that Ibn Abi Baseer asked Al-Rida (peace be upon him) Peace be upon you. How can the Prophet (may God’s prayers and peace be upon him and his family) be prayed and greeted after the prayer? He (peace be upon him) replied by saying: Peace be upon you, O Messenger of God, and God’s mercy and blessings. Peace be upon you, O Muhammad bin Abdullah. Peace be upon you, O best one. May God’s peace be upon you, beloved of God’s peace May peace be upon you, O Amen of God. I bear witness that you are the Messenger of God, and I bear witness that you are Muhammad bin Abdullah, and I bear witness that you have advised your nation and striven. You followed the path of your Lord and worshiped Him until certainty came to you, so God rewarded you, O Messenger of God, the best of what He rewarded a prophet on behalf of his nation. O God, bless Muhammad and the family of Muhammad the best. You did not bless Abraham and the family of Abraham. You are Praiseworthy and Glorious.",
            "DscrpA": "زيارةِ النّبيِّ (صلى الله عليه وآله وسلم) اَشْهَدُ اَنْ لا اِلـهَ إلاّ اللهُ وَحْدَهُ لا شَريكَ لَهُ وَاَشْهَدُ اَنَّكَ رَسُولُهُ وَاَنَّكَ مُحَمَّدُ بْنُ عَبْدِ اللهِ وَاَشْهَدُ اَنَّكَ قَدْ بَلَّغْتَ رِسالاتِ رَبِّكَ وَنَصَحْتَ لاُِمَّتِكَ وَجاهَدْتَ فى سَبيلِ اللهِ بِالْحِكْمَةِ وَالمَوْعِظَةِ الْحَسَنَةِ وَاَدَّيْتَ الَّذى عَلَيْكَ مِنَ الْحَقِّ وَاَنَّكَ قَدْ رَؤُفْتَ بِالْمُؤْمِنينَ وَغَلَظْتَ عَلَى الْكافِرينَ وَعَبَدْتَ اللهَ مُخْلِصاً حَتّى أتاكَ اليَقينُ فَبَلَغَ اللهُ بِكَ اشَرَفَ مَحَلِّ الْمُكَرَّمينَ اَلْحَمْدُ للهِِ الَّذِي اسْتَنْقَذَنا بِكَ مِنَ الشِّرْكِ وَالضَّلالِ اَللّـهُمَّ صَلِّ عَلى مُحَمَّد وَآلِهِ وَاجْعَلْ صَلَواتِكَ وَصَلَواتِ مَلائِكَتِكَ الْمُقَرَّبينَ وَاَنْبِيائِكَ الْمـُرْسَلينَ وَعِبادِكَ الصّالِحينَ وَاَهْلِ السَّماواتِ وَالاَْرَضينَ وَمَنْ سَبَّحَ لَكَ يا رَبَّ الْعالَمينَ مِنَ الاَْوَّلينَ وَالاخِرينَ عَلى مُحَمَّد عَبْدِكَ وَرَسُوِلِكَ وَنَبِيِّكَ وَاَمينِكَ وَنَجِيبِكَ وَحَبيبِكَ وَصَفِيِّكَ وَ صَفْوَتِكَ وَخاصَّتِكَ وَخالِصَتِكَ وَخِيَرَتِكَ مِنْ خَلْقِكَ وَاَعْطِهِ الْفَضْلَ وَالْفَضيلَةَ وَالْوَسيلَةَ وَالدَّرَجَةَ الرَّفيعَةَ وَابْعَثْهُ مَقاماً مَحَمْوُداً يَغْبِطُهُ بِهِ الاَْوَّلُونَ وَالاخِرُونَ اَللّـهُمَّ اِنَّكَ قُلْتَ وَلَوْ اَنَّهُمْ اِذْ ظَلَمُوا اَنْفُسَهُمْ جاؤوكَ فَاسْتَغْفَرُوا اللهَ وَاسْتَغْفَرَ لَهُمُ الرَّسُولُ لَوَجَدُوا اللهَ تَوّاباً رَحيماً اِلـهى فَقَدْ اَتَيْتُ نَبِيَّكَ مُسْتَغْفِراً تائِباً مِنْ ذُنُوبى فَصَلِّ عَلى مُحَمَّد وَآلِهِ وَ اْغِفْرها لي، يا سَيِّدَنا اَتَوَجَّهُ بِكَ وَبِاَهْلِ بَيْتِكَ اِلَى اللهِ تَعالى رَبِّكَ وَرَبّى لِيَغْفِرَ لى ثمّ قل ثلاثاً : اِنّا للهِِ وَاِنّا اِلَيْهِ راجِعُونَ ثمّ قل : اُصِبْنا بِكَ يا حَبيبَ قُلُوبِنا فَما اَعْظَمَ الْمُصيبَةَ بِكَ حيَْثُ انْقَطَعَ عَنّا الْوَحْيُ وَحَيْثُ فَقَدْناكَ فَاِنّا للهِِ وَاِنّا اِلَيْهِ راجِعُونَ يا سَيِّدَنا يا رَسُولَ اللهِ صَلَواتُ اللهِ عَلَيْكَ وَعَلى آلِ بَيْتِكَ الطّاهِرينَ هذا يَوْمُ السَّبْتِ وَهُوَ يَوْمُكَ وَاَنَا فيهِ ضَيْفُكَ وَجارُكَ فَاَضِفْنى وَاجِرْنى فَاِنَّكَ كَريمٌ تُحِبُّ الضِّيافَةَ وَمَأْمُورٌ بِالاِْجارَةِ فَاَضِفْني وَأحْسِنْ ضِيافَتى وَاَجِرْنا وَاَحْسِنْ اِجارَتَنا بِمَنْزِلَةِ اللهِ عِنْدَكَ وَعِنْدَ آلِ بَيْتِكَ وَبِمَنْزِلَتِهِمْ عِنْدَهُ وَبِما اسْتَوْدَعَكُمْ مِنْ عِلْمِهِ فَاِنَّهُ اَكْرَمُ الاَْكْرَمينَ . يقول مؤلّف الكتاب عبّاس القُمّي عُفى عَنْه: انّي كلّما زرته (صلى الله عليه وآله وسلم)بهذه الزّيارة بَدَأت بزيارته عَلى نحو ما علّمه الامام الرّضا (عليه السلام)البزنطي ثمّ قرأت هذِهِ الزّيارة، فَقَدْ رُوي بسند صحيح إنّ ابن أبي بصير سأل الرّضا (عليه السلام)كيف يُصلّى على النبيّ (صلى الله عليه وآله وسلم) ويسلّم عليه بَعد الصلاة فأجابَ (عليه السلام) بقوله : اَلسَّلامُ عَلَيْكَ يا رَسُولَ اللهِ وَرَحْمةُ اللهِ وَبَرَكاتُهُ اَلسَّلامُ عَلَيْكَ يا مُحَمَّدُ بْنَ عَبْدِ اللهِ اَلسَّلامُ عَلَيْكَ يا خِيَرَةَ اللهِ اَلسَّلامُ عَلَيْكَ يا حَبيبَ اللهِ اَلسَّلامُ عَلَيْكَ يا صِفْوَهَ اللهِ اَلسَّلامُ عَلَيْكَ يا اَمينَ اللهِ اَشْهَدُ اَنَّكَ رَسُولُ اللهِ وَاَشْهَدُ اَنَّكَ مُحمَّدُ بْنُ عَبْدِ اللهِ وَاَشْهَدُ اَنَّكَ قَدْ نَصَحْتَ لاُِمَّتِكَ وَجاهَدْتَ فى سَبيلِ رَبِّكِ وَعَبَدْتَهُ حَتّى أتاكَ الْيَقينُ فَجَزاكَ اللهُ يا رَسُولَ اللهِ اَفْضَلَ ما جَزى نَبِيّاً عَنْ اُمَّتِهِ اَللّـهُمَّ صَلِّ عَلى مَحَمِّد وآلِ مُحَمِّد اَفْضَلَ ما صَلَّيْتَ عَلى اِبْرهِيمَ وَآلِ إبراهيمَ اِنَّكَ حَميدٌ مَجيدٌ ."
        },
        {
            "TitleA": "زيارة يَوْمُ الاحد",
            "TitleE": "visit on Sunday",
            "DscrpE": "The visit of the Commander of the Faithful (peace be upon him) according to the narration of one who witnessed the companion of the time (peace be upon him) visiting him while awake and not in sleep on Sunday, which was his day: Peace be upon the prophetic tree and the luminous and fruitful Hashemite tree With the prophecy that brings the imamate and upon Your sleepers, Adam and Noah, peace be upon them. Peace be upon you and your good and pure household. Peace be upon you and the angels who gaze upon you and surround your grave. O my Lord, O Commander of the Faithful, this is Sunday, and it is your day and in your name, and I am your guest and your neighbor on it, so host me, O my Lord, and reward me, for you are generous and love hospitality. And he is commanded to rent So do what I have desired and hoped for from you, with the status of you and your family with God and his status with you and by the right of your cousin, the Messenger of God, may God bless him and grant him peace. His family and peace be upon them all. \nThe visit of Al-Zahra, may God’s peace be upon her \nPeace be upon you, O one who tests you. He who tested you created you and found you patient when He tested you. I am a source for you. Qqq Be patient with what your father and heir brought, may God’s prayers be upon them. And I ask you, if I believed you, please join me in my belief in them so that my soul may be pleased, so bear witness that I am clear in Your guardianship and the guardianship of your family, may God’s prayers be upon them all.",
            "DscrpA": "زيارةُ أميرِ المؤمنينَ(عليه السلام) \nبرواية من شاهد صاحِب الزّمان (عليه السلام) وهُو يزوره بها في اليقظة لا في النّوم يَوْمُ الاحد وهوَ يومُه : \nاَلسَّلامُ عَلَى الشَّجَرَةِ النَّبَوِيَّةِ وَالدَّوْحَةِ الْهاشِمِيَّةِ المُضيئَةِ المُثْمِرَةِ بِالنَّبُوَّةِ الْمُونِقَةِ بِالاِْمامَةِ وَعَلى ضَجيعَيْكَ آدَمَ وَنُوح عَلَيْهِمَا السَّلامُ، اَلسَّلامُ عَلَيْكَ وَعَلى اَهْلِ بَيْتِكَ الطَّيِّبينَ الطّاهِرينَ، اَلسَّلامُ عَلَيْكَ وَ عَلَى الْمَلائِكَةِ الُْمحْدِقينَ بِكَ وَالْحافّينَ بِقَبْرِكَ يا مَوْلايَ يا اَميرَ الْمُوْمِنينَ هذا يَوْمُ الاَْحَدِ وَهُوَ يَوْمُكَ وَبِاسْمِكَ وَاَنَا ضَيْفُكَ فيهِ وَ جارُكَ فَاَضِفْنى يا مَوْلاىَ وَاَجِرْنى فَاِنَّكَ كَريمٌ تُحِبُّ الضِّيافَةَ وَ مَأْمُورٌ بِالاِْجارَةِ فَافْعَلْ ما رَغِبْتُ اِلَيْكَ فيهِ وَرَجَوْتُهُ مِنْكَ بِمَنْزِلَتِكَ وَ آلِ بَيْتِكَ عِنْدَاللهِ وَمَنْزِلَتِهِ عِنْدَكُمْ وَبِحَقِّ ابْنِ عَمِّكَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ وَسَلَّمَ وَعَلَيْهِمْ اَجْمَعينَ . \nزيارةُ الزّهْرَاءِ سَلامُ اللهِ عَليها \n اَلسَّلامُ عَلَيْكِ يا مُمْتَحَنَةُ امْتَحَنَكِ الَّذى خَلَقَكِ فَوَجَدَكِ لِمَا امْتَحَنَكِ صابِرَةً اَنَا لَكِ مُصَدِّقٌ صابِرٌ عَلى ما اَتى بِهِ اَبُوكِ وَوَصِيُّهُ صَلَواتُ اللهِ عَلَيْهِما وَاَنَا أَسْأَلُكِ اِنْ كُنْتُ صَدَّقْتُكِ إلاّ اَلْحَقْتِنى بِتَصْديقى لَهُما لِتُسَرَّ نَفْسى فَاشْهَدى اَنّى ظاهِرٌ بِوَلايَتِكِ وَوَلايَةِ آلِ بَيْتِكِ صَلَواتُ اللهِ عَلَيْهِمْ اَجْمَعينَ ."
        },
        {
            "TitleA": "زيارة يَوْمُ الاثنينِ",
            "TitleE": "Visit on Monday",
            "DscrpE": "The visit of Al-Hasan (peace be upon him) Peace be upon you, son of the Messenger of the Lord of the Worlds. Peace be upon you, son of the Commander of the Faithful. Peace be upon you, son of Fatima Al-Zahra, peace be upon me. K, O beloved of God, peace be upon you, O elite of God, peace be upon you, O Amen of God, peace be upon you, O Hujjat of God, peace be upon you Peace be upon you, O light of God. Peace be upon you, O path of God. Peace be upon you, O statement of God’s wisdom. Peace be upon you, O supporter of God’s religion. Peace be upon you, O pure master. Peace be upon you, O righteous man. And peace be upon you, O the one who rises and the trustworthy. Peace be upon you, O one who knows the interpretation. Peace be upon you, O the Guide and the Mahdi. Peace be upon you, O the pure. The Pure One. Peace be upon you, O pious and pure. Peace be upon you, O True and True. Peace be upon you, O truthful martyr. Peace be upon you, O Abu Muhammad al-Hasan bin Ali. May God’s mercy and blessings be upon you. His blessings. \nThe visit of Al-Hussein (peace be upon him) \nPeace be upon you, son of the Messenger of God. Peace be upon you, son of the Commander of the Faithful. Peace be upon you, son of the Lady of the Women of the Worlds. I bear witness that you stand You performed prayer, you paid zakat, you enjoined what was right and forbade what was evil, you worshiped God sincerely, and you struggled for the sake of God with the right of striving until certainty came to you, so you must do it. Peace be upon me as long as I remain and for the rest of the night and day and upon your good and pure family. O my master, I am your friend and the family of your family. Peace to those who are at peace with you and war to those who fight you. I believe in your secret and your openness, your outward appearance and your inwardness. May God curse your enemies from the ancients and the last, and I disavow before God Almighty them, O my Lord, O Abu Muhammad, O Abu No O Abu Abdullah, this is Monday, and it is your day and in your name, and I am your guest, so host me and be hospitable to me, for how excellent I am to be hosted by you and I. Therein are those who are your neighbors, so come to me, for you are commanded to receive hospitality and rent. May God’s blessings and peace be upon you and your good families.",
            "DscrpA": "زِيارةُ الحَسَنِ (عليه السلام) \nاَلسَّلامُ عَلَيْكَ يَابْنَ رَسُولِ رَبِّ الْعالَمينَ اَلسَّلامُ عَلَيْكَ يَابْنَ اَميرِ الْمُؤْمِنينَ اَلسَّلامُ عَلَيْكَ يَابْنَ فاطِمَةَ الزَّهْراءِ اَلسَّلامُ عَلَيْكَ يا حَبيبَ اللهِ اَلسَّلامُ عَلَيْكَ يا صِفْوَةَ اللهِ اَلسَّلامُ عَلَيْكَ يا اَمينَ اللهِ اَلسَّلامُ عَلَيْكَ يا حُجَّةَ اللهِ اَلسَّلامُ عَلَيْكَ يا نُورَ اللهِ اَلسَّلامُ عَلَيْكَ يا صِراطَ اللهِ اَلسَّلامُ عَلَيْكَ يا بَيانَ حُكْمِ اللهِ اَلسَّلامُ عَلَيْكَ يا ناصِرَ دينِ اللهِ اَلسَّلامُ عَلَيْكَ اَيُّهَا السَّيِدُ الزَّكِيُّ اَلسَّلامُ عَلَيْكَ اَيُّهَا الْبَرُّ الْوَفِيُّ اَلسَّلامُ عَلَيْكَ اَيُّهَا الْقائِمُ الاَْمينُ اَلسَّلامُ عَلَيْكَ اَيُّهَا الْعالِمُ بِالتَّأْويلِ اَلسَّلامُ عَلَيْكَ اَيُّهَا الْهادِي الْمَهْديُّ اَلسَّلامُ عَلَيْكَ اَيُّهَا الطّاهِرُ الزَّكِيُّ اَلسَّلامُ عَلَيْكَ اَيُّهَا التَّقِيُّ النَّقِيُّ السَّلامُ عَلَيْكَ اَيُّهَا الْحَقُّ الْحَقيقُ اَلسَّلامُ عَلَيْكَ اَيُّهَا الشَّهيدُ الصِّدّيقُ اَلسَّلامُ عَلَيْكَ يا اَبا مُحَمَّد الْحَسَنَ بْنَ عَلِيٍّ وَ رَحْمَةُ اللهِ وَبَرَكاتُهُ . \nزِيارة الحُسَينِ (عليه السلام) \nاَلسَّلامُ عَلَيْكَ يَابْنَ رَسُولِ اللهِ اَلسَّلامُ عَلَيْكَ يَابْنَ اَميرِ الْمُؤْمِنينَ اَلسَّلامُ عَلَيْكَ يَابْنَ سَيِّدَةِ نِساءِ الْعالَمينَ اَشْهَدُ اَنـَّكَ اَقَمْتَ الصلاةَ وَ آتَيْتَ الزَّكوةَ وَاَمَرْتَ بِالْمَعْرُوفِ وَنَهَيْتَ عَنِ الْمُنْكَرِ وَعَبَدْتَ اللهَ مُخْلِصاً وَجاهَدْتَ فِي اللهِ حَقَّ جِهادِهِ حَتّى أتاكَ الْيَقينُ فَعَلَيْكَ السَّلامُ مِنّي ما بَقيتُ وَبَقِيَ اللَّيْلُ وَالنَّهارُ وَعَلى آلِ بَيْتِكَ الطَّيِّبينَ الطّاهِرينَ، اَنَا يا مَوْلايَ مَوْلىً لَكَ وَلاِلِ بَيْتِكَ سِلْمٌ لِمَنْ سالَمَكُمْ وَحَرْبٌ لِمَنْ حارَبَكُمْ مُؤْمِنٌ بِسِرِّكُمْ وَجَهْرِكُمْ وَظاهِرِكُمْ وَباطِنِكُمْ لَعَنَ اللهُ اَعْداءَكُمْ مِنَ الاَْوَّلينَ وَالاْخِرينَ وَاَنـَا أبْرَأُ اِلَى اللهِ تَعالى مِنْهُمْ يا مَوْلايَ يا اَبا مُحَمَّد يا مَوْلايَ يا اَبا عَبْدِ اللهِ هذا يَوْمُ الاِْثْنَيْنِ وَهُوَ يَوْمُكُما وَبِاسْمـِكُما وَاَنـَا فيهِ ضَيْفُكُما فَاَضيفانى وَاَحْسِنا ضِيافَتى فَنِعْمَ مَنِ اسْتُضيفَ بِهِ اَنْتُما وَاَنـَا فيهِ مِنْ جِوارِكُما فَاَجيرانى فَاِنَّكُما مَأْمُورانِ بِالضِّيافَةِ وَالاِْجارَةِ فَصَلَّى اللهُ عَلَيْكُما وَآلِكُمَا الطَّيِّبينَ ."
        },
        {
            "TitleA": "زيارة يَوْمُ الثّلاثاءِ",
            "TitleE": "Visit on Tuesday",
            "DscrpE": "Ali bin Al-Hussein, Muhammad bin Ali Al-Baqir, and Jaafar bin Muhammad Al-Sadiq, may God’s prayers be upon them all; visiting them (peace be upon them) \nPeace be upon you, ye repository of God’s knowledge. Peace be upon you, oh interpreters of God’s revelation. Peace be upon you, oh Imams of God. Huda, peace be upon you, O pious figures Peace be upon you, O children of the Messenger of God. I am aware of your rights. I have insight into your affairs. I am hostile to your enemies. I am loyal to your friends. My father and my mother, may God’s prayers be upon you. Oh God, I follow the last of them just as I followed the first of them, and I disavow every alliance besides them and disbelieve in the Jabbat and the Taghut and Al-Lat and Al-Uzza, may God’s prayers be upon you, my friends and May God’s mercy and blessings be upon you, sir. The worshipers and the descendants of the guardians. Peace be upon you, O Perseverer of the knowledge of the prophets. Peace be upon you, O truthful and truthful in word and deed, O my friend. This is your day, and it is Tuesday, and I am in it. I am your guest and I seek refuge with you, so host me and protect me in the same position as God has with you and your good and pure family.",
            "DscrpA": "عليّ بن الحسين ومحمّد بن عليّ الباقر وجعفر بن محمّد الصّادق صلوات الله عليهم أجمعين ; زيارتهم (عليهم السلام) \nاَلسَّلامُ عَلَيْكُمْ يا خُزّانَ عِلْمِ اللهِ اَلسَّلامُ عَلَيْكُمْ يا تَراجِمَةَ وَحْيِ اللهِ اَلسَّلامُ عَلَيْكُمْ يا اَئِمَّةَ الْهُدى اَلسَّلامُ عَلَيْكُمْ يا اَعْلامَ التُّقى اَلسَّلامُ عَلَيْكُمْ يا اَوْلادَ رَسُولِ اللهِ اَنَا عارِفٌ بِحَقِّكُمْ مُسْتَبْصِرٌ بِشَأْنِكُمْ مُعاد لاَِعْدائِكُمْ مُوال لاَِوْلِيائِكُمْ بِاَبى اَنْتُمْ وَاُمّى صَلَواتُ اللهِ عَلَيْكُمْ اَللّهُمَّ اِنّى اَتَوالى آخِرَهُمْ كَما تَوالَيْتُ اَوَّلَهُمْ وَاَبْرَأُ مِنْ كُلِّ وَليجَة دُونَهُمْ وَاَكْفُرُ بِالْجِبْتِ وَالطّاغُوتِ وَاللاتِ وَالْعُزّى صَلَواتُ اللهِ عَلَيْكُمْ يا مَوالِيَّ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ اَلسَّلامُ عَلَيْكَ يا سَيِّدَ الْعابِدينَ وَسُلالَةَ الْوَصِيّينَ اَلسَّلامُ عَلَيْكَ يا باقِرَ عِلْمِ النَّبِيّينَ اَلسَّلامُ عَلَيْكَ يا صادِقاً مُصَدِّقاً فِي الْقَوْلِ وَالْفِعْلِ يا مَوالِيَّ هذا يَوْمُكُمْ وَهُوَ يَوْمُ الثلاثاء وَاَنَا فيهِ ضَيْفٌ لَكُمْ وَمُسْتَجيرٌ بِكُمْ فَاَضيفُوني وَاَجيرُوني بِمَنْزِلَةِ اللهِ عِنْدَكُمْ وَآلِ بَيْتِكُمُ الطَّيِّبينَ الطّاهِرينَ ."
        },
        {
            "TitleA": "زيارة يَوْمُ الاربعاءِ",
            "TitleE": "Visit on Wednesday",
            "DscrpE": "Musa bin Jaafar, Ali bin Musa Al-Rida, Muhammad Al-Taqi and Ali Al-Naqi; visiting them (peace be upon them) \nPeace be upon you, O saints of God. Peace be upon you, O proofs of God. Peace be upon you, O light of God in the darknesses of the earth. Peace be upon you. May God’s blessings be upon you and your family Good and pure, my father and mother, you have worshiped God sincerely, and you have striven for the sake of God as He deserves, until certainty has come to you, so may God curse your enemies, the jinn and mankind. Ayn, and I disavow before God and to you from them, O my master, O Abu Ibrahim Musa bin Jafar, O my master, O Abu Al-Hasan Ali bin Musa, O my master, O Abu Ja`far Muhammad ibn Ali, O my master, O Abu al-Hasan Ali ibn Muhammad, I am your friend, I believe in your secrets and your public speech, and I am hospitable to you on this day of yours, which is... On Wednesday, I seek refuge with you, so host me and provide me with your good and pure family.",
            "DscrpA": "مُوسى بن جعفر وعلي بن مُوسى الرّضا ومحمّد التقي وعلي النقي ; زيارتهم (عليهم السلام) \nاَلسَّلامُ عَلَيْكُمْ يا اَوْلِياءَ اللهِ اَلسَّلامُ عَلَيْكُمْ يا حُجَجَ اللهِ اَلسَّلامُ عَلَيْكُمْ يا نُورَ اللهِ فى ظُلُماتِ الاَْرْضِ اَلسَّلامُ عَلَيْكُمْ صَلَواتُ اللهِ عَلَيْكُمْ وَعَلى آلِ بَيْتِكُمُ الطَّيِّبينَ الطّاهِرينَ بِاَبى اَنْتُمْ وَاُمّى لَقَدْ عَبَدْتُمُ اللهَ مُخْلِصينَ وَجاهَدْتُمْ فِي اللهِ حَقَّ جِهادِهِ حَتّى أتاكم الْيَقينُ فَلَعَنَ اللهُ اَعْداءكُمْ مِنَ الْجِنِّ وَالاِْنْسِ اَجَمْعَينَ وَاَنَا اَبْرَأُ اِلَى اللهِ وَاِلَيْكُمْ مِنْهُمْ، يا مَوْلايَ يا اَبا اِبْراهيمَ مُوسَى بْنَ جَعْفَر يا مَوْلايَ يا اَبَا الْحَسَنِ عَلِيَّ بْنَ مُوسى يا مَوْلايَ يا اَبا جَعْفَر مُحَمَّدَ بْنَ عَلِيٍّ يا مَوْلايَ يا اَبَا الْحَسَنِ عَلِيَّ بْنَ مُحَمَّد اَنَا مَوْلىً لَكُمْ مُؤْمِنٌ بِسِرِّكُمْ وَجَهْرِكُمْ مُتَضَيِّفٌ بِكُمْ في يَوْمِكُمْ هذا وَهُوَ يَوْمُ الاَْرْبَعاءِ وَمُسْتَجيرٌ بِكُمْ فَاَضيفُوني وَ اَجيرُوني بِـآلِ بَيْتِـكُـمُ الطَّيـِّبيـنَ الطّاهِـريـنَ . "
        },
        {
            "TitleA": "زيارة يَوْمُ الْخَميسِ",
            "TitleE": "Visit on Thursday",
            "DscrpE": "Al-Hassan bin Ali Al-Askari, may God’s prayers be upon him; so say during his visit \nPeace be upon you, O guardian of God. Peace be upon you, O Proof of God and His purest one. Peace be upon you, O Imam of the believers and heir of the messengers and proof of the Lord of of the worlds, may God’s blessings be upon you and your good and pure family, O my lord, O Abu Muhammad Al-Hassan bin Ali, I am your lord and your household, and this is your day, which is Thursday, and I am your guest on it and I seek refuge with you on it, so be hospitable and generous. “My neighbor, for the sake of your good and pure family.",
            "DscrpA": "الحسن بن علي العسكري صلوات الله عليه ; فقل في زيارته \nاَلسَّلامُ عَلَيْكَ يا وَلِيَّ اللهِ اَلسَّلامُ عَلَيْكَ يا حُجَّةَ اللهِ وَخالِصَتَهُ، اَلسَّلامُ عَلَيْكَ يا اِمامَ الْـمُؤْمِنينَ وَوارِثَ الْمُرْسَلينَ وَحُجَّةَ رَبِّ الْعالَمينَ، صَلَّى اللهُ عَلَيْكَ وَعَلى آلِ بَيْتِكَ الطَّيِّبينَ الطّاهِرينَ، يا مَوْلايَ يا اَبا مُحَمَّد الْحَسَنَ بْنَ عَلِيٍّ اَنَا مَوْلىً لَكَ وَلاِلِ بَيْتِكَ وَهذا يَوْمُكَ وَهُوَ يَوْمُ الْخَميسِ وَاَنـَا ضَيْفُكَ فيهِ وَمُسْتَجيرٌ بِكَ فيهِ فَاَحْسِنْ ضيافتي واِجارَتي بِحَقِّ آلِ بَيْتِكَ الطَّيِّبينَ الطّاهِرينَ ."
        },
        {
            "TitleA": "زيارة يَوْمُ الجُمعةِ",
            "TitleE": "Visit on Friday",
            "DscrpE": "The Companion of the Time, may God's prayers be upon him and in his name, and it is the day on which God hastened his relief; so say in his visit \nPeace be upon you, O proof of God on His earth. Peace be upon you, O eye of God in His creation. Peace be upon you, O light of God in whom Those who are guided will seek it And the believers will be relieved thereby. Peace be upon you, O polite and fearful one. Peace be upon you, O loyal guardian. Peace be upon you, O ship of salvation. Peace be upon you, O. Here is life. Peace be upon you, may God’s prayers and peace be upon you and your good and pure family. Peace be upon you. May God hasten for you what He promised you of victory and the appearance of The matter is, peace be upon you, my lord. I am your lord, I know your fathers and your fathers. I draw near to God Almighty through you and your family, and I await your appearance and the emergence of the truth. At your hands, and I ask God to bless Muhammad and the family of Muhammad and to make me among those who wait for you, those who follow you, those who support you against your enemies, and those who are martyred before you. I am among your saints O my master, O master of the time, may God’s blessings be upon you and your family, this is Friday, and it is your expected day of appearance and relief for the believers at your hands and the killing of The unbelievers with your sword, and I, my lord, in it, are your guest and your neighbor, and you, my lord, are generous among the honorable children and enjoined with hospitality and assistance, so add me and reward me, prayers of God. On you and on you Your pure household.",
            "DscrpA": "صاحِب الزّمان صلوات الله عليه وباسمه وهُو اليوم الذي يظهر فيه عجّل الله فرجه ; فقل في زيارته \nاَلسَّلامُ عَلَيْكَ يا حُجَّةَ اللهِ في اَرْضِهِ، اَلسَّلامُ عَلَيْكَ يا عَيْنَ اللهِ في خَلْقِهِ، اَلسَّلامُ عَلَيْكَ يا نُورَ اللهِ الَّذي يَهْتَدي بِهِ الْمُهْتَدُونَ وَيُفَرَّجُ بِهِ عَنِ الْمُؤْمِنينَ، اَلسَّلامُ عَلَيْكَ اَيُّهَا الْمُهَذَّبُ الْخائِفُ، اَلسَّلامُ عَلَيْكَ اَيُّهَا الْوَلِيُّ النّاصِحُ، اَلسَّلامُ عَلَيْكَ يا سَفينَةَ النَّجاةِ، اَلسَّلامُ عَلَيْكَ يا عَيْنَ الْحَياةِ، اَلسَّلامُ عَلَيْكَ صَلَّى اللهُ عَلَيْكَ وَعَلى آلِ بَيْتِكَ الطَّيِّبينَ الطّاهِرينَ، اَلسَّلامُ عَلَيْكَ عَجَّلَ اللهُ لَكَ ما وَعَدَكَ مِنَ النَّصْرِ وَظُهُورِ الاَْمْرِ، اَلسَّلامُ عَلَيْكَ يا مَوْلايَ، اَنَا مَوْلاكَ عارِفٌ بِاُولاكَ وَاُخْراكَ اَتَقَرَّبُ اِلَى اللهِ تَعالى بِكَ وَبِآلِ بَيْتِكَ، وَاَنْتَظِرُ ظُهُورَكَ وَظُهُورَ الْحَقِّ عَلى يَدَيْكَ وَأَسْأَلُ اللهَ اَنْ يُصَلِّيَ عَلى مُحَمَّد وَآلِ مُحَمَّد وَاَنْ يَجْعَلَنى مِنَ الْمُنْتَظِرينَ لَكَ وَالتّابِعينَ وَالنّاصِرينَ لَكَ عَلى اَعْدائِكَ وَالْمُسْتَشْهَدينَ بَيْنَ يَدَيْكَ في جُمْلَةِ اَوْلِيائِكَ، يا مَوْلايَ يا صاحِبَ الزَّمانِ صَلَواتُ اللهِ عَلَيْكَ وَعَلى آلِ بَيْتِكَ هذا يَوْمُ الْجُمُعَةِ وَهُوَ يَوْمُكَ الْمُتَوَقَّعُ فيهِ ظُهُورُكَ وَالْفَرَجُ فيهِ لِلْمُؤْمِنينَ عَلى يَدَيْكَ وَقَتْلُ الْكافِرينَ بِسَيْفِكَ وَاَنَا يا مَوْلايَ فيهِ ضَيْفُكَ وَجارُكَ وَاَنْتَ يا مَوْلايَ كَريمٌ مِنْ اَوْلادِ الْكِرامِ وَمَأْمُورٌ بِالضِّيافَةِ وَالاِْجارَةِ فَاَضِفْني وَاَجِرْني صَلَواتُ اللهِ عَلَيْكَ وَعَلى اَهْلِ بَيْتِكَ الطّاهِرينَ ."
        }
    ],
    "Anbiaa": [
        {
            "TitleA": "زيارة النبي محمد صلى الله عليه وسلم",
            "TitleE": "The Visit of the Prophet Muhammad, may God bless him and grant him peace",
            "DscrpA": "اَشْهَدُ اَنْ لا اِلـهَ اِلاَّ اللهُ وَحْدَهُ لا شَريكَ لَهُ، وَاَشْهَدُ اَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ، وَاَشْهَدُ اَنَّهُ سَيِّدُ الاَْوَّلينَ وَالاْخِرينَ، وَاَنَّهُ سَيِّدُ الاَْنْبِياءِ وَالْمُرْسَلينَ، اَللّـهُمَّ صَلِّ عَلَيْهِ وَعَلى اَهْلِ بَيْتِهِ الاَئِمَّةِ الطَّيِّبينَ، ثمّ قل : اَلسَّلامُ عَلَيْكَ يا رَسُولَ اللهِ، اَلسَّلامُ عَلَيْكَ يا خَليلَ اللهِ، اَلسَّلامُ عَلَيْكَ يا نَبِيَّ اللهِ، اَلسَّلامُ عَلَيْكَ يا صَفِيَّ اللهِ، اَلسَّلامُ عَلَيْكَ يا رَحْمَةَ اللهِ، اَلسَّلامُ عَلَيْكَ يا خِيَرَةَ اللهِ، اَلسَّلامُ عَلَيْكَ يا حَبيبَ اللهِ، اَلسَّلامُ عَلَيْكَ يا نَجيبَ اللهِ، اَلسَّلامُ عَلَيْكَ يا خاتَمَ النَّبِيّينَ، اَلسَّلامُ عَلَيْكَ يا سَيِّدَ الْمُرْسَلينَ، اَلسَّلامُ عَلَيْكَ يا قائِماً بِالْقِسْطِ، اَلسَّلامُ عَلَيْكَ يا فاتِحَ الْخَيْرِ، اَلسَّلامُ عَلَيْكَ يا مَعْدِنَ الْوَحْيِ وَالتَّنْزيلِ، اَلسَّلامُ عَلَيْكَ يا مُبَلِّغاً عَنِ اللهِ، اَلسَّلامُ عَلَيْكَ اَيُّهَا السِّراجُ الْمُنيرُ، اَلسَّلامُ عَلَيْكَ يا مُبَشِّرُ، اَلسَّلامُ عَلَيْكَ يا نَذيرُ، اَلسَّلامُ عَلَيْكَ يا مُنْذِرُ، اَلسَّلامُ عَلَيْكَ يا نُورَ اللهِ الَّذي يُسْتَضاءُ بِهِ، اَلسَّلامُ عَلَيْكَ وَعَلى اَهْلِ بَيْتِكَ الطَّيِّبينَ الطّاهِرينَ الْهادينَ الْمَهْدِيّينَ، اَلسَّلامُ عَلَيْكَ وَعَلى جَدِّكَ عَبْدِ المُطَّلِبِ، وَعَلى اَبيكَ عِبْدِ اللهِ، اَلسَّلامُ عَلى اُمِّكَ آمِنَةَ بِنْتِ وَهَب، اَلسَّلامُ عَلى عَمِّكَ حَمْزَةَ سَيِّدِ الشُّهَداءِ، اَلسَّلاُمُ عَلى عَمِّكَ الْعَبّاسِ بْنِ عَبْدِ المُطَّلِبِ، اَلسَّلامُ عَلى عَمِّكَ وَكَفيلِكَ أبي طالِب، اَلسَّلامُ عَلى ابْنِ عَمِّكَ جَعْفَر الطَّيّارِ في جِنانِ الْخُلْدِ، اَلسَّلامُ عَلَيْكَ يا مُحَمَّدُ اَلسَّلامُ عَلَيْكَ يا اَحْمَدُ اَلسَّلامُ عَلَيْكَ يا حُجَّةَ اللهِ عَلَى الاَْوَّلينَ وَالاْخَرينَ وَالسّابِقُ اِلى طاعَةِ رَبِّ الْعالَمينَ، وَالْمُهَيْمِنُ عَلى رُسُلِهِ، وَالْخاتَمُ لاَِنْبِيائِهِ، وَالشّاهِدُ عَلى خَلْقِهِ، وَالشَّفِيعُ اِلَيْهِ، وَالْمَكينُ لَدَيْهِ، وَالْمُطاعُ في مَلَكُوتِهِ، الاَْحْمَدُ مِنَ الاَْوْصافِ، الُْمحَمَّدُ لِسائِرِ الاَْشْرافِ، الْكَريمُ عِنْدَ الرَّبِّ، وَالْمُكَلَّمُ مِنْ وَراءِ الْحُجُبِ، الْفائِزُ بِالسِّباقِ، وَالْفائِتُ عَنِ اللِّحاقِ، تَسْليمَ عارِف بِحَقِّكَ مُعْتَرِف بِالتَّقْصيرِ في قِيامِهِ بِواجِبِكَ، غَيْرَ مُنْكَر مَا انْتَهى اِلَيْهِ مِنْ فَضْلِكَ، مُوقِن بِالْمَزيداتِ مِنْ رَبِّكَ، مُؤْمِن بِالْكِتابِ الْمُنْزَلِ عَلَيْكَ، مُحَلِّل حَلالَكَ، مُحَرَّم حَرامَكَ، اَشْهَدُ يا رَسُولَ اللهِ مَعَ كُلِّ شاهِد، وَاَتَحَمَّلُها عَنْ كُلِّ جاحِد، اَنَّكَ قَدْ بَلَّغْتَ رِسالاتِ رَبِّكَ، وَنَصَحْتَ لاُِمَّتِكَ، وَجاهَدْتَ في سَبيلِ رَبِّكَ، وصَدَعْتَ بِاَمْرِهِ، وَاحْتَمَلْتَ الاَْذى في جَنْبِهِ، وَدَعَوْتَ اِلى سَبيلِهِ بِالْحِكْمَةِ وَالْمَوْعِظَةِ الْحَسَنَةِ الْجَميلَةِ، وَاَدَّيْتَ الْحَقَّ الَّذي كانَ عَلَيْكَ، وَاَنَّكَ قَدْ رَؤُفْتَ بِالْمُؤْمِنينَ، وَغَلُظْتَ عَلَى الْكافِرينَ، وَعَبَدْتَ اللهَ مُخْلِصاً حَتّى اَتاكَ الْيَقينُ، فَبَلَغَ اللهُ بِكَ اَشْرَفَ مَحَلِّ الْمُكَرَّمينَ، وَاَعْلى مَنازِلِ الْمُقَرَّبينَ، وَاَرْفَعَ دَرَجاتِ الْمُرْسَلينَ، حَيْثُ لا يَلْحَقُكَ لاحِقٌ، وَلا يَفُوقُكَ فائِقٌ، وَلا يَسْبِقُكَ سابِقٌ، وَلا يَطْمَعُ في اِدْراكِكَ طامِعٌ، اَلْحَمْدُ للهِ الَّذي اسْتَنْقَذَنا بِكَ مِنَ الْهَلَكَةِ، وَهَدانا بِكَ مِنَ الضَّلالَةِ، وَنوَّرَنا بِكَ مِنَ الظُّلْمَةِ، فَجَزاكَ اللهُ يا رَسُولَ اللهِ مِنْ مَبْعُوث اَفْضَلَ ما جازى نَبِيَّاً عَنْ اُمَّتِهِ، وَرَسُولاً عَمَّنْ اُرْسِلَ اِلَيْهِ، بَاَبي اَنْتَ وَاُمّي يا رَسُولَ اللهِ، زُرْتُكَ عارِفاً بِحَقِّكَ، مُقِرّاً بِفَضْلِكَ، مُسْتَبْصِراً بِضَلالَةِ مَنْ خالَفَكَ وَخالَفَ اَهْلَ بَيْتِكَ، عارِفاً بِالْهُدَى الَّذي اَنْتَ عَلَيْهِ، بِاَبي اَنْتَ وَاُمّي وَنَفْسي وَاَهْلي وَمالي وَوَلَدي، اَنَا اُصَلّي عَلَيْكَ كَما صَلَّى اللهُ عَلَيْكَ، وَصَلّى عَلَيْكَ مَلائِكَتُهُ وَاَنْبِياؤُهُ وَرُسُلُهُ، صَلاةً مُتَتابِعَةً وافِرَةً مُتَواصِلَةً لاَ انْقِطاعَ لَها وَلا اَمَدَ وَلا اَجَلَ، صَلَّى اللهُ عَلَيْكَ وَعَلى اَهْلِ بَيْتِكَ الطَّيِّبينَ الطّاهِرينَ كَما اَنْتُمْ اَهْلُهُ . \nثمّ ابسط كفّيك وقل : اَللّـهُمَّ اجْعَلْ جَوامِعَ صَلَواتِكَ، وَنَوامِيَ بَرَكاتِكَ، وَفَواضِلَ خَيْراتِكَ، وَشَرائِفَ تَحِيّاتِكَ وَتَسْليماتِكَ وَكَراماتِكَ وَرَحَماتِكَ وَصَلَواتِ مَلائِكَتِكَ الْمُقَرَّبينَ، وَاَنْبِيائِكَ الْمُرْسَلينَ، وَاَئِمَّتِكَ الْمُنْتَجَبينَ، وَعِبادِكَ الصّالِحينَ، وَاَهْلِ السَّماواتِ وَالاَْرَضينَ، وَمَنْ سَبَّحَ لَكَ يا رَبَّ الْعالَمينَ مِنَ الاَْوَّلينَ وَالاْخِرينَ، عَلى مُحَمَّد عَبْدِكَ وَرَسُولِكَ وَشاهِدِكَ وَنَبِيِّكَ وَنَذيرِكَ وَاَمينِكَ وَمَكينِكَ وَنَجِيِّكَ وَنَجيبِكَ وَحَبيبِكَ وَخَليلِكَ وَصَفيِّكَ وَصَفْوَتِكَ وَخاصَّتِكَ وَخالِصَتِكَ وَرَحْمَتِكَ وَخَيْرِ خِيَرَتِكَ مِنْ خَلْقِكَ، نَبِيِّ الرَّحْمَةِ، وَخازِنِ الْمَغْفِرَةِ، وَقائِدِ الْخَيْرِ وَالْبَرَكَةِ، وَمُنْقِذِ الْعِبادِ مِنَ الْهَلَكَةِ بِاِذْنِكَ، وَداعيهِمْ اِلى دينِكَ الْقَيِّمِ بِاَمْرِكَ، اَوَّلِ النَّبيّينَ ميثاقاً، وَآخِرِهِمْ مَبْعَثاً، الَّذي غَمَسْتَهُ في بَحْرِ الْفَضيلَةِ وَالْمَنْزِلَةِ الْجَليلَةِ، وَالدَّرَجَةِ الرَّفيعَهِ، وَالْمَرْتَبَةِ الْخَطيرَهِ، وَاَوْدَعْتَهُ الاَْصْلابَ الطّاهِرَةَ، وَنَقَلْتَهُ مِنْها اِلَى الاَْرْحامِ الْمُطَهَّرَةِ، لُطْفاً مِنْكَ لَهُ وَتَحَنُّناً مِنْكَ عَلَيْهِ، اِذْ وَكَّلْتَ لِصَوْنِهِ وَحِراسَتِهِ وَحِفْظِهِ وَحِياطَتِهِ مِنْ قُدْرَتِكَ عَيْناً عاصِمَةً، حَجَبْتَ بِها عَنْهُ مَدانِسَ الْعُهْرِ، وَمَعائِبَ السِّفاحِ، حَتّى رَفَعْتَ بِهِ نَواظِرَ الْعِبادِ، وَاَحْيَيْتَ بِهِ مَيْتَ الْبِلادِ، بِاَنْ كَشَفْتَ عَنْ نُورِ وِلادَتِهِ ظُلَمَ الاَْسْتارِ، وَاَلْبَسْتَ حَرَمَكَ بِهِ حُلَلَ الاَْنْوارِ، اَللّـهُمَّ فَكَما خَصَصْتَهُ بِشَرَفِ هذِهِ الْمَرْتَبَةِ الْكَريمَةِ وَذُخْرِ هذِهِ الْمَنْقَبَةِ العَظِيْمَة، صَلِّ عَلَيْهِ كَما وَفي بِعَهْدِكَ، وَبَلَّغَ رِسالاتِكَ، وَقاتَلَ اَهْلَ الْجُحُودِ عَلى تَوْحيدِكَ، وَقَطَعَ رَحِمَ الْكُفْرِ في اِعْزازِ دينِكَ، وَلَبِسَ ثَوْبَ الْبَلْوى في مُجاهَدَةِ اَعْدآئِكَ، وَاَوْجَبْتَ لَهُ بِكُلِّ اَذَىً مَسَّهُ اَوْ كَيْد اَحَسَّ بِهِ مِنَ الْفِئَةِ الَّتي حاوَلَتْ قَتْلَهُ فَضيلَةً تَفُوقُ الْفَضائِلَ، وَيَمْلِكُ بِهَا الْجَزيلَ مِنْ نَوالِكَ، وَقَدْ اَسَرَّ الْحَسْرَةَ، وَاَخْفَى الزَّفْرَةَ، وَتَجَرَّعَ الْغُصَّةَ، وَلَمْ يَتَخَطَّ ما مَثَّلَ لَهُ وَحْيُكَ، اَللّـهُمَّ صَلِّ عَلَيْهِ وَعَلى اَهْلِ بَيْتِهِ صَلاةً تَرْضاها لَهُمْ، وَبَلِّغْهُمْ مِنّا تَحِيَّةً كَثيرَةً وَسَلاماً، وَآتِنا مِنْ لَدُنْكَ في مُوالاتِهِمْ فَضْلاً وَاِحْساناً وَرَحْمَةً وَغُفْراناً، اِنَّكَ ذُو الْفَضْلِ الْعَظيمِ .",
            "DscrpE": "I bear witness that there is no god but Allah alone, with no partner, and I bear witness that Muhammad is His servant and Messenger, and I bear witness that He is the master of the first and the last, and He is the master of the prophets and messengers. O God, bless him and his family, the good imams, then say: Peace be upon you, O Messenger of God. Peace be upon you, O friend of God. Peace be upon you, O Prophet of God. Peace be upon you, O pure one of God. Peace be upon you, O mercy of God. Peace be upon you, O the best of God. Peace be upon you, O beloved of God. Peace be upon you, O Najib of God. Peace be upon you, O Seal of the Prophets. Peace be upon you, O Seal of the Prophets. Peace be upon you, O Master of Messengers, peace be upon you, O upholder of justice, peace be upon you, O opener of goodness, peace be upon you, O source of revelation and revelation, peace be upon you, O conveyer of God, peace be upon you, O enlightening lamp, peace be upon you, O bringer of glad tidings, peace be upon you, O warner, peace be upon you, O Mundhir, peace be upon you, O light of God with which illumination is illuminated. Peace be upon you and upon your family, the good, pure, and guided, peace be upon you and your grandfather Abdul Muttalib. And upon your father, Abdullah. Peace be upon your mother, Amina bint Wahb. Peace be upon your uncle Hamza, the Master of Martyrs. Peace be upon your uncle. Al-Abbas bin Abdul-Muttalib, peace be upon your uncle and sponsor, Abu Talib, peace be upon your cousin Jafar Al-Tayyar in the eternal paradise, peace be upon you, O Muhammad, peace be upon you, O Praise be to you, peace be upon you, O Proof of God over the ancients and the last, the Forerunner to obedience to the Lord of the Worlds, the One who dominates His Messengers, and the Seal of His Prophets. And the witness to His creation, and the intercessor for Him, and the one in whose presence He is established, and the one who is obeyed in His kingdom, the most praiseworthy of all descriptions, the praiseworthy among all nobles, the most honorable in the sight of the Lord, and the most respected. From behind the veil, the one who wins the race and the one who misses the catch-up, the submission of one who knows your rights and admits to negligence in carrying out your duty, without denying it. Whatever you have concluded, please, certain of more from your Lord, believing in the Book revealed to you, permitting what is permissible for you, declaring what is forbidden for what is forbidden, bear witness, O Messenger of God, with every witness, and I bear it on behalf of every denier, for you have conveyed the messages of your Lord, and advised your nation, and striven in the path of your Lord, and have reconciled. at his command, and you endured harm at his side, and you called to his way with wisdom and beautiful and beautiful exhortation, and you fulfilled the rights that were upon you, and you have You were kind to the believers, and were harsh towards the unbelievers, and you worshiped God sincerely until certainty came to you, and through you God reached the most honorable place of the honorable, and the highest status of the close ones, and Raising grades Messengers, where no later will overtake you, no one will surpass you, no previous one will precede you, and no covetous person will aspire to catch up with you. Praise be to God, who saved us through you from destruction, and He guided us through you from error, and enlightened us through you from darkness, so may God reward you, O Messenger of God, with the best reward he has ever given to a prophet. On behalf of his nation, and as a messenger on behalf of whom he was sent to, my father and my mother, O Messenger of God, I visited you, knowing your rights, acknowledging your grace, insightful of the misguidance of those who opposed you and believed in you. So, people of your household, knowing the guidance you are upon, my father, you, my mother, myself, my family, my wealth, and my children, I pray for you as God prayed. upon you, and His angels, prophets, and messengers, may God bless you, a successive, abundant and continuous blessing that has no interruption, duration, or term. May God’s blessings be upon you and upon your good household. The pure as you are his family. Then spread your palms and say: O God, make the sums of Your prayers, the sums of Your blessings, the excellences of Your good deeds, the honors of Your greetings, Your blessings, Your generosity, Your mercies, and the prayers of Your angels. Those who have been brought near, and Your sent prophets, and Your chosen Imams, and Your righteous servants, and the inhabitants of the heavens and the earth, and whoever glorifies You, O Lord of the Worlds, from above. Lin and the others, Ali Muhammad is your servant, your messenger, your witness, your prophet, your warner, your trustworthy one, your protector, your deliverer, your answerer, your beloved, your friend, your purest, your chosen one, your special one, and your sincere one. Thy mercy and the best of Thy creation, the Prophet of Mercy, the Keeper of Forgiveness, the Guide of Goodness and Blessing, and the Savior of the servants from destruction, by permission. And invite them to your upright religion by your command, the first of the prophets to pledge, and the last of them to be sent. whom you dipped in the sea of virtue, lofty status, high rank, and grave rank, and entrusted him with pure crosses, and transferred him from Here he is, to the purified wombs, out of your kindness to him and your compassion for him, as you were appointed to protect him, guard him, and preserve him. And You surrounded him with Your power as a strong spring, with which You concealed from him the filths of immorality and the shame of fornication, until You raised the hopes of the servants through him and revived the dead land through him. Because You revealed the light of his birth from the darkness of the veil, and clothed Your sanctuary with a covering of lights, O God, as You designated it with the honor of this noble rank. And this veil is preserved Great, bless him as he fulfilled your covenant, conveyed your messages, fought those who denied your monotheism, severed the ties of disbelief in the honor of your religion, and wore the garment of iniquity. And you made it necessary for him to fight your enemies, and you made it obligatory for him, for every harm that befell him or any malice that he felt from the group that tried to kill him, to perform a virtue that is superior to all other virtues, and he possesses With it is the abundance of Your blessings, and he concealed the grief, concealed the sigh, swallowed the grief, and did not overcome what Your revelation appeared to him, O God, bless him and upon him. Is His House a prayer that pleases them, and convey to them our many greetings and peace, and bestow upon us from You bounty, benevolence, mercy, and forgiveness from You in being friends with them. The great virtue."
        },
        {
            "TitleA": "زيارة عاشوراء",
            "TitleE": "Visiting Ashura",
            "DscrpA": "اَلسَّلامُ عَلَيْكَ يا اَبا عَبْدِاللهِ، اَلسَّلامُ عَلَيْكَ يَا بْنَ رَسُولِ اللهِ(السَّلامُ عَلَيكَ يا خِيَرَةِ اللهِ وابْنَ خَيرَتِهِ) اَلسَّلامُ عَلَيْكَ يَا بْنَ اَميرِ الْمُؤْمِنينَ وَابْنَ سَيِّدِ الْوَصِيّينَ، اَلسَّلامُ عَلَيْكَ يَا بْنَ فاطِمَةَ سَيِّدَةِ نِساءِ الْعالَمينَ، اَلسَّلامُ عَلَيْكَ يا ثارَ اللهِ وَابْنَ ثارِهِ وَالْوِتْرَ الْمَوْتُورَ، اَلسَّلامُ عَلَيْكَ وَعَلَى الاَْرْواحِ الَّتي حَلَّتْ بِفِنائِكَ عَلَيْكُمْ مِنّي جَميعاً سَلامُ اللهِ اَبَداً ما بَقيتُ وَبَقِىَ اللَّيْلُ وَالنَّهارُ، يا اَبا عَبْدِاللهِ لَقَدْ عَظُمَتِ الرَّزِيَّةُ وَجَلَّتْ وَعَظُمَتِ الْمُصيبَةُ بِكَ عَلَيْنا وَعَلى جَميعِ اَهْلِ الاِْسْلامِ وَجَلَّتْ وَعَظُمَتْ مُصيبَتُكَ فِي السَّماواتِ عَلى جَميعِ اَهْلِ السَّماواتِ، فَلَعَنَ اللهُ اُمَّةً اَسَّسَتْ اَساسَ الظُّلْمِ وَالْجَوْرِ عَلَيْكُمْ اَهْلَ الْبَيْتِ، وَلَعَنَ اللهُ اُمَّةً دَفَعَتْكُمْ عَنْ مَقامِكُمْ وَاَزالَتْكُمْ عَنْ مَراتِبِكُمُ الَّتي رَتَّبَكُمُ اللهُ فيها، وَلَعَنَ اللهُ اُمَّةً قَتَلَتْكُمْ وَلَعَنَ اللهُ الْمُمَهِّدينَ لَهُمْ بِالَّتمْكينِ مِنْ قِتالِكُمْ، بَرِئْتُ اِلَى اللهِ وَاِلَيْكُمْ مِنْهُمْ وَمِنْ اَشْياعِهِمْ وَاَتْباعِهِمْ وَاَوْلِيائِهِم، يا اَبا عَبْدِاللهِ اِنّي سِلْمٌ لِمَنْ سالَمَكُمْ وَحَرْبٌ لِمَنْ حارَبَكُمْ اِلى يَوْمِ الْقِيامَةِ، وَلَعَنَ اللهُ آلَ زِياد وَآلَ مَرْوانَ، وَلَعَنَ اللهُ بَني اُمَيَّةَ قاطِبَةً، وَلَعَنَ اللهُ ابْنَ مَرْجانَةَ، وَلَعَنَ اللهُ عُمَرَ بْنَ سَعْد، وَلَعَنَ اللهُ شِمْراً، وَلَعَنَ اللهُ اُمَّةً اَسْرَجَتْ وَاَلْجَمَتْ وَتَنَقَّبَتْ لِقِتالِكَ، بِاَبي اَنْتَ وَاُمّي لَقَدْ عَظُمَ مُصابي بِكَ فَاَسْأَلُ اللهَ الَّذي َكْرَمَ مَقامَكَ وَاَكْرَمَني اَنْ يَرْزُقَني طَلَبَ ثارِكَ مَعَ اِمام مَنْصُور مِنْ اَهْلِ بَيْتِ مُحَمَّد صَلَّى اللهُ عَلَيْهِ وَآلِهِ، اَللّـهُمَّ اجْعَلْني عِنْدَكَ وَجيهاً بِالْحُسَيْنِ عَلَيْهِ السَّلامُ فِي الدُّنْيا وَالاْخِرَةِ، يا اَبا عَبْدِاللهِ اِنّي اَتَقَرَّبُ اِلى اللهِ وَ اِلى رَسُولِهِ وَاِلى اَميرِ الْمُؤْمِنينَ وَاِلى فاطِمَةَ وَاِلَى الْحَسَنِ وَاِلَيْكَ بِمُوالاتِكَ وَبِالْبَراءَةِ (مِمَّنْ قاتَلَكَ وَنَصَبَ لَكَ الْحَرْبَ وَبِالْبَراءَةِ مِمَّنْ اَسَسَّ اَساسَ الظُّلْمِ وَالْجَوْرِ عَلَيْكُمْ وَاَبْرَأُ اِلَى اللهِ وَاِلى رَسُولِهِ) مِمَّنْ اَسَسَّ اَساسَ ذلِكَ وَبَنى عَلَيْهِ بُنْيانَهُ وَجَرى فِي ظُلْمِهِ وَجَوْرِهِ عَلَيْكُمْ وَعلى اَشْياعِكُمْ، بَرِئْتُ اِلَى اللهِ وَاِلَيْكُمْ مِنْهُمْ وَاَتَقَرَّبُ اِلَى اللهِ ثُمَّ اِلَيْكُمْ بِمُوالاتِكُمْ وَمُوالاةِ وَلِيِّكُمْ وَبِالْبَراءَةِ مِنْ اَعْدائِكُمْ وَالنّاصِبينَ لَكُمُ الْحَرْبَ وَبِالْبَراءَةِ مِنْ اَشْياعِهِمْ وَاَتْباعِهِمْ، اِنّي سِلْمٌ لِمَنْ سالَمَكُمْ وَحَرْبٌ لِمَنْ حارَبَكُمْ وَوَلِىٌّ لِمَنْ والاكُمْ وَعَدُوٌّ لِمَنْ عاداكُمْ فَاَسْأَلُ اللهَ الَّذي أكْرَمَني بِمَعْرِفَتِكُمْ وَمَعْرِفَةِ اَوْلِيائِكُمْ وَرَزَقَنِى الْبَراءَةَ مِنْ اَعْدائِكُمْ اَنْ يَجْعَلَني مَعَكُمْ فِي الدُّنْيا وَالاْخِرَةِ وَاَنْ يُثَبِّتَ لي عِنْدَكُمْ قَدَمَ صِدْق فِي الدُّنْيا وَالاْخِرَةِ وَاَسْأَلُهُ اَنْ يُبَلِّغَنِى الْمَقامَ الَْمحْمُودَ لَكُمْ عِنْدَ اللهِ وَاَنْ يَرْزُقَني طَلَبَ ثاري مَعَ اِمام هُدىً ظاهِر ناطِق بِالْحَقِّ مِنْكُمْ وَاَسْألُ اللهَ بِحَقِّكُمْ وَبِالشَّأنِ الَّذي لَكُمْ عِنْدَهُ اَنْ يُعْطِيَني بِمُصابي بِكُمْ اَفْضَلَ ما يُعْطي مُصاباً بِمُصيبَتِهِ مُصيبَةً ما اَعْظَمَها وَاَعْظَمَ رَزِيَّتَها فِي الاِْسْلامِ وَفِي جَميعِ السَّماواتِ وَالاْرْضِ اَللّـهُمَّ اجْعَلْني فِي مَقامي هذا مِمَّنْ تَنالُهُ مِنْكَ صَلَواتٌ وَرَحْمَةٌ وَمَغْفِرَةٌ، اَللّـهُمَّ اجْعَلْ مَحْياىَ مَحْيا مُحَمَّد وَآلِ مُحَمَّد وَمَماتي مَماتَ مُحَمَّد وَآلِ مُحَمَّد، اَللّـهُمَّ اِنَّ هذا يَوْمٌ تَبَرَّكَتْ بِهِ بَنُو اُمَيَّةَ وَابْنُ آكِلَةِ الاَْكبادِ اللَّعينُ ابْنُ اللَّعينِ عَلى لِسانِكَ وَلِسانِ نَبِيِّكَ صَلَّى اللهُ عَلَيْهِ وَآلِهِ فِي كُلِّ مَوْطِن وَمَوْقِف وَقَفَ فيهِ نَبِيُّكَ صَلَّى اللهُ عَلَيْهِ وَآلِهِ، اَللّـهُمَّ الْعَنْ اَبا سُفْيانَ وَمُعاوِيَةَ وَيَزيدَ ابْنَ مُعاوِيَةَ عَلَيْهِمْ مِنْكَ اللَّعْنَةُ اَبَدَ الاْبِدينَ، وَهذا يَوْمٌ فَرِحَتْ بِهِ آلُ زِياد وَآلُ مَرْوانَ بِقَتْلِهِمُ الْحُسَيْنَ صَلَواتُ اللهِ عَلَيْهِ، اَللّـهُمَّ فَضاعِفْ عَلَيْهِمُ اللَّعْنَ مِنْكَ وَالْعَذابَ (الاَْليمَ) اَللّـهُمَّ اِنّي اَتَقَرَّبُ اِلَيْكَ فِي هذَا الْيَوْمِ وَفِي مَوْقِفي هذا وَاَيّامِ حَياتي بِالْبَراءَةِ مِنْهُمْ وَاللَّعْنَةِ عَلَيْهِمْ وَبِالْمُوالاةِ لِنَبِيِّكَ وَآلِ نَبِيِّكَ عَلَيْهِ وَعَلَيْهِمُ اَلسَّلامُ ثمّ تقول مائة مرّة : اَللّـهُمَّ الْعَنْ اَوَّلَ ظالِم ظَلَمَ حَقَّ مُحَمَّد وَآلِ مُحَمَّد وَآخِرَ تابِع لَهُ عَلى ذلِكَ، اَللّـهُمَّ الْعَنِ الْعِصابَةَ الَّتي جاهَدَتِ الْحُسَيْنَ (عليه السلام) وَشايَعَتْ وَبايَعَتْ وَتابَعَتْ عَلى قَتْلِهِ، اَللّـهُمَّ الْعَنْهُمْ جَميعاً ثمّ تقول مائة مرّة : اَلسَّلامُ عَلَيْكَ يا اَبا عَبْدِاللهِ وَعَلَى الاَْرْواحِ الَّتي حَلَّتْ بِفِنائِكَ عَلَيْكَ مِنّي سَلامُ اللهِ اَبَداً ما بَقيتُ وَبَقِيَ اللَّيْلُ وَالنَّهارُ وَلا جَعَلَهُ اللهُ آخِرَ الْعَهْدِ مِنّي لِزِيارَتِكُمْ، اَلسَّلامُ عَلَى الْحُسَيْنِ وَعَلى عَلِيِّ بْنِ الْحُسَيْنِ وَعَلى اَوْلادِ الْحُسَيْنِ وَعَلى اَصْحابِ الْحُسَيْنِ، ثمّ تقول : اَللّـهُمَّ خُصَّ اَنْتَ اَوَّلَ ظالِم بِاللَّعْنِ مِنّي وَابْدَأْ بِهِ اَوَّلاً ثُمَّ (الْعَنِ) الثّانيَ وَالثّالِثَ وَالرّابِعَ اَللّـهُمَّ الْعَنْ يَزيدَ خامِساً وَالْعَنْ عُبَيْدَ اللهِ بْنَ زِياد وَابْنَ مَرْجانَةَ وَعُمَرَ بْنَ سَعْد وَشِمْراً وَآلَ اَبي سُفْيانَ وَآلَ زِياد وَآلَ مَرْوانَ اِلى يَوْمِ الْقِيامَةِ ثمّ تسجد وتقُول : اَللّـهُمَّ لَكَ الْحَمْدُ حَمْدَ الشّاكِرينَ لَكَ عَلى مُصابِهِمْ اَلْحَمْدُ للهِ عَلى عَظيمِ رَزِيَّتي اَللّـهُمَّ ارْزُقْني شَفاعَةَ الْحُسَيْنِ يَوْمَ الْوُرُودِ وَثَبِّتْ لي قَدَمَ صِدْق عِنْدَكَ مَعَ الْحُسَيْنِ وَاَصْحابِ الْحُسَيْنِ اَلَّذينَ بَذَلُوا مُهَجَهُمْ دُونَ الْحُسَيْنِ عَلَيْهِ السَّلامُ .",
            "DscrpE": "Peace be upon you, O Abu Abdullah. Peace be upon you, O son of the Messenger of God. (Peace be upon you, O the best of God and the son of His best.) Peace be upon you, O son of the Commander of the Faithful and son of the Master of God. And two guardians. Peace be upon you, O son of Fatima, mistress of the women of the worlds. Peace be upon you, O Thaar of God and the son of His Thaar and the Motor Witr. Peace be upon you and the souls that descended upon you with your annihilation, upon you all from me. May God’s peace be upon you, as long as I remain and as the night and day remain. O Abu Abdullah, the calamity has become great. Your calamity is great and great before us and all the people of Islam, and your calamity in the heavens is great and great before all the people of the heavens. May God curse a nation that established a foundation Injustice and injustice are upon you, O People of the House. May God curse the nation that pushed you away from your position and removed you from your ranks in which God placed you. May God curse the nation that killed you. May God curse those who pave the way for them by enabling you to fight. I disavow before God and you from them and from their followers and followers and loyalists. O Abu Abdullah, I asked M for those who are at peace with you and war For those who fought you until the Day of Resurrection, and may God curse the family of Ziyad and the family of Marwan, and may God curse the entire Umayyads, and may God curse Ibn Marjanah, and may God curse Omar bin Saad, and may God curse Shammar, and may God curse God is a nation that has saddled and harnessed itself and prepared to fight you. May my father and mother be sacrificed for you. My affliction with you has been great, so ask. God is the One who honored your position and honored me by granting me the request of your revolt with Imam Mansour from the people of the House of Muhammad, may God bless him and his family, O God, make me an honorable person before you. Hussein, peace be upon him, in this world and the hereafter, O Abu Abdullah, I draw closer to God, to His Messenger, to the Commander of the Faithful, to Fatima, to Al-Hassan, and to you. With your loyalty and disavowal (from those who fought you and waged war against you, and with disavowal from those who established the foundation of injustice and oppression against you, and disavowed before God and His Messenger ) Of those who established the foundation of that and built its structure on it, and whose injustice and injustice were perpetrated against you and your people, I disavowed before God and for you from them, and he became close to God. I bless you with loyalty to you, loyalty to your guardian, and disavowal. From your enemies and those who wage war against you, and with a disavowal of their followers and followers. Indeed, I am at peace with those who are at peace with you, and at war with those who fight you, and I am loyal to those who are loyal to you. And an enemy to those who are hostile to you, so I ask God, who has honored me with your knowledge and the knowledge of your friends, and granted me disavowal from your enemies, to place me with you in this world, otherwise... And that he may prove for me with you a sincerity in this world and the hereafter, and I ask him That He may attain to me the praiseworthy status you have with God, and that He may grant me a quest for my retaliation with a clearly guided Imam who speaks the truth from among you, and I ask God for your right and for the matter that is yours. He has the right to give me the best of what He gives to someone afflicted with your affliction, a calamity that is the greatest and most disgraceful in Islam and in all the heavens and the earth. Oh God, make me... This is where I stand Of those whom prayers, mercy, and forgiveness obtain from You, O God, make my life the life of Muhammad and the family of Muhammad, and my death the death of Muhammad and the family of Muhammad, O God, this is a blessed day The Umayyads and the son of the cursed eater of livers, the son of the cursed, cursed him according to your tongue and the tongue of your Prophet, may God’s prayers and peace be upon him and his family, in every place and situation in which your Prophet, may God’s prayers and peace be upon him, stood. May God be upon him and his family. O God, curse Abu Sufyan and Muawiyah and Yazid Ibn Muawiyah upon them more than You have cursed them forever and ever. This is a day in which the family of Ziyad and the family of Marwan rejoiced. Because of their killing of Al-Hussein, may God’s prayers be upon him, O God, increase upon them Your curse and the (painful) torment. O God, I draw near to You on this day and in my position. This and the days of my life, disavow them and curse them, and be loyal to your Prophet and the family of your Prophet, peace be upon them. Then you say a hundred times: O God, curse the first oppressor. He wronged the rights of Muhammad, the family of Muhammad, and another of his followers for that. O God, curse the band that fought against Al-Hussein (peace be upon him), supported and pledged allegiance, and continued to kill him. Oh God, curse them all, then say a hundred times: Peace be upon you, O Abu Abdullah, and upon the souls that descended upon your demise. May the peace of God be upon you from me, as long as I remain, and as long as night and day remain. May God make it the last of my promise to visit you. Peace be upon Al-Hussein, and on Ali bin Al-Hussein, and on the sons of Al-Hussein, and on the companions of Al-Hussein. Then you say: Oh God, single out you who are the first wrongdoer to curse me, and start with him first, then (curse) the second, third, and fourth. Oh God, curse Yazeed a fifth, And curse Ubayd Allah bin Ziyad, Ibn Marjanah, Omar bin Saad, Shamra, the family of Abu Sufyan, the family of Ziyad, and the family of Marwan until the Day of Resurrection, then you prostrate and say: O God, praise be to You. Extend those who are thankful to you for their afflictions. Praise be to God for my great well-being. O God, grant me the intercession of Hussein on the Day of Roses, and establish for me the status of truthfulness with You. Al-Hussein and the companions of Al-Hussein who made their pilgrimage to the exclusion of Al-Hussein, peace be upon him."
        },
        {
            "TitleA": "زيارة أمير المؤمني عليه السلام",
            "TitleE": "The Visit of the Commander of the Faithful, peace be upon him",
            "DscrpA": "اَلسَّلامُ عَلَيْكَ يا أَمِينَ اللهِ فِي أَرْضِهِ وَحُجَّتَهُ عَلَى عِبادِهِ، أَشْهَدُ أَنَّكَ جاهَدْتَ فِي اللهِ حَقَّ جِهادِهِ، وَعَمِلْتَ بِكِتابِهِ، وَاتَّبَعْتَ سُنَنَ نَبِيِّهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ، حَتّى دَعَاكَ اللهُ إِلَى جِوارِهِ فَقَبَضَكَ إَلَيْهِ بِاخْتِيارِهِ، وَأَلْزَمَ أَعْداءَكَ الْحُجَّةَ مَعَ ما لَكَ مِنَ الْحُجَجِ الْبالِغَةِ عَلَى جَمِيع خَلْقِهِ، اَلّلهُمَّ فَاجْعَلْ نَفْسِي مُطْمَئِنَّةً بِقَدَرِكَ راضِيَةً بِقَضائِكَ، مُولَعَةً بِذِكْرِكَ وَدُعائِكَ، مُحِبَّةً لِصَفْوَةِ أَوْلِيائِكَ، مَحْبُوبَةً فِي أَرْضِكَ وَسَمائِكَ، صَابِرَةً عَلَى نُزُولِ بَلائِكَ، شاكِرَةً لِفَواضِلِ نَعْمائِكَ ذاكِرَةً لِسَوابِغِ آلائِكَ، مُشْتاقَةً إِلَى فَرْحَةِ لِقَائِكَ، مُتَزَوِّدَةً التَّقوى ليَوْمِ جزائِكَ مُسْتَنّةً بِسُنَنِ أَوْلِيائِكَ مُفارِقةً لِأَخْلاقِ أَعْدائِكَ مَشْغُولَةً عَنِ الدُّنْيا بِحَمْدِكَ وَثَنائِكَ... اَلّلهُمَّ إِنَّ قُلُوبَ الْمُخْبِتِينَ إِلَيْكَ والِهَةٌ، وَسُبُلَ الرَّاغِبِينَ إِلَيْكَ شارِعَةٌ وَأَعْلامَ الْقاصِدينَ إِلَيْكَ واضِحَةٌ، وَأَفْئِدَةَ الْعارِفِينَ مِنْكَ فازِعَةٌ، وَأَصْواتَ الدَّاعِينَ إِلَيْكَ صاعِدَةٌ، وَأَبْوابَ الإِجابَةِ لَهُمْ مُفَتَّحَةٌ، وَدَعْوَةَ مَنْ نَاجَاكَ مُسْتَجَابَةٌ وَتَوْبَةَ مَنْ أَنابَ إِلَيْكَ مَقْبُولَةٌ، وَعَبْرَةَ مَنْ بَكى مِنْ خَوْفِكَ مَرْحُومَةٌ، وَالإِغاثَةَ لِمَنِ اسْتَغاثَ بِكَ مَوْجُودَةٌ، والإِعانَةَ لِمَنِ اسْتَعانَ بِكَ مَبْذُولَةٌ، وَعِداتِكَ لِعِبادِكَ مُنْجَزَةٌ، وَزَلَلَ مَنِ اسْتَقالَكَ مُقالَةٌ، وَأَعْمالَ الْعَامِلِينَ لَدَيْكَ مَحْفُوظَةٌ، وَأَرْزاقَكَ إِلَى الْخَلائِقِ مِنْ لَدُنْكَ نازِلَةٌ وَعَوائِدَ الْمَزِيدِ إِلَيْهِمْ واصِلَةٌ، وَذُنُوبَ الْمُسْتَغْفِرينَ مَغْفُورَةٌ، وَحَوائِجَ خَلْقِكَ عِنْدَكَ مَقْضِيَّةٌ، وَجَوائِزَ السَّائِلِينَ عِنْدَكَ مُوَفَّرَةٌ، وَعَوائِدَ الْمَزيدِ مُتَواتِرَةٌ، وَمَوائِدَ الْمُسْتَطْعِمِينَ مُعَدَّةٌ، وَمَناهِلَ الظِّماءِ مُتْرَعَةٌ، اَلّلهُمَّ فَاسْتَجِبْ دُعائِي وَاقْبَلْ ثَنائِي وَاجْمَعْ بَيْنِي وَبَيْنَ أَوْلِيائِي، بِحَقِّ مُحَمَّدٍ وَعَلِيٍّ وَفاطِمَةَ وَالْحَسَنِ وَالْحُسَيْنِ إِنَّكَ وَلِيُّ نَعْمائِي وَمُنْتَهى مُنايَ وَغايَةُ رَجائِي فِي مُنْقَلَبِي وَمَثْوايَ. \nوقد ذُيّلت هذه الزيارةُ في كتاب كامل الزّيارةِ بهذا القول: \nأَنْتَ إِلهي وَسَيِّدي وَمَوْلايَ، إغْفِرْ لِأوْلِيائِنا وَكُفَّ عَنّا أَعْداءَنا، وَاشْغَلْهُمْ عَنْ أَذانا وَأَظْهِرْ كَلِمَةَ الْحَقِّ وَاجْعَلْهَا الْعُلْيا، وَأَدْحِضْ كَلِمَةَ الْباطِلِ وَاجْعَلْهَا السُّفْلى إِنَّكَ عَلى كُلِّ شَيءٍ قَديرٌ.. ",
            "DscrpE": "Peace be upon you, O Trustee of God on His earth and His proof upon His servants. I bear witness that you have striven for the sake of God as He deserves, and have acted according to His Book, and followed the Sunnahs of His Prophet, may God bless him and grant him peace. His family, until God called you to his side, and He took you to Him by His choice, and He forced your enemies to make the argument despite the strong arguments you have against him. All of His creation, O God, make my soul reassured by Your destiny, satisfied with Your decree, fond of Your remembrance and supplications, loving the elite of Your saints, loved in every way. Your land and your heavens, patient when your affliction descends, thankful for the virtues of your blessings, remembering the reasons for your blessings, longing for the joy of meeting you, equipped with piety for the day of your reward. A stench with the customs of your saints, a departure from morals Your enemies are distracted from the world with your praise and praise... Oh God, the hearts of those who seek you are dire, the paths of those who seek you are clear, and the flags of those who seek you are clear. It is clear, and the hearts of those who know you are filled with joy, and the voices of those who call upon you are rising, and the doors of answering them are opened, and the supplication of those who rescue you is fully answered. It is accepted by the one who turns to you. And a lesson for those who cried out of Your fear is Merciful, and relief is available for those who seek Your help, assistance is given to those who seek Your help, and Your promises to Your servants are fulfilled. And the loss of your resignation has come down, and the deeds of those who work for you are preserved, and your provisions to the creatures from you are coming down, and the returns of more to them are continuing, and sins Those who seek forgiveness will be forgiven, and the needs of your creation will be forgiven. You have a decree, the rewards for those who ask you are plentiful, the returns of more are frequent, the tables for the needy are prepared, and the waters of the thirsty are full. Answer my supplication, accept my praise, and unite me with my friends, by the right of Muhammad, Ali, Fatima, Al-Hasan, and Al-Hussein, you are the guardian of my blessings, the end of my desires, and the goal of my blessings. He came to my heart and my abode. This visit was appended in the book Kamel Al-Ziyarah with this saying: You are my God, my master, and my master. Forgive our friends and protect us from our enemies, and distract them from our harm, reveal the word of truth, and make This is the highest, and refute the word of falsehood and make it the lowest. Indeed, You have power over all things."
        },
        {
            "TitleA": "زيارة وارث ",
            "TitleE": "Visiting an heir",
            "DscrpE": "Peace be upon you, O heir of Adam, God’s elite. Peace be upon you, O heir of Noah, the Prophet of God. Peace be upon you, O heir of Abraham, God’s friend. Peace be upon you, O heir of Moses. O God, peace be upon you, O heir of Jesus, the Spirit of God. Peace be upon you, O heir of Muhammad, beloved of God. Peace be upon you, O heir of the Commander of the Faithful and my guardian. May God’s peace be upon you, son of Muhammad the Chosen One. Peace be upon you, son of Ali al-Murtada. Peace be upon you, son of Fatima al-Zahra. Peace be upon you, son of Khadija the Great. Peace be upon you, O revolt of God. I bear witness that you have established prayer, paid zakat, enjoined what is right, forbidden what is wrong, and obeyed God and His Messenger until certainty came to you. -N God A nation killed you, and God cursed a nation that wronged you, and God cursed a nation. I heard about that and accepted it. O my lord, O Abu Abdullah, I bear witness that you were a light in the lofty loins and the purified wombs were not spared. The pre-Islamic era lived with its filth and did not clothe you with any of its garments, and I bear witness that you are one of the pillars of the religion and the pillars of the believers, and I bear witness that you are the righteous, pious and contented Imam. The Pure One, the Guide, the Mahdi. And I bear witness that the Imams from your progeny are the word of piety, the signs of guidance, the most reliable handhold, and the proof against the people of the world. I bear witness to God and His angels and His Prophet. O God and His Messengers, I am a believer in you, and I am certain of your return, in the laws of my religion and the conclusions of my deeds, and my heart is at peace with your heart, and my command is for your command, I follow. May the blessings of God be upon you, your souls, and your bodies. And upon your bodies, and upon your witnesses, and upon In your absence, and on your appearance, and on your inside, my door is on you and my mother, O son of the Messenger of God. My door is on you and my mother, O Abu Abdullah. The calamity has become great and the calamity has been great. It is upon us and upon all the inhabitants of the heavens and the earth. May God curse a nation that has saddled, harnessed, prepared, and veiled to fight you, O my lord, O Abu Abdullah, I intended to visit you, ask May God bless Muhammad and the family of Muhammad and place me with you in this world and the hereafter.",
            "DscrpA": "السَّلامُ عـَلَيـْكَ يا وارِثَ آدَمَ صـَفـُوةِ اللهِ السَّلامُ عـَلَيْكَ يا وارِثَ نـوُحٍ نَبــِيِ اللهِ السَّلامُ عـَلَيـْكَ يـا وارِثَ إبـراهيـمَ خـَليـلِ اللهِ السَّلامُ عـَلَيـْكَ يا وارِثَ موســى كـَليِم اللهِ السَّلامُ عـَلَيـْكَ يـا وارِثَ عـيـسى روُحِ الله السَّلامُ عـَلَيْكَ يا وارِثَ مـُحـَمـّدٍ حـَبـيبِ اللهِ السَّلامُ عـَلَيـْكَ يـا وارِثَ اَميرِ المُؤمِنينَ وَلَيِ اللهِ السَّلامُ عـَلَيـْكَ يَابـنَ مـُحـَمـّدٍ المـُصـطـَفـى السَّلامُ عـَلَيْكَ يَابـن عـلي المرتـضـى السَّلامُ عَلَيْكَ يَابـن فاطـمة الزهراء السَّلامُ عَلَيْكَ يَابـنَ خَديجَةَ الكُبـرى السَّلام عَلَيْكَ يا ثارَ اللهِ وابـنَ ثارِهِ والوِتـرَ المَوتـوُرَ اَشـهَدُ اَنَّكَ قَد اَقَمتَ الصَّلاةَ وَآتَيتَ الزَّكاة وَاَمَرتَ بـاُلمِعروف ِوَنَهَيتَ عـَنِ المُنكرِ وَاَطـَعـتَ اللهَ وَرَسـولَهُ حـَتّى اَتيكَ اليَقـينُ فـَلَعـَنَ اللهُ اُمَةً قَتـَلَتـكَ وَلَعَنَ اللهُ اُمَةً ظَلَمَتكَ وَلَعَنَ اللهُ اُمَةً سَمِعت بـِذلك فَرَضِيَت بـه يا مَولاي يا ابا عَبدِ اللهِ اَشهَدُ اَنّك كُنتَ نوُرا في الأصلابِ الشّامِخَةِ وَالأرحـامِ المُطَهَرَةِ لم تـُنَجـِسـكَ الجـاهِليَّةُ بـاَنِجـاسـِها وَلَم تـُلبـِسكَ مِن مُدلَهِمّاتِ ثـِيابـِها وَاَشـهَدُ أنَكَ مِن دَعائِم الدّين وَاَركانِ المُؤمِنينَ وَاَشهَدُ اَنّكَ الإمـام البَّرُ التَّقـيُ الرَّضـيُ الزَّكيّ الهادِي المَهدِيُ وَاَشـهَدُ اَنَّ الأَئمّة مِن وُلْدِكَ كَلِمةُ التَّقـوى وَاَعـلامُ الهُدى وَالعـُروةُ الوُثـقى وَالحـُجَّةُ عـَلى اَهل الدُنيـا وَاُشـهِدُ اللهَ وَمـلائكـَتـَهُ وَاَنبـِيائَهُ وَرُسـُلَهُ اَنّي بـِكـمُ مُؤمِنٌ وَبـِايِابـِكم مُوقنٌ بـَشَرائِع ديني وخواتيِم عَمَلي وقَلبي لقَلبِكم سِلمٌ وَاَمري لِامْرِكـمُ مُتَّبـع صـَلَوات الله عَلَيكم وَعَلى اَرواحـِكم وَعَلى اَجـسـادِكُم وعـَلَى اَجـسـامِكُم وَعـَلى شـاهِدِكم وَعـَلَى غـائِبـِكم وَعـَلَى ظـاهركم وعـلى بــاطـِنـِكـم بـاَبـي أَنـت وَ اُمي يَا بْن رَسـُولِ اللهِ بِاَبي اَنتَ وَاَمّي يا ابـا عـَبـدِ اللهِ لَقَد عَظـُمتِ الرَّزيَّةُ و جـَلَتِ المُصـيبـَةُ بـِكَ عَلَينا وَعَلى جــَمــيعِ اَهل السَّمــواتِ والأرض فــَلَعَنَ اللهُ اُمـةً أَسرجَت و َاَلجمـَتْ وَتـَهَيَأت و تنـقـبـت لِقـِتالِك يامـَولايَ ياابـا عـَبـدِ اللهِ قـَصـَدتُ زيارتك اَسـئَلُ اللهَ بـالِشـأن الذَي لَكَ عِندَهُ وَ بـِالمَحَل الَّذي لَكَ لَدَيهِ اَن يُصـَليَ عَلَى مُحـَمّدٍ وَآلِ مُحـَمّدٍ وَاَن يَجعَلَني مَعَكم في الدُنيا وَالآخـِرة"
        },
        {
            "TitleA": "زيارات السيدة فاطمة الزهراء عليها السلام",
            "TitleE": "The visits of Lady Fatima Al-Zahra, peace be upon her,",
            "DscrpE": "Peace be upon you, O tested one. God, who created you, tested you before He created you, and found you patient when He tested you. We are your allies and believers. Be patient with everything that your father, may God’s prayers and peace be upon him and his family, brought to us, and his successor brought to us. We ask you, if we believed you, you would join us in our belief. To them, let us give glad tidings to ourselves that we have been purified by your guardianship.\nThen you say:\nPeace be upon you, daughter of the Messenger of God, peace be upon you, daughter of God’s Prophet, peace Peace be upon you, daughter of God’s beloved. Peace be upon you, daughter of Safi Allah. Peace be upon you, daughter of Amin God. Peace be upon you. Peace be upon you, oh daughter of the best of God’s creation. Peace be upon you, oh daughter of the best of God’s prophets, messengers, and angels. Peace be upon you, oh daughter of the best of creation. Peace be upon you. O mistress of the women of the worlds, from the first to the last, peace be upon you, O wife of God’s guardian and the best of creation after the Messenger of God. Peace be upon you, O mother of Al-Hasan and Al-Hussein, the lords of the youth of the people of Paradise. \nPeace be upon you, O truthful martyr. Peace be upon you, O merciful and satisfactory one. Peace be upon you, O virtuous and pure one. Peace be upon you, O virtuous and pure one. O human nymph, peace be upon you, O pious and pure one, peace be upon you, O learned and knowledgeable one, peace be upon you, O oppressed and persecuted one. Warra. \nPeace be upon you, O Fatima, daughter of the Messenger of God, peace be upon you, O oppressed oppressor, peace be upon you and your father, peace be upon you and your husband, and Your children, and God’s mercy and blessings. \nMay God’s blessings be upon you, your soul, and your body. I bear witness that you have proceeded upon clear evidence from your Lord, and that whoever pleases you has pleased the Messenger of God, and whoever rejects you has pleased the Messenger of God. The Messenger of God has dried up, and whoever cuts you has cut off the Messenger of God, because you are a part of him and his soul that is between His sides, as he said, may God’s best peace and best prayers be upon him.\nI bear witness to God and His Messenger and His angels that I am satisfied with whom I am pleased with, displeased with whom You were angry with him, disavowing him whom you disavowed, loyal to whom you loyal to, hostile to whom you antagonized, hating whom you hated, loving whom you loved. And Allah suffices as a Witness, a Judge, a Judge, and a Refugee. Then say: O God, bless and grant peace upon Your servant and Messenger Muhammad bin Abdullah, the Seal of the Prophets and the best of all creation, and bless his successor Ali bin Abu Talib, the Commander of the Faithful, the Imam of the Muslims, and the best of guardians, and may your blessings be upon Fatima, the daughter of Muhammad, the mistress of the women of the worlds. And bless the two masters of the youth of the people of Paradise, Al-Hasan and Al-Hussein, and bless Zain Al-Abidin Ali bin Al-Hussein, and bless Muhammad bin Ali Baqir, the knowledge of the prophets, And bless the truthful one on the authority of God, Ja’far bin Muhammad, and bless the one who suppresses anger in God’s name, Musa bin Jafar, and bless Al-Rida Ali bin Musa, and bless the pious Muhammad bin Ali, and bless the pure Ali bin Muhammad, and bless the Pure One Al-Hasan bin Ali, and bless Al-Hasan. The city of Al-Qaim bin Al-Hassan bin Ali. \nO God, revive justice through it, annihilate injustice with it, beautify the earth with its remains, and demonstrate through it Your religion and the Sunnah of Your Prophet, so that nothing is hidden. It is right to fear any of the creation, and make us among his followers and followers and accepted into the group of his saints, O Lord of the Worlds. O God, bless Muhammad and his family from whom You have removed impurity and purified them with a thorough purification.",
            "DscrpA": "السَّلَامُ عَلَيْكِ يَا مُمْتَحَنَةُ، امْتَحَنَكِ اللَّهُ الَّذِي خَلَقَكِ قَبْلَ أَنْ يَخْلُقَكِ، فَوَجَدَكِ لِمَا امْتَحَنَكِ صَابِرَةً، وَ نَحْنُ لَكِ أَوْلِيَاءُ وَ مُصَدِّقُونَ وَ صَابِرُونَ لِكُلِّ مَا أَتَانَا بِهِ أَبُوكِ صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ وَ أَتَانَا بِهِ وَصِيُّهُ، فَإِنَّا نَسْأَلُكِ إِنْ  كُنَّا صَدَّقْنَاكِ إِلَّا أَلْحَقْتِنَا بِتَصْدِيقِنَا لَهُمَا، لِنُبَشِّرَ أَنْفُسَنَا أَنَّا قَدْ طَهُرْنَا بِوَلَايَتِكِ. \nثُمَّ تَقُولُ: \nالسَّلَامُ عَلَيْكِ يَا بِنْتَ رَسُولِ اللَّهِ، السَّلَامُ عَلَيْكِ يَا بِنْتَ نَبِيِّ اللَّهِ، السَّلَامُ عَلَيْكِ يَا بِنْتَ حَبِيبِ اللَّهِ، السَّلَامُ عَلَيْكِ يَا بِنْتَ صَفِيِّ اللَّهِ، السَّلَامُ عَلَيْكِ يَا بِنْتَ أَمِينِ اللَّهِ، السَّلَامُ عَلَيْكِ يَا بِنْتَ خَيْرِ خَلْقِ اللَّهِ، السَّلَامُ عَلَيْكِ يَا بِنْتَ أَفْضَلِ أَنْبِيَاءِ اللَّهِ وَ رُسُلِهِ وَ مَلَائِكَتِهِ.\nالسَّلَامُ عَلَيْكِ يَا بِنْتَ خَيْرِ الْبَرِيَّةِ، السَّلَامُ عَلَيْكِ يَا سَيِّدَةَ نِسَاءِ الْعَالَمِينَ مِنَ الْأَوَّلِينَ وَ الْآخِرِينَ، السَّلَامُ عَلَيْكِ يَا زَوْجَةَ وَلِيِّ اللَّهِ وَ خَيْرِ الْخَلْقِ بَعْدَ رَسُولِ اللَّهِ، السَّلَامُ عَلَيْكِ يَا أُمَّ الْحَسَنِ وَ الْحُسَيْنِ سَيِّدَيْ شَبَابِ أَهْلِ الْجَنَّةِ. \nالسَّلَامُ عَلَيْكِ أَيَّتُهَا الشَّهِيدَةُ الصِّدِّيقَةُ، السَّلَامُ عَلَيْكِ أَيَّتُهَا الرَّضِيَّةُ الْمَرْضِيَّةُ، السَّلَامُ عَلَيْكِ أَيَّتُهَا الْفَاضِلَةُ الزَّكِيَّةُ، السَّلَامُ عَلَيْكِ أَيَّتُهَا الْحُورِيَّةُ الْإِنْسِيَّةُ، السَّلَامُ عَلَيْكِ أَيَّتُهَا التَّقِيَّةُ النَّقِيَّةُ، السَّلَامُ عَلَيْكِ أَيَّتُهَا الْمُحَدَّثَةُ الْعَلِيمَةُ، السَّلَامُ عَلَيْكِ أَيَّتُهَا الْمُضْطَهَدَةُ الْمَقْهُورَةُ. \nالسَّلَامُ عَلَيْكِ يَا فَاطِمَةُ بِنْتَ رَسُولِ اللَّهِ، السَّلَامُ عَلَيْكِ أَيَّتُهَا الْمَغْصُوبَةُ الْمَظْلُومَةُ، السَّلَامُ عَلَيْكِ وَ عَلَى أَبِيكِ، السَّلَامُ عَلَيْكِ وَ عَلَى بَعْلِكِ وَ بَنِيكِ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ. \nصَلَّى اللَّهُ عَلَيْكِ وَ عَلَى رُوحِكِ وَ بَدَنِكِ، أَشْهَدُ أَنَّكِ مَضَيْتِ عَلَى بَيِّنَةٍ مِنْ رَبِّكِ، وَ أَنَّ مَنْ سَرَّكِ فَقَدْ سَرَّ رَسُولَ اللَّهِ، وَ مَنْ جَفَاكِ فَقَدْ جَفَا رَسُولَ اللَّهِ، وَ مَنْ قَطَعَكِ فَقَدْ قَطَعَ رَسُولَ اللَّهِ، لِأَنَّكِ بَضْعَةٌ مِنْهُ وَ رُوحُهُ الَّتِي بَيْنَ جَنْبَيْهِ، كَمَا قَالَ عَلَيْهِ أَفْضَلُ سَلَامِ اللَّهِ وَ أَفْضَلُ صَلَوَاتِهِ.\nأُشْهِدُ اللَّهَ وَ رَسُولَهُ وَ مَلَائِكَتَهُ أَنِّي رَاضٍ عَمَّنْ رَضِيتِ عَنْهُ، سَاخِطٌ عَمَّنْ سَخِطْتِ عَلَيْهِ، مُتَبَرِّئٌ مِمَّنْ تَبَرَّأْتِ مِنْهُ، مُوَالٍ لِمَنْ وَالَيْتِ، مُعَادٍ لِمَنْ عَادَيْتِ، مُبْغِضٌ لِمَنْ أَبْغَضْتِ، مُحِبٌّ لِمَنْ أَحْبَبْتِ، وَ كَفى  بِاللَّهِ شَهِيداً* حَسِيباً وَ جَازِياً وَ مُثِيباً. \nثُمَّ قُلِ: \nاللَّهُمَّ صَلِّ وَ سَلِّمْ عَلَى عَبْدِكَ وَ رَسُولِكَ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ خَاتَمِ النَّبِيِّينَ وَ خَيْرِ الْخَلْقِ أَجْمَعِينَ، وَ صَلِّ عَلَى وَصِيِّهِ عَلِيِّ بْنِ أَبِي طَالِبٍ أَمِيرِ الْمُؤْمِنِينَ وَ إِمَامِ الْمُسْلِمِينَ وَ خَيْرِ الْوَصِيِّينَ، وَ صَلِّ عَلَى فَاطِمَةَ بِنْتِ مُحَمَّدٍ سَيِّدَةِ نِسَاءِ الْعَالَمِينَ، وَ صَلِّ عَلَى سَيِّدَيْ شَبَابِ أَهْلِ الْجَنَّةِ الْحَسَنِ وَ الْحُسَيْنِ، وَ صَلِّ عَلَى زَيْنِ الْعَابِدِينَ عَلِيِّ بْنِ الْحُسَيْنِ، وَ صَلِّ عَلَى مُحَمَّدِ بْنِ عَلِيٍّ بَاقِرِ عِلْمِ النَّبِيِّينَ، وَ صَلِّ عَلَى الصَّادِقِ عَنِ اللَّهِ جَعْفَرِ بْنِ مُحَمَّدٍ، وَ صَلِّ عَلَى كَاظِمِ الْغَيْظِ فِي اللَّهِ مُوسَى بْنِ جَعْفَرٍ، وَ صَلِّ عَلَى الرِّضَا عَلِيِّ بْنِ مُوسَى، وَ صَلِّ عَلَى التَّقِيِّ مُحَمَّدِ بْنِ عَلِيٍّ، وَ صَلِّ عَلَى النَّقِيِّ عَلِيِّ بْنِ مُحَمَّدٍ، وَ صَلِّ عَلَى الزَّكِيِّ الْحَسَنِ بْنِ عَلِيٍّ، وَ صَلِّ عَلَى  الْحُجَّةِ الْقَائِمِ بْنِ الْحَسَنِ بْنِ عَلِيٍّ. \nاللَّهُمَّ أَحْيِ بِهِ الْعَدْلَ، وَ أَمِتْ بِهِ الْجَوْرَ، وَ زَيِّنْ بِبَقَائِهِ الْأَرْضَ، وَ أَظْهِرْ بِهِ دِينَكَ وَ سُنَّةَ نَبِيِّكَ، حَتَّى لَا يَسْتَخْفِيَ بِشَيْ  مِنَ الْحَقِّ مَخَافَةَ أَحَدٍ مِنَ الْخَلْقِ، وَ اجْعَلْنَا مِنْ أَشْيَاعِهِ وَ أَتْبَاعِهِ وَ الْمَقْبُولِينَ فِي زُمْرَةِ أَوْلِيَائِهِ يَا رَبَّ الْعَالَمِينَ، اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ أَهْلِ بَيْتِهِ الَّذِينَ أَذْهَبْتَ عَنْهُمُ الرِّجْسَ وَ طَهَّرْتَهُمْ تَطْهِيراً"
        },
        {
            "TitleA": "زِيارَة اَئمَّة البَقيع (عَلَيهِم السَّلام)",
            "DscrpA": "السَّلَامُ عَلَيْكُمْ أَئِمَّةَ الْهُدَىٰ، السَّلَامُ عَلَيْكُمْ أَهْلَ التَّقْوَىٰ، السَّلَامُ عَلَيْكُمْ أَيُّهَا الْحُجَجُ عَلَىٰ أَهْلِ الدُّنْيا، السَّلَامُ عَلَيْكُمْ أَيُّهَا الْقُوَّامُ فِي الْبَرِيَّةِ بِالْقِسْطِ، السَّلَامُ عَلَيْكُمْ أَهْلَ الصَّفْوَةِ، السَّلَامُ عَلَيْكُمْ آلَ رَسُولِ اللهِ، السَّلَامُ عَلَيْكُمْ أَهْلَ النَّجْوَىٰ، أَشْهَدُ أَنَّكُمْ قَدْ بَلَّغْتُمْ وَنَصَحْتُمْ وَصَبَرْتُمْ فِي ذَاتِ اللهِ، وَكُذِّبْتُمْ وَأُسيءَ إِلَيْكُمْ فَغَفَرْتُمْ، وَأَشْهَدُ أَنَّكُمُ الأَئِمَّةُ الرَّاشِدُونَ الْمُهْتَدُونَ، وَأَنَّ طَاعَتَكُمْ مَفْرُوضَةٌ، وَأَنَّ قَوْلَكُمُ الصِّدْقُ، وَأَنَّكُمْ دَعْوَتُمْ فَلَمْ تُجَابُوا، وَأَمَرْتُمْ فَلَمْ تُطَاعُوا، وَأَنَّكُمْ دَعَائِمُ الدِّينِ وَأَرْكَانُ الأَرْضِ، لَمْ تَزَالُوا بِعَيْنِ اللهِ يَنْسَخُكُمْ مِنْ أَصْلاَبِ كُلِّ مُطَهَّرٍ، وَيَنْقُلُكُمْ مِنْ أَرْحَامِ الْمُطَهَّرَاتِ، لَمْ تُدَنِّسْكُمُ الْجَاهِلِيَّةُ الْجَهْلَاءُ، وَلَمْ تَشْرَكْ فِيكُمْ فِتَنُ الأَهْوَاءِ، طِبْتُمْ وَطَابَ مَنْبَتُكُمْ، مَنَّ بِكُمْ عَلَيْنا دَيَّانُ الدِّينِ، فَجَعَلَكُمْ فِي بُيُوتٍ أَذِنَ اللهُ أَنْ تُرْفَعَ وَيُذْكَرَ فِيهَا اسْمُهُ، وَجَعَلَ صَلاَتَنَا عَلَيْكُمْ رَحْمَةً لَنَا وَكَفَّارَةً لِذُنُوبِنَا، إِذِ اخْتَارَكُمُ اللهُ لَنَا، وَطَيَّبَ خَلْقَنَا بِمَا مَنَّ عَلَيْنَا مِنْ وِلاَيَتِكُمْ، وَكُنَّا عِنْدَهُ مُسَمِّينَ بِعِلْمِكُمْ، مُعْتَرِفِينَ بِتَصْدِيقِنَا إِيَّاكُمْ، وَهٰذَا مَقَامُ مَنْ أَسْرَفَ وَأَخْطَأَ وَاسْتَكَانَ وَأَقَرَّ بِمَا جَنَىٰ وَرَجَا بِمَقَامِهِ الْخَلاَصَ، وَأَنْ يَسْتَنْقِذَهُ بِكُمْ مُسْتَنْقِذُ الْهَلْكَىٰ مِنَ الرَّدَىٰ، فَكُونُوا لِي شُفَعَاءَ، فَقَدْ وَفَدْتُ إِلَيْكُمْ إِذْ رَغِبَ عَنْكُمْ أَهْلُ الدُّنْيَا، وَاتَّخَذُوا آيَاتِ اللهِ هُزُواً وَاسْتَكْبَرُوا عَنْهَا. \n(ثم ارفعْ رأسك إلى السماء وقلْ: \nيَا مَنْ هُوَ قَائِمٌ لاَ يَسْهُو، وَدَائِمٌ لاَ يَلْهُو، وَمُحِيطٌ بِكُلِّ شَيْءٍ لَكَ الْمَنُّ بِمَا وَفَّقْتَنِي وَعَرَّفْتَنِي بِمَا أَقَمْتَنِي عَلَيْهِ، إِذْ صَدَّ عَنْهُ عِبَادُكَ، وَجَهِلُوا مَعْرِفَتَهُ، وَاسْتَخَفُّوا بِحَقِّهِ، وَمَالُوا إِلَىٰ سِوَاهُ، فَكَانَتِ الْمِنَّةُ مِنْكَ عَلَيَّ مَعَ أَقْوَامٍ خَصَصْتَهُمْ بِمَا خَصَصْتَنِي بِهِ، فَلَكَ الْحَمْدُ إِذْ كُنْتُ عِنْدَكَ فِي مَقَامِي هٰذَا مَذْكُوراً مَكْتُوباً، فَلاَ تَحْرِمْنِي مَا رَجَوْتُ، وَلاَ تُخَيِّبْنِي فِيمَا دَعَوْتُ، بِحُرْمَةِ مُحَمَّدٍ وَآلِهِ الطَّاهِرِينَ، وَصَلَّىٰ اللهُ عَلَىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ.",
            "TitleE": "Visiting the Imams of Al-Baqi' (peace be upon them)",
            "DscrpE": "Peace be upon you, imams of guidance, peace be upon you, people of piety, peace be upon you, you who stand as proofs over the people of the world, peace be upon you, O people of piety. Or in the wilderness with justice, peace be upon you, people of the elite, peace be upon you, the family of the Messenger of God, peace be upon you, people of the negotiations, I bear witness that you have You conveyed the message, advised, and were patient for the sake of God, and you lied and were wronged, and you were forgiven. I bear witness that you are the rightly guided Imams, and that your obedience Obligatory, and that your words are the truth, and that you were called and did not answer, and that you were commanded and you were not obeyed, and that you are the pillars of the religion and the pillars of the earth, you have not ceased to exist. May God remove you from the loins of every purifier. And He will take you from the wombs of purification. The ignorant people of ignorance did not desecrate you, and the temptations of desires did not associate with you. May you be blessed and may your home be blessed. May the Judge of religion be upon you, and He placed you in houses that God has permitted to be exalted and for His name to be mentioned in them, and He made our prayers upon you a mercy for us and an atonement for our sins, since May God leave you to us And He made us good because of what He bestowed upon us of your guardianship, and we were before Him in honor of your knowledge, acknowledging our belief in you. This is the position of one who is extravagant and He sinned and was content and acknowledged what he had committed and hoped for salvation in his place, and that the One who rescues the perishing from calamity will rescue him through you, so be my intercessors. I have come to you when the people of world, and they took the signs of God in jest and were arrogant in regard to them. \n(Then raise your head to the sky and say: \nO He who stands and does not neglect, and is ever-present and does not distract, and encompasses all things. To You is manna for what You have given me success and made known to me according to what You have appointed me to. When your servants turned away from it, were ignorant of its knowledge, belittled its truth, and inclined towards other than it, it was Your kindness has bestowed upon me with a people whom you have designated for what you have designated for me. Praise be to you, since I am with you in this position of mine, mentioned in writing, so do not deprive me. I did not hope for, and do not disappoint me in what I called for, in the honor of Muhammad and his pure family, and may God’s blessings be upon Muhammad and his family."
        },
        {
            "TitleA": "زيارة العباس (عليه السلام)",
            "TitleE": "The visit of Abbas (peace be upon him)",
            "DscrpE": "The peace of God and the peace of His close angels and His messenger prophets, and His righteous servants and all the martyrs and truthful ones, and the pure and good women in what they have lunch and Coming to you, O son of the Commander of the Faithful, I bear witness to you in peace, sincerity, loyalty, and sincere advice, to the successor of the Prophet (may God’s prayers and peace be upon him and his family), the Messenger, and the descendants of It is obligatory, and the evidence is The scientist, the righteous, the righteous, and the shadow of the shadow, may God reward you for his Messenger, and from the Commander of the believers, and from the authority of Fatimah, and the authority of God, and the authority of God, and the authority of God, Permanent, as you have been patient, and you have been caught, so we would preach the abode of the house. Between you and the water of the Euphrates, I bear witness that you were killed unjustly, and that God will fulfill what He promised you. I have come to you, son of the Commander of the Faithful, as a delegate to you. And my heart is submitted to you and I follow you, and I am your follower, and my support is prepared for you, until God judges, and He is the best of judges, so He is with you, with you, not with your enemy. I am by you and by your return among the believers, and by those of the disbelievers who opposed you and killed you. God has killed a nation that killed you with hands and tongues. Then enter and lean on the grave and say: Peace be upon you, O righteous servant, obedient to God and His Messenger and to the Commander of the Faithful and Al-Hasan and Al-Hussein (may God bless them and grant them peace). Peace be upon you. May God’s mercy, blessings, forgiveness, and satisfaction be upon your soul and body. I bear witness, and I bear God’s witness, that you have followed what the Badrians and Mujahideen did. In the cause of God, those who advise him in the struggle against his enemies, those who go to extremes in supporting his friends, and those who defend him for his loved ones, may God reward you with the best reward, and increase the reward. And reward more, and fulfill the reward of anyone who fulfilled his pledge of allegiance, responded to his call, and obeyed his rulers. I bear witness that you have exaggerated in your advice. And you gave the utmost effort, so God sent you among the martyrs, and placed your soul with the souls of the happy, and gave you from His gardens the spaciousest of homes and the best rooms, and raised that He saw you in the two highest places, and gathered you with the prophets, the truthful ones, the martyrs, and the righteous, and those were good companions. I bear witness that you have not weakened or become weary, and that you have continued on. Insight from I command you to imitate the righteous and follow the prophets, so God has brought us together and between you and His Messenger and his friends in the homes of the hidden, for He is the Most Merciful of those who show mercy. Then go to the honorable head and pray two rak'ahs and say this supplication: O God, bless Muhammad and the family of Muhammad, and do not leave for me any sin in this honorable place and venerable scene without forgiving it, and do not forgive me. There is no illness but I relieve it, no illness but I heal it, no blemish but I cover it, no sustenance but I You have extended it, there is no fear except that you have secured it, there is no gathering except that you have gathered it, there is no absence except that you have guarded it and brought it close to it, there is no need of the needs of this world and the hereafter in which you will be satisfied. And there is no good in it unless You fulfill it, O Most Merciful of the Merciful. Then return to the side of the two men and say: Peace be upon you, O Abu al-Fadl al-Abbas, son of the Commander of the Faithful. Peace be upon you, son of the Master of Guardians. Peace be upon you, son of the first of the people. I bear witness that I have been sincere to God, to His Messenger, and to your brother. What a good brother to console. So God cursed the nation that killed you, and God cursed the nation that wronged you, and God cursed the nation that made forbidden things permissible from you, and violated the sanctity of Islam, so how excellent is the patient, Mujahid, advocate, and advocate. The brother who defends his brother, who responds to obedience to his Lord, who desires what others abstained from in terms of great reward and beautiful praise, and he bestows upon you God is in the same position as your forefathers in the gardens of bliss. Oh God, I have been subjected to the visitation of your saints out of a desire for your reward, and a hope for your forgiveness and the abundance of your benevolence, so I ask That you may bless Muhammad and his pure family, that you may make my sustenance a home through them, that I may live by them with comfort, that my visits with them be acceptable, and that my life with them be good, and include me in List the honorees, and make me Of those who turn from visiting the sights of your loved ones prosperous and prosperous, you have required the forgiveness of sins, the covering of faults, and the removal of distress. Indeed, you are the people of piety and oh Forgiveness",
            "DscrpA": "سَلامُ اللهِ وَسَلامُ مَلائِكَتِهِ الْمُقَرَّبِينَ وَأَنْبِيائِهِ الْمُرْسَلِينَ، وَعِبادِهِ الصّالِحِينَ وَجَمِيعِ الشُّهَداءِ وَالصِّدِّيقِينَ، وَالزَّاكِياتُ الطَّيِّباتُ فِيـَما تَغْتَدِي وَتَرُوحُ عَلَيْكَ يَابْنَ أَمِيرِ الْمُؤْمِنِينَ، أَشْهَدُ لَكَ بِالتَّسْلِيمِ وَالتَّصْدِيقِ وَالْوَفاءِ وَالنَّصِيحَةِ، لِخَلَفِ النَّبِيِّ(صَلَّى اللهُ عَلَيْهِ وَآلِهِ) الْمُرْسَلِ، وَالسِّبْطِ الْمُنْتَجَبِ، وَالدَّليلِ الْعالِمِ، وَالْوَصِيِّ الْمُبَلِّغِ، وَالْمَظْلُومِ الْمُهْتَضَمِ، فَجَزاكَ اللهُ عَنْ رَسُولِهِ وَعَنْ أَمِيرِ الْمُؤْمِنينَ وَعَنْ فاطمةَ والْحَسَنِ وَالْحُسَيْنِ(صَلَواتُ اللهِ عَلَيْهِمْ) أَفْضَلَ الْجَزاءِ، بِما صَبَرْتَ وَاحْتَسَبْتَ وَأَعَنْتَ فَنِعْمَ عُقْبَى الدّارِ، لَعَنَ اللهُ مَنْ قَتَلَكَ وَلَعَنَ اللهُ مَنْ جَهِلَ حَقَّكَ وَاسْتَخَفَّ بِحُرْمَتِكَ، وَلَعَنَ اللهُ مَنْ حَالَ بَيْنَكَ وَبَيْنَ مَاءِ الْفُراتِ، أَشْهَدُ أَنَّكَ قُتِلْتَ مَظْلُوماً، وَأَنَّ اللهَ مُنْجِزٌ لَكُمْ مَا وَعَدَكُمْ، جِئْتُكَ يَابْنَ أَمِيرِ اْلُمْؤْمِنينَ وَافِداً اِلَيْكُمْ، وَقَلْبِي مُسَلِّمٌ لَكُمْ وَتابِعٌ، وَأَنَا لَكُمْ تابِـعٌ وَنُصْرَتِي لَكُمْ مُعَدَّةٌ، حَتّى يَحْكُمَ اللهُ وَهُوَ خَيْرُ الْحاكِمِينَ، فَمَعَكُمْ مَعَكُمْ لا مَعَ عَدُوِّكُمْ، إِنّي بِكُمْ وَبِإيابِكُمْ مِنَ الْمُؤْمِنينَ، وَبِمَنْ خالَفَكُمْ وَقَتَلَكُمْ مِنَ الْكافَرينَ، قَتَلَ اللهُ أُمَّةً قَتَلَتْكُمْ بِالأَيْدِي وَالأَلْسُنِ. \nثمّ ادخل فانكبّ على القبر وقلْ: اَلسَّلامُ عَلَيْكَ أَيُّهَا الْعَبْدُ الصّالِحُ الْمُطِيعُ للهِ وَلِرَسُولِهِ وَلِأَميرِ الْمُؤْمِنينَ وَالْحَسَنِ والْحُسَيْنِ(صَلَّى اللهُ عَلَيْهِمْ وَسَلَّمَ)، اَلسَّلامُ عَلَيْكَ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، وَمَغْفِرَتُهُ وَرِضْوانُهُ وَعَلَى رُوحِكَ وَبَدَنِكَ، أَشْهَدُ وأُشْهِدُ اللهَ أَنَّكَ مَضَيْتَ عَلَى مَا مَضَى بِهِ الْبَدْرِيُّونَ وَالْمُجَاهِدُونَ فِي سَبيلِ اللهِ الْمُناصِحُونَ لَهُ فِي جِهادِ أَعْدائِهِ، الْمُبالِغُونَ فِي نُصْرَةِ أَوْلِيائِهِ، الذّابُّونَ عَنْ أَحِبّائِهِ، فَجَزاكَ اللهُ أَفْضَلَ الْجَزاءِ، وَأَكْثَرَ الْجَزاءِ، وَأَوْفَرَ الْجَزاءِ، وَأَوْفَى جَزاءِ أَحَدٍ مِمَّنْ وَفَى بِبَيْعَتِهِ، وَاسْتَجابَ لَهُ دَعْوَتَهُ، وَأَطاعَ وُلاةَ أَمْرِهِ، أَشْهَدُ أَنَّكَ قَدْ بالَغْتَ فِي النَّصِيحَةِ وَأَعْطَيْتَ غايَةَ المَجْهُودِ، فَبَعَثَكَ اللهُ فِي الشُّهَداءِ، وَجَعَلَ رُوحَكَ مَعَ أَرْواحِ السُّعَداءِ، وَأَعْطاكَ مِنْ جِنانِهِ أَفْسَحَها مَنْزِلاً وَأَفْضَلَها غُرَفاً، وَرَفَعَ ذِكْرَكَ فِي عِلِّيِّينَ، وَحَشَرَكَ مَعَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَداءِ وَالصّالِحِينَ وَحَسُنَ أُولئِكَ رَفيقاً، أَشْهَدُ أَنَّكَ لَمْ تَهِنْ وَلَمْ تَنْكُلْ، وَأَنَّكَ مَضَيْتَ عَلَى بَصِيرَةٍ مِنْ أَمْرِكَ مُقْتَدِياً بِالصّالِحِينَ، وَمُتَّبِعاً لِلنَّبِيّينَ، فَجَمَعَ اللهُ بَيْنَنا وَبَيْنَكَ وَبَيْنَ رَسُولِهِ وَأَوْلِيائِهِ فِي مَنازِلِ الْمُخْبِتِينَ، فَإِنَّهُ أَرْحَمُ الرّاحِمِينَ. \nثمّ صرْ الى الرأس الشريف وصلّ ركعتين وادعُ بهذا الدعاء: اَللّـهُمَّ صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ، وَلا تَدَعْ لي فِي هذَا الْمَكانِ الْمُكَرَّمِ وَالْمَشْهَدِ الْمُعَظَّمِ ذَنْباً إِلَّا غَفَرْتَهُ، وَلا هَمّاً إِلَّا فَرَّجَتَهُ، وَلا مَرَضاً إِلَّا شَفَيْتَهُ، وَلا عَيْباً إِلَّا سَتَرْتَهُ، وَلا رِزْقاً إِلَّا بَسَطْتَهُ، وَلا خَوْفاً إِلَّا آمَنْتَهُ، وَلا شَمْلاً إِلَّا جَمَعْتَهُ، وَلا غائِباً إِلَّا حَفِظْتَهُ وَأَدْنَيْتَهُ، وَلا حَاجَةً مِنْ حَوائِجِ الدُّنْيا وَالْآخِرَةِ لَكَ فيها رِضَىً وَلِيَ فِيهَا صَلاحٌ إِلَّا قَضَيْتَها يا أَرْحَمَ الرّاحِمِينَ. \nثمّ عدْ الى جهة الرّجلَيْن وقلْ: اَلسَّلامُ عَلَيْكَ يا أَبَا الْفَضْلِ الْعَبّاسَ ابْنَ أَميرِ الْمُؤْمِنينَ، اَلسَّلامُ عَلَيْكَ يَابْنَ سَيِّدِ الْوَصِيِّينَ، اَلسَّلامُ عَلَيْكَ يَابْنَ أَوَّلِ الْقَوْمِ إِسْلاماً، وَأَقْدَمِهِمْ إِيْمَاناً وَأَقْوَمِهِمْ بِدينِ اللهِ، وَأَحْوَطِهِمْ عَلَى الإِسْلامِ، أَشْهَدُ لَقَدْ نَصَحْتَ للهِ وَلِرَسُولِهِ وَلِأَخيكَ فَنِعْمَ الأَخُ الْمُواسي، فَلَعَنَ اللهُ أُمَّةً قَتَلَتْكَ، وَلَعَنَ اللهُ أُمَّةً ظَلَمَتْكَ، وَلَعَنَ اللهُ أُمَّةً اسْتَحَلَّتْ مِنْكَ الْمَحارِمَ، وَانْتَهَكَتْ حُرْمَةَ الإِسْلامِ، فَنِعْمَ الصّابِرُ الْمُجاهِدُ الْمُحامِي النّاصِرُ، وَالأَخُ الدّافِعُ عَنْ أَخيهِ، الْمُجيبُ اِلى طَاعَةِ رَبِّهِ، الرّاغِبُ فيـما زَهِدَ فيهِ غَيْرُهُ مِنَ الثَّوابِ الْجَزيلِ وَالثَّناءِ الْجَميلِ، وَأَلْحَقَكَ اللهُ بِدَرَجَةِ آبائِكَ فِي جَنّاتِ النَّعيمِ، اَللّـهُمَّ إِنّي تَعَرَّضْتُ لِزِيارَةِ أَوْلِيائِكَ رَغْبَةً فِي ثَوابِكَ، وَرَجَاءً لِمَغْفِرَتِكَ وَجَزيلِ إِحْسانِكَ، فَأَسْأَلُكَ أَنْ تُصَلِّيَ عَلى مُحَمَّدٍ وَآلِهِ الطّاهِرينَ، وَأَنْ تَجْعَلَ رِزْقِي بِهِمْ دارّاً وَعَيْشِي بِهِمْ قارّاً، وَزِيارَتِي بِهِمْ مَقْبُولَةً وَحَياتِي بِهِمْ طَيِّبَةً، وَأَدْرِجْنِي إِدْراجَ الْمُكْرَمِينَ، وَاجْعَلْني مِمَّنْ يَنْقَلِبُ مِنْ زِيارَةِ مَشاهِدِ أَحِبّائِكَ مُفْلِحاً مُنْجِحاً، قَدِ اسْتَوْجَبَ غُفْرانَ الذُّنُوبِ وَسَتْرَ الْعُيُوبِ وَكَشْفَ الْكُرُوبِ، إِنَّكَ أَهْلُ التَّقْوى وَأَهْلُ الْمَغْفِرَةِ."
        },
        {
            "TitleA": "زيارة الإمام الحسين (عليه السلام)",
            "TitleE": "The Visit of Imam Hussein (peace be upon him)",
            "DscrpE": "Peace be upon you, O heir of Adam, God's chosen one. Peace be upon you, O heir of Noah, God's Prophet. Peace be upon you, O heir of Abraham, God's friend. Peace be upon you, O heir of Moses, God's Word. Peace be upon you, O inheritor of Jesus, the Spirit of God. Peace be upon you, O inheritor of Muhammad. Beloved of God, peace be upon you, O heir of the Commander of the Faithful and guardian of God, peace be upon you, son of Muhammad the Chosen One, peace be upon you, son of Ali the Most Merciful, peace be upon you, son of Fatima Al-Zahra, peace be upon you, O Son of Khadija the Great, peace be upon you, O revolt of God and son of His retaliation and the moving string. I bear witness that you have established prayer, and you paid zakat, and you enjoined what was right and forbade what was wrong, and you obeyed God and His Messenger until certainty came to you, so God cursed a nation that killed you, and God cursed a nation that wronged you, and God cursed the mother of I heard that and accepted it. O my master, O Abu Abdullah, I bear witness that you were a light in the lofty loins and the purified wombs that did not defile you. The pre-Islamic era, with its impurities, did not clothe you with any of its decorative garments, and I bear witness that you are one of the pillars of the religion and the pillars of the believers, and I bear witness that you are the righteous, pious, righteous Imam. I bear witness that the Imams from your progeny are the word of piety, the signs of guidance, the surest handhold, and the proof over the people of the world. I bear witness to God, His angels, and His prophets. And His Messengers. Indeed, I am a believer in you With your return, I am certain of the laws of my religion and the conclusions of my deeds, and my heart is for your heart’s peace, and my command for your command is followed. May the blessings of God be upon you, and upon your souls, and upon your bodies, and upon my body. Your mother, and upon your witness, and upon your absent, and upon your visible, and upon your hidden. May my father and mother be sacrificed for you, O son of the Messenger of God. May my father be sacrificed for you and my mother, O Abu Abdullah. The calamity has become great and the calamity has befallen you upon us and upon all the people of Syria. dead and the earth. May God curse a nation that saddled and bridled and prepared to fight you. O my master, O Abu Abdullah, I went to your sanctuary and came to your scene. I ask God. By the matter that you have with Him and the position that you have with Him, that He may bless Muhammad and the family of Muhammad, and that He may place me with you in this world and the hereafter. Then arise and go to the feet of the grave and stand at the head of Ali. Bin Al-Hussein (peace be upon him) and say: Peace be upon you, son of the Messenger of God. Peace be upon you, son of the Prophet of God. Peace be upon you, son of the Commander of the Faithful. Peace be upon you, son of Hussein, the martyr. Peace be upon you, martyr. Peace be upon you, O oppressed and son of oppressors. Blame, may God curse the nation that killed you, may God curse the nation that wronged you, and may God curse the nation that heard that and accepted it. Then lie down on the grave and say: Peace be upon you, O guardian of God and son of His guardian. The calamity is great and the calamity you have suffered is great upon us and upon all Muslims. May God curse the nation that killed you, and I turn to God. And here are some of them.\nThen turn to the martyrs and say:\nPeace be upon you, O saints and beloved of God, peace be upon you. O pure and loyal people of God, peace be upon you, O supporters of God’s religion, peace be upon you, O supporters of the Messenger of God, peace be upon you, O supporters of the Commander of the Faithful, peace be upon you, O supporters of Fatim Lady of the women of the worlds, peace be upon you, O supporters of Abu Muhammad al-Hasan bin Ali, the guardian and adviser, peace be upon you, O Supporters of Abu Abdullah, may my father and mother be sacrificed for you. You were happy and the land in which you were buried was happy and you won a great victory. I wish I were with you so I could win. “Akkum.",
            "DscrpA": "اَلسّلامُ عَلَيكَ يا وارِثَ آدَمَ صَفوَةِ اللهِ، السّلامُ عَلَيكَ يَا وَارِثَ نُوحٍ نَبِيِّ اللهِ، السّلامُ عَلَيكَ يَا وَارِثَ إِبرَاهِيمَ خَلِيلِ اللهِ، السّلامُ عَلَيكَ يَا وَارِثَ مُوسَى كَلِيمِ اللهِ، السّلامُ عَلَيكَ يَا وَارِثَ عِيسَى رُوحِ اللهِ، السّلامُ عَلَيكَ يَا وَارِثَ مُحَمَّدٍ حَبِيبِ اللهِ، السّلامُ عَلَيكَ يَا وَارِثَ أَمِيرِ المُؤمِنِينَ وَلِيِّ اللهِ، السّلامُ عَلَيكَ يَابنَ مُحمَّدٍ المُصْطَفَى، السّلامُ عَلَيكَ يَابنَ عَليٍّ المُرْتَضَى، السّلامُ عَليكَ يَابنَ فاطِمَةَ الزَّهراء، السّلامُ عَلَيكَ يَابنَ خَدِيجَةَ الكُبْرَى، السَّلامُ عَلَيكَ يَا ثَارَ اللهِ وَابنَ ثَأْرِهِ وَالوِتْرَ المُوتُورَ، أَشهَدُ أَنَّكَ قَد أَقَمْتَ الصَّلاةَ وَآتَيْتَ الزَّكَاةَ، وَأمَرْتَ بِالمَعرُوفِ وَنَهَيْتَ عَنِ المُنكَرِ، وَأَطَعْتَ اللهَ وَرسُولَهُ حَتَّى أَتَاكَ اليَقِينُ، فَلَعَنَ اللهُ أُمَّةً قَتَلَتْكَ وَلَعَنَ اللهُ أُمَّةً ظَلَمَتْكَ، وَلعنَ اللهُ أُمَّةً سَمِعَتِ بِذَلِكَ فَرَضِيَتْ بِهِ، يَا مَولايَ يَا أَبَا عَبدِاللهِ أَشْهَدُ أَنَّكَ كُنْتَ نُوراً فِي الأَصْلابِ الشَّامِخَةِ وَالأَرْحَامِ المُطَهَّرَةِ لَمْ تُنَجّسْكَ الجَاهِلِيَّةُ بِأَنْجَاسِهَا وَلَمْ تُلْبِسْكَ مِن مُدْلَهِمَّاتِ ثِيَابِهَا، وَأَشهَدُ أَنَّكَ مِن دَعَائِمِ الدِّينِ وَأَركَانِ المُؤمِنِينَ، وَأَشهَدُ أَنَّكَ الإِمَامُ البَرُّ التَّقِيُّ الرَّضِيُّ الزَّكِيُّ الهادِيُ المَهدِيُّ، وَأَشهَدُ أنَّ الأَئِمَّةَ مِن وُلْدِكَ كَلِمَةُ التَّقوَى وَأَعلامُ الهدَى وَالعُروَةُ الوُثقَى وَالحُجَّةُ عَلَى أَهلِ الدُّنيَا، وَأُشهِدُ اللهَ وَمَلائِكَتَهُ وأَنبِيَاءَهُ وَرُسُلَهُ أَنِّي بِكُم مُؤمِنٌ وَبِإِيَابِكُمْ مُوْقِنٌ بِشَرَائِعِ دِينِي وَخواتِيمِ عَمَلِي وَقَلْبِي لِقَلبِكُم سِلْمٌ وَأَمرِي لأَمرِكُم مُتَّبِعٌ، صَلَواتُ اللهِ عَلَيكُم وَعَلَى أَرْوَاحِكُم وَعَلَى أَجْسَادِكُم وَعَلَى أَجسَامِكُم، وَعَلَى شَاهِدكُم وَعَلَى غائِبِكُم وَعَلَى ظَاهِرِكُم وَعَلَى بَاطِنِكُم. \nبِأَبِي أَنْتَ وَأُمِّي يَابْنَ رَسُولِ اللهِ، بِأَبِي أَنْتَ وَأُمِّي يا أَبا عَبْدِاللهِ، لَقَدْ عَظُمَتِ الرَّزِيَّةُ وَجَلَّتِ الْمُصيبَةُ بِكَ عَلَيْنا وَعَلى جَميعِ أَهْلِ السَّمَاواتِ والْأَرْضِ، فَلَعَنَ اللهُ أُمَّةً أَسْرَجَتْ وَأَلْجَمَتْ وَتَهَيَّأَتْ لِقِتالِكَ، يا مَوْلايَ يا أَبا عَبْدِاللهِ قَصَدْتُ حَرَمَكَ، وَأَتَيْتُ اِلى مَشْهَدِكَ، أَسْألُ اللهَ بِالشَّأنِ الَّذي لَكَ عِنْدَهُ وبالمَحَلِّ الَّذِي لَكَ لَدَيْهِ، أَنْ يُصَلِّيَ عَلى مُحَمَّدٍ وَآلِ مُحَمَّد، وَأَنْ يَجْعَلَنِي مَعَكُمْ فِي الدُّنْيا وَالْآخِرَةِ.\nثمّ قم وصرْ إلى عند رجلَيْ القبر وقفْ عند رأس عليّ بن الحسين(عليه السلام) وقلْ:\nالسَّلامُ عَلَيْكَ يابْنَ رَسُولِ اللهِ، السَّلامُ عَلَيْكَ يابْنَ نَبِيِّ اللهِ، السَّلامُ عَلَيْكَ يابْنَ أَمِيرِ المُؤْمِنِينَ، السَّلامُ عَلَيْكَ يابْنَ الحُسَيْنِ الشَّهِيدِ، السَّلامُ عَلَيْكَ أَيُّها الشَّهِيدُ، السَّلامُ عَلَيْكَ أَيُّها المَظْلُومُ وَابْنُ المَظْلُومُ، لَعَنَ اللهُ أُمَّةً قَتَلَتْكَ وَلَعَنَ اللهُ أُمَّةً ظَلَمَتْكَ وَلَعَنَ اللهُ أُمَّةً سَمِعَتْ بِذلِكَ فَرَضِيَتْ بِهِ. ثم انكب على القبر وقل: السَّلامُ عَلَيْكَ يا وَلِيَّ اللهِ وَابْنَ وَلِيِّهِ لَقَدْ عَظُمَتِ المُصِيبَةُ وَجَلَّتِ الرَّزِيَّةُ بِكَ عَلَيْنا وَعَلى جَمِيعِ المُسْلِمِينَ فَلَعَنَ اللهُ أُمَّةً قَتَلَتْكَ وَأَبْرَاُ إِلى اللهِ وَإِلَيْكَ مِنْهُمْ.\nثمّ توجّه إلى الشهداء وقلْ:\nالسَّلامُ عَلَيْكُمْ يا أَوْلِياءَ اللهِ وَأَحِبّاءَهُ، السَّلامُ عَلَيْكُمْ يا أَصْفِياءَ اللهِ وَأَوِدَّاءَهُ، السَّلامُ عَلَيْكُمْ يا أَنْصارَ دِينِ اللهِ، السَّلامُ عَلَيْكُمْ يا أَنْصارَ رَسُولِ اللهِ، السَّلامُ عَلَيْكُمْ يا أَنْصارَ أَمِيرِ المُؤْمِنِينَ، السَّلامُ عَلَيْكُمْ يا أَنْصارَ فاطِمَةَ سَيِّدَةِ نِساءِ العالَمِينَ، السَّلامُ عَلَيْكُمْ يا أَنْصارَ أَبِي مُحَمَّدٍ الحَسَنِ بْنِ عَلِيٍّ الوَلِيِّ النَّاصِحِ، السَّلامُ عَلَيْكُمْ يا أَنْصارَ أَبِي عَبْدِاللهِ، بِأَبِي أَنْتُمْ وَأُمِّي طِبْتُمْ وَطابَتِ الأَرْضُ الَّتِي فِيها دُفِنْتُمْ وَفُزْتُمْ فَوْزاً عَظِيماً، فَيا لَيْتَنِي كُنْتُ مَعَكُمْ فَأَفُوزَ مَعَكُمْ."
        },
        {
            "TitleA": "زيارة الإمام موسى بن جعفر (عليه السلام)",
            "TitleE": "The visit of Imam Musa bin Jaafar (peace be upon him)",
            "DscrpE": "O God, bless Muhammad and his family, and bless Musa bin Jafar, the guardian of the righteous, the imam of the good, the guardian of lights, and the inheritor of tranquility, dignity, and wisdom. And Al-Athar, who used to liven up the night by staying up until dawn by continuing to ask for forgiveness, an ally of long prostrations, abundant tears, and much supplication. And the continuous struggles, and the abode of prohibition, justice, and goodness, and bounty, and dew, and sustenance, and the acquaintance of calamity and patience, and the persecuted by injustice, and the grave of injustice, and The one who was tormented in the depths of prisons and the oppression of the dungeons, the one whose leg was bruised by the shackles, and the funeral was called for with humiliation of disdain, and the one who mentioned his chosen grandfather and his chosen father, and His mother, Fatima, is the master of women, with usurped inheritance and loyalty. A plundered thing, a conquered matter, blood sought, and drunken poison. O God, just as he was patient in the face of severe adversity, swallowed the thorn of anguish, surrendered to Your satisfaction, and was sincere in his obedience. He was devoted to You and had pure humility, felt submission, and was hostile to heresy and its people, and did not attach to him the blame of a critic in any of Your commands and prohibitions. Send upon him a growing, noble, and pure blessing, by which you will entitle him to the intercession of nations of your creation and generations of your righteousness, and convey to him a greeting and peace from us, and grant us from you in being loyal to him abundantly. No, and goodness, forgiveness, and satisfaction. Indeed, You are the Possessor of great bounty and great transcendence through Your mercy, O Most Merciful of the Merciful.",
            "DscrpA": "اللّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَأَهْلِ بَيْتِهِ، وَصَلِّ عَلى مُوسَى بْنِ جَعْفَرٍ وَصِيِّ الأبْرارِ، وَإِمامِ الأَخْيارِ، وَعَيْبَةِ الأنْوارِ، وَوَارِثِ السَّكِينَةِ وَالوَقارِ وَالحِكَمِ وَالآثَارِ، الَّذِي كانَ يُحْيِي اللَيْلَ بِالسَّهَرِ إِلى السَّحَرِ بِمُواصَلَةِ الاسْتِغْفارِ، حَلِيفِ السَّجْدَةِ الطَّوِيلَةِ وَالدُّمُوعِ الغَزِيرَةِ، وَالمُناجَاةِ الكَثِيرَةِ والضَّراعاتِ المُتَّصِلَةِ، وَمَقَرِّ النُّهَى وَالعَدْلِ وَالخَيْرِ، وَالفَضْلِ وَالنَّدى وَالبَذْلِ وَمَأْلَفِ البَلْوى وَالصَبْرِ، وَالمُضْطَهَدِ بِالظُّلْمِ وَالمَقْبُورِ بِالجَوْرِ، وَالمُعَذَّبِ فِي قَعْرِ السُّجُونِ وَظُلَمِ المَطَامِيرِ ذِي السَّاقِ المَرْضُوضِ بِحَلَقِ القُيُودِ وَالجَنازَةِ المُنادى عَلَيها بِذُلِّ الاِسْتِخْفافِ، وَالوارِدِ عَلى جَدِّهِ المُصْطَفى وَأَبِيهِ المُرْتَضى وَأُمِّهِ فاطَمَةَ سَيِّدَةِ النِّساءِ بِإِرْثٍ مَغْصُوبٍ وَوَلاءٍ مَسْلُوبٍ وَأَمْرٍ مَغْلُوبٍ وَدَمٍ مَطْلُوبٍ وَسَمٍّ مَشْرُوبٍ. اللّهُمَّ وَكَما صَبَرَ عَلى غَلِيظِ المِحَنِ وَتَجَرَّعَ غُصَصَ الكُرَبِ وَاسْتَسْلَمَ لِرِضاكَ وَأَخْلَصَ الطَّاعَةَ لَكَ وَمَحَضَ الخُشُوعَ وَاسْتَشْعَرَ الخُضُوعَ وَعَادَى البِدْعَةَ وَأَهْلَها وَلَمْ يَلْحَقْهُ فِي شيْءٍ مِنْ أَوامِرِكَ وَنَواهِيكَ لَوْمَةُ لائِمٍ؛ صَلِّ عَلَيْهِ صَلاةً نامِيَةً مُنِيفَةً زاكِيَةً تُوجِبُ لَهُ بِها شَفاعَةَ أُمَمٍ مِنْ خَلْقِكَ وَقُرُونٍ مِنْ بَراياكَ وَبَلِّغْهُ عَنّا تَحِيَّةً وَسَلاماً، وَآتِنا مِنْ لَدُنْكَ فِي مُوالاتِهِ فَضْلاً وَإحْساناً وَمَغْفِرَةً وَرِضْواناً إِنَّكَ ذُو الفَضْلِ العَمِيمِ وَالتَّجاوُزِ العَظِيمِ بِرَحْمَتِكَ يا أَرْحَمَ الرَّاحِمِينَ.."
        },
        {
            "TitleA": "زيارة الإمام محمد الجواد (عليه السلام)",
            "TitleE": "The visit of Imam Muhammad al-Jawad (peace be upon him)",
            "DscrpE": "Peace be upon you, O Guardian of God. Peace be upon you, O Proof of God. Peace be upon you, O Light of God in the darkness of the earth. Peace be upon you, son of the Messenger of God. Peace be upon you and your fathers. Peace be upon you. And upon your children, peace be upon you and upon your guardians, I bear witness that you have You performed prayer and paid zakat, you enjoined what is right and forbade what is wrong, you recited the Scripture as it should be recited, you struggled in God as He should be striving, and you were patient in the face of harm. At his side until certainty came to you, I came to you as a visitor, knowing your rights, loyal to your friends and hostile to your enemies, so intercede for me with your Lord.",
            "DscrpA": "السَّلامُ عَلَيْكَ يا وَلِيَّ اللهِ، السَّلامُ عَلَيْكَ يا حُجَّةَ اللهِ، السَّلامُ عَلَيْكَ يا نُورَ اللهِ فِي ظُلُماتِ الأَرْضِ، السَّلامُ عَلَيْكَ يَابْنَ رَسُولِ اللهِ، السَّلامُ عَلَيْكَ وَعَلى آبائِكَ، السَّلامُ عَلَيْكَ وَعَلى أَبْنائِكَ، السَّلامُ عَلَيْكَ وَعَلى أوْلِيائِكَ، أشْهَدُ أَنَّكَ قَدْ أَقَمْتَ الصَّلاةَ وَآتَيْتَ الزّكاةَ، وَأَمَرْتَ بِالْمَعْرُوفِ وَنَهَيْتَ عَنِ الْمُنْكَرِ، وَتَلَوْتَ الْكِتابَ حَقَّ تِلاوَتِهِ، وَجاهَدْتَ فِي اللهِ حَقَّ جِهَادِهِ، وَصَبَرْتَ عَلَى الأَذَى فِي جَنْبِهِ حَتّى أَتَاكَ الْيَقِينُ، أَتَيْتُكَ زَائِراً عَارِفاً بِحَقِّكَ مُوالِياً لِأَوْلِيائِكَ مُعادِياً لِأَعْدائِكَ فَاشْفَعْ لِي عِنْدَ رَبِّكَ."
        },
        {
            "TitleA": "زيارة الإمام الرضا (عليه السلام)",
            "TitleE": "The Visit of Imam Reza (peace be upon him)",
            "DscrpE": "Peace be upon you, O Guardian of God. Peace be upon you, O Proof of God. Peace be upon you, O Light of God in the darkness of the earth. Peace be upon you, O pillar of religion. Peace be upon you. O heir of Adam, God’s elite, peace be upon you, O heir of Noah, God’s prophet, peace be upon you. O heir of Abraham, God’s friend, peace be upon you, O heir of Ishmael, the sacrifice of God. Peace be upon you, O heir of Moses, the Word of God. Peace be upon you, O heir of Jesus. Spirit of God, peace be upon you, O heir of Muhammad, the Messenger of God, peace be upon you, O heir of the Commander of the Faithful, Ali, the guardian of God, and the successor of the Messenger of God. Lord of the worlds, peace be upon you, O inheritor of Fatima Al-Zahra, peace be upon you, O inheritor of Al-Hasan and Al-Hussein, the lords of the youth of the people of Paradise, peace be upon you, O heir of the people of Paradise. Ali bin Al-Hussein Zain Al-Abidin, peace be upon you, O heir of Muhammad bin Ali Baqir, the most knowledgeable of the ancients and the lasts, peace be upon you, O heir of Jafar bin Muhammad The truthful and righteous, peace be upon you, O heir of Musa bin Jafar. Peace be upon you, O truthful and martyr. Peace be upon you, O righteous and pious guardian. I bear witness that you have You performed the prayer, paid the zakat, enjoined what was right and forbade what was wrong, and worshiped God sincerely until certainty came to you. Peace be upon you, O Abu Al-Hasan, and the mercy of God. Eh And His blessings. Then she prostrates herself on the grave and says: O God, to You I have steadfastly steadfastly left my land and crossed the country hoping for Your mercy, so do not disappoint me and do not return me without a fulfillment of justice. Come, and have mercy on my heart, upon the grave of my brother’s son, Your Messenger, may your prayers be upon him and his family. For the sake of my father and my mother, I came to you as a visitor, seeking refuge from what I had done to myself. And I burned wood My back, so intercede for me with God on the day of my poverty and poverty, for you will have a praiseworthy position with God and you will be of honor to Him. Then you raise your right hand and extend Al-Usra is on the grave and says: O God, I draw near to You through their love, and by their guardianship I take care of the last of them with what I took care of the first of them, and I disavow all A state without them Oh God, curse those who changed your blessing and accused your prophet and denied your verses and mocked your imam and carried the people on the shoulders of the family of Muhammad. Oh God, I am drawing near. May the curse be upon them and disavowal from them in this world and the hereafter, O Most Merciful.\nThen turn to his feet and say:\nMay God’s blessings be upon you, O Abu Al-Hassan, he prayed May God bless your soul and body. You were patient and you are the truthful and truthful. May God kill whoever kills you with hands and tongues.",
            "DscrpA": "السَّلَامُ عَلَيْكَ يَا وَلِيَّ اللَّهِ، السَّلَامُ عَلَيْكَ يَا حُجَّةَ اللَّهِ، السَّلَامُ عَلَيْكَ يَا نُورَ اللَّهِ فِي ظُلُمَاتِ الْأَرْضِ، السَّلَامُ عَلَيْكَ يَا عَمُودَ الدِّينِ، السَّلَامُ عَلَيْكَ يَا وَارِثَ آدَمَ صَفْوَةِ اللَّهِ، السَّلَامُ عَلَيْكَ يَا وَارِثَ نُوحٍ نَبِيِّ اللَّهِ، السَّلَامُ عَلَيْكَ يَا وَارِثَ إِبْرَاهِيمَ خَلِيلِ اللَّهِ، السَّلَامُ عَلَيْكَ يَا وَارِثَ إِسْمَاعِيلَ ذَبِيحِ اللَّهِ، السَّلَامُ عَلَيْكَ يَا وَارِثَ مُوسَى كَلِيمِ اللَّهِ، السَّلَامُ عَلَيْكَ يَا وَارِثَ عِيسَى رُوحِ اللَّهِ، السَّلَامُ عَلَيْكَ يَا وَارِثَ مُحَمَّدٍ رَسُولِ اللَّهِ، السَّلَامُ عَلَيْكَ يَا وَارِثَ أَمِيرِ الْمُؤْمِنِينَ عَلِيٍّ وَلِيِّ اللَّهِ، وَوَصِيِّ رَسُولِ رَبِّ الْعَالَمِينَ، السَّلَامُ عَلَيْكَ يَا وَارِثَ فَاطِمَةَ الزَّهْرَاءِ، السَّلَامُ عَلَيْكَ يَا وَارِثَ الْحَسَنِ وَالْحُسَيْنِ سَيِّدَيْ شَبَابِ أَهْلِ الْجَنَّةِ، السَّلَامُ عَلَيْكَ يَا وَارِثَ عَلِيِّ بْنِ الْحُسَيْنِ زَيْنِ الْعَابِدِينَ، السَّلَامُ عَلَيْكَ يَا وَارِثَ مُحَمَّدِ بْنِ عَلِيٍّ بَاقِرِ عِلْمِ الْأَوَّلِينَ وَالْآخِرِينَ، السَّلَامُ عَلَيْكَ يَا وَارِثَ جَعْفَرِ بْنِ مُحَمَّدٍ الصَّادِقِ الْبَارِّ، السَّلَامُ عَلَيْكَ يَا وَارِثَ مُوسَى بْنِ جَعْفَرٍ، السَّلَامُ عَلَيْكَ أَيُّهَا الصِّدِّيقُ الشَّهِيدُ، السَّلَامُ عَلَيْكَ أَيُّهَا الْوَصِيُّ الْبَارُّ التَّقِيُّ، أَشْهَدُ أَنَّكَ قَدْ أَقَمْتَ الصَّلَاةَ وَآتَيْتَ الزَّكَاةَ وَأَمَرْتَ بِالْمَعْرُوفِ وَنَهَيْتَ عَنِ الْمُنْكَرِ وَعَبَدْتَ اللَّهَ مُخْلِصاً حَتَّى أَتَاكَ الْيَقِينُ، السَّلَامُ عَلَيْكَ يَا أَبَا الْحَسَنِ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ. \nثُمَّ تَنْكَبُّ عَلَى الْقَبْرِ وَتَقُولُ:\nاللَّهُمَّ إِلَيْكَ صَمَدْتُ مِنْ أَرْضِي وَقَطَعْتُ الْبِلَادَ رَجَاءَ رَحْمَتِكَ، فَلَا تُخَيِّبْنِي وَلَا تَرُدَّنِي بِغَيْرِ قَضَاءِ حَاجَتِي، وَارْحَمْ تَقَلُّبِي عَلَى قَبْرِ ابْنِ أَخِي رَسُولِكَ صَلَوَاتُكَ عَلَيْهِ وَآلِهِ، بِأَبِي أَنْتَ وَأُمِّي أَتَيْتُكَ زَائِراً وَافِداً عَائِذاً مِمَّا جَنَيْتُ عَلَى نَفْسِي وَاحْتَطَبْتُ عَلَى ظَهْرِي، فَكُنْ لِي شَافِعاً إِلَى اللَّهِ يَوْمَ فَقْرِي وَفَاقَتِي فَلَكَ عِنْدَ اللَّهِ مَقَامٌ مَحْمُودٌ وَأَنْتَ عِنْدَهُ وَجِيهٌ.\nثُمَّ تَرْفَعُ يَدَكَ الْيُمْنَى وَتَبْسُطُ الْيُسْرَى عَلَى الْقَبْرِ وَتَقُولُ:\nاللَّهُمَّ إِنِّي أَتَقَرَّبُ إِلَيْكَ بِحُبِّهِمْ، وَبِوَلَايَتِهِمْ أَتَوَلَّى آخِرَهُمْ بِمَا تَوَلَّيْتُ بِهِ أَوَّلَهُمْ، وَأَبْرَأُ مِنْ كُلِّ وَلِيجَةٍ دُونَهُمْ، اللَّهُمَّ الْعَنِ الَّذِينَ بَدَّلُوا نِعْمَتَكَ وَاتَّهَمُوا نَبِيَّكَ وَجَحَدُوا بِآيَاتِكَ وَسَخِرُوا بِإِمَامِكَ وَحَمَلُوا النَّاسَ عَلَى أَكْتَافِ آلِ مُحَمَّدٍ، اللَّهُمَّ إِنِّي أَتَقَرَّبُ إِلَيْكَ بِاللَّعْنَةِ عَلَيْهِمْ وَالْبَرَاءَةِ مِنْهُمْ فِي الدُّنْيَا وَالْآخِرَةِ يَا رَحْمَانُ.\nثُمَّ تَحَوَّلْ إِلَى عِنْدَ رِجْلَيْهِ وَقُلْ:\nصَلَّى اللَّهُ عَلَيْكَ يَا أَبَا الْحَسَنِ، صَلَّى اللَّهُ عَلَى رَوْحِكَ وَبَدَنِكَ، صَبَرْتَ وَأَنْتَ الصَّادِقُ الْمُصَدَّقُ، قَتَلَ اللَّهُ مَنْ قَتَلَكَ بِالْأَيْدِي وَالْأَلْسُنِ."
        },
        {
            "TitleA": "زيارة الإمام علي الهادي (عليه السلام)",
            "TitleE": "The Visit of Imam Ali Al-Hadi (peace be upon him)",
            "DscrpE": "Peace be upon you, O Abu al-Hasan Ali bin Muhammad, the Pure One, the Rightly Guided, the piercing light, and God’s mercy and blessings. Peace be upon you, O my purest God. Peace be upon you, O my secret. God, peace be upon you, O rope of God, peace be upon you, O family of God, peace be upon you, O best of God. Peace be upon you, O elite of God, peace be upon you, O faithful God, peace be upon you, O truth of God, peace be upon you, O beloved of God, peace be upon you, O light of lights, peace be upon you, O beloved of God, peace be upon you, O light of lights, peace be upon you, O O the beauty of the righteous, peace be upon you, O descendant of the good, peace be upon you, O element of the pure, peace be upon you Peace be upon you, O Proof of the Most Gracious, peace be upon you, O pillar of faith, peace be upon you, O Master of the Believers, peace be upon you, O Guardian of the righteous, peace be upon you, O Knower of God. Dey, peace be upon you, O ally of the pious, peace be upon you, O pillar of religion, peace be upon you, O son of the seal of the prophets, peace be upon you O son of the master of guardians, peace be upon you, O son of Fatima Al-Zahra, mistress of the women of the worlds, peace be upon you, O trustworthy and faithful one, peace be upon you, O satisfied knowledge. O, peace be upon you, O pious ascetic, peace be upon you, O argument over all creation, peace be upon you, O follower of the Qur’an, peace be upon you, O The one who shows the solution from the forbidden, peace be upon you, O, the one who is the one who is the one who advises you, peace be upon you, O slave, peace be upon you, peace be upon you, peace be upon you Abu Al -Hassan, you are the Hajj of God for his creation, his successor in his righteousness, and his faithful in his portion, and his witness to his servants, Piety, the gateway to guidance, the most reliable handhold, and the proof for those above the earth and under the earth, and I bear witness that You are the One who is purified from sins. The one who is free from faults, the one entitled to the honor of God, the one loved by the proof of God, the one to whom the word of God was given, the pillar to which the servants resort, and The country is blessed with it, And I bear witness, O my lord, that I am certain of you and your fathers and your sons, and I am certain and approving, and I am a follower of you in my own soul, in the laws of my religion, in the conclusion of my work, in my turning, and in my example. Yes, I am a friend of those who are friends with you and an enemy of those who are enemies with you. I believe in your secrets and your openness, the first of you and the last of you. May my father and mother be sacrificed for you and peace be upon you. And God’s mercy and blessings.",
            "DscrpA": "السَّلَامُ عَلَيْكَ يَا أَبَا الْحَسَنِ عَلِيَّ بْنَ مُحَمَّدٍ الزَّكِيَّ الرَّاشِدَ النُّورَ الثَّاقِبَ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ، السَّلَامُ عَلَيْكَ يَا صَفِيَّ اللهِ، السَّلَامُ عَلَيْكَ يَا سِرَّ اللهِ، السَّلَامُ عَلَيْكَ يَا حَبْلَ اللهِ، السَّلَامُ عَلَيْكَ يَا آلَ اللهِ، السَّلَامُ عَلَيْكَ يَا خِيَرةِ اللهِ، السَّلَامُ عَلَيْكَ يَا صَفْوَةَ اللهِ، السَّلَامُ عَلَيْكَ يَا أَمِينَ اللهِ، السَّلَامُ عَلَيْكَ يَا حَقَّ اللهِ، السَّلَامُ عَلَيْكَ يَا حَبِيبَ اللهِ، السَّلَامُ عَلَيْكَ يَا نُورَ الأَنْوَارِ، السَّلَامُ عَلَيْكَ يَا زَيْنَ الأَبْرَارِ، السَّلَامُ عَلَيْكَ يَا سَلِيلَ الأَخْيَارِ، السَّلَامُ عَلَيْكَ يَا عُنْصُرَ الأَطْهَارِ، السَّلَامُ عَلَيْكَ يَا حُجَّةَ الرَّحْمٰنِ، السَّلَامُ عَلَيْكَ يَا رُكْنَ الإِيمَانِ، السَّلَامُ عَلَيْكَ يَا مَوْلَىٰ الْمُؤْمِنِينَ، السَّلَامُ عَلَيْكَ يَا وَلِيَّ الصَّالِحِينَ، السَّلَامُ عَلَيْكَ يَا عَلَمَ الْهُدَىٰ، السَّلَامُ عَلَيْكَ يَا حَلِيفَ التُّقَىٰ، السَّلَامُ عَلَيْكَ يَا عَمُودَ الدِّينِ، السَّلَامُ عَلَيْكَ يَا بْنَ خَاتَمِ النَّبِيِّينَ، السَّلَامُ عَلَيْكَ يَا بْنَ سَيِّدِ الْوَصِيِّينَ، السَّلَامُ عَلَيْكَ يَا بْنَ فَاطِمَةَ الزَّهْرَاءِ سَيِّدَةِ نِسَاءِ الْعَالَمِينَ، السَّلَامُ عَلَيْكَ أَيُّهَا الأَمِينُ الْوَفِيُّ، السَّلَامُ عَلَيْكَ أَيُّهَا الْعَلَمُ الرَّضِيُّ، السَّلَامُ عَلَيْكَ أَيُّهَا الزَّاهِدُ التَّقِيُّ، السَّلَامُ عَلَيْكَ أَيُّهَا الْحُجَّةُ عَلَىٰ الْخَلْقِ أَجْمَعِينَ، السَّلَامُ عَلَيْكَ أَيُّهَا التَّالِي لِلْقُرْآنِ، السَّلَامُ عَلَيْكَ أَيُّهَا الْمُبَيِّنُ لِلْحَلاَلِ مِنَ الْحَرَامِ، السَّلَامُ عَلَيْكَ أَيُّهَا الْوَلِيُّ النَّاصِحُ، السَّلَامُ عَلَيْكَ أَيُّهَا الطَّرِيقُ الْوَاضِحُ، السَّلَامُ عَلَيْكَ أَيُّهَا النَّجْمُ اللَّائِحُ، أَشْهَدُ يَا مَوْلاَيَ يَا أَبَا الْحَسَنِ أَنَّكَ حُجَّةُ اللهِ عَلَىٰ خَلْقِهِ، وَخَلِيفَتُهُ فِي بَرِيَّتِهِ، وَأَمِينُهُ فِي بِلاَدِهِ، وَشَاهِدُهُ عَلَىٰ عِبَادِهِ، وَأَشْهَدُ أَنَّكَ كَلِمَةُ التَّقْوَىٰ، وَبَابُ الْهُدَىٰ، وَالْعُرْوَةُ الْوُثْقَىٰ، وَالْحُجَّةُ عَلَىٰ مَنْ فَوْقَ الأَرْضِ وَمَنْ تَحْتَ الثَّرَىٰ، وَأَشْهَدُ أَنَّكَ الْمُطَهَّرُ مِنَ الذُّنُوبِ، الْمُبَرَّأُ مِنَ الْعُيُوبِ، وَالْمُخْتَصُّ بِكَرَامَةِ اللهِ، وَالْمَحْبُوُّ بِحُجَّةِ اللهِ، وَالْمَوْهُوبُ لَهُ كَلِمَةُ اللهِ، وَالرُّكْنُ الَّذِي يَلْجَأُ إِلَيْهِ الْعِبَادُ، وَتُحْيَىٰ بِهِ الْبِلاَدُ، وَأَشْهَدُ يَا مَوْلاَيَ أَنِّي بِكَ وَبِآبَائِكَ وَأَبْنَائِكَ مُوقِنٌ مُقِرٌّ، وَلَكُمْ تَابِعٌ فِي ذَاتِ نَفْسِي وَشَرَائِعِ دِينِي وَخَاتِمَةِ عَمَلِي وَمُنْقَلَبِي وَمَثْوَايَ، وَأَنِّي وَلِيٌّ لِمَنْ وَالاَكُمْ وَعَدُوٌّ لِمَنْ عَادَاكُمْ، مُؤْمِنٌ بِسِرِّكُمْ وَعَلاَنِيَتِكُمْ وَأَوَّلِكُمْ وَآخِرِكُمْ بِأَبِي أَنْتَ وَأُمِّي وَالسَّلَامُ عَلَيْكَ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ."
        },
        {
            "TitleA": "زيارة الإمام الحسن العسكري (عليه السلام)",
            "TitleE": "The Visit of Imam Hassan Al-Askari (peace be upon him)",
            "DscrpE": "Peace be upon you, O my master, Abu Muhammad al-Hasan bin Ali, the guide, the guided one, and God’s mercy and blessings. Peace be upon you, O guardian of God and the son of His friends. Peace be upon me. You are the proof of God and the son of His proofs. Peace be upon you, O the purest of God and the son of His pure ones. Peace be upon you, O the successor of God. And the son of his successors and the father of his successors. Peace be upon you, O son of the Seal of the Prophets. Peace be upon you, O son of the Master of the Guardians. Peace be upon you, O son of the Commander of the Faithful. Peace be upon you. Peace be upon you, O son of the mistress of the women of the worlds. Peace be upon you, O son of the guided imams. Peace be upon you, O son of the rightly guided guardians. Peace be upon you. O protector of the righteous, peace be upon you, O Imam of the victorious, peace be upon you, O pillar of the believers, peace be upon you, O relief of the anxious, peace be upon you, O inheritor of the prophets. The chosen ones, peace be upon you, keeper of the knowledge and guardian of the Messenger of God, peace be upon you, oh caller of the judgment of God, peace be upon you, oh speaker of the Book God, peace be upon you, O Proof of Proofs, peace be upon you, O Guide of Nations, peace be upon you, O Granter of bounties, peace be upon you, O source of knowledge, peace be upon you, O ship of dreams. Peace be upon you, O father of the Awaited Imam, whose proof is apparent to the rational person, whose knowledge is established in certainty, who is hidden from The eyes of the oppressors, and the one who hides from the state of the transgressors, and with whom our Lord will bring back Islam new after it was obliterated, and the Qur’an fresh after being erased. I bear witness, O M. And that you established prayer and paid zakat, enjoined what was right and forbade what was wrong, and called to the way of your Lord with wisdom and beautiful exhortation, and You turned to God sincerely until certainty came to you I ask God, regarding the matter you have with Him, to accept my visit to you, to thank me for seeking you, to answer my prayers for you, and to make me a supporter of the truth and His followers, his followers, his loyalists, and his lovers, and may God’s peace, mercy, and blessings be upon you..",
            "DscrpA": "السَّلامُ عَلَيْكَ يا مَوْلايَ يا أَبا مُحَمَّدٍ الْحَسَنَ بْنَ عَلِيٍّ الْهادِيَ الْمُهْتَدِيَ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ، اَلسَّلامُ عَلَيْكَ يا وَلِيَّ اللهِ وَابْنَ أَوْلِيائِهِ، اَلسَّلامُ عَلَيْكَ يا حُجَّةَ اللهِ وَابْنَ حُجَجِهِ، اَلسَّلامُ عَلَيْكَ يا صَفِيَّ اللهِ وَابْنَ أَصْفِيائِهِ، اَلسَّلامُ عَلَيْكَ يا خَليفَةَ اللهِ وَابْنَ خُلَفائِهِ وَأَبا خَليفَتِهِ، اَلسَّلامُ عَلَيْكَ يَا بْنَ خاتَمِ النَّبِيِّينَ، اَلسَّلامُ عَلَيْكَ يَا بْنَ سَيِّدِ الْوَصِيِّينَ، اَلسَّلامُ عَلَيْكَ يَا بْنَ أَميرِ الْمُؤْمِنِينَ، اَلسَّلامُ عَلَيْكَ يَا بْنَ سَيِّدَةِ نِساءِ الْعالَمِينَ، اَلسَّلامُ عَلَيْكَ يَا ابْنَ الأَئِمَّةِ الْهَادِينَ، اَلسَّلامُ عَلَيْكَ يَا بْنَ الأَوْصِياءِ الرّاشِدِينَ، اَلسَّلامُ عَلَيْكَ يا عِصْمَةَ الْمُتَّقِينَ، اَلسَّلامُ عَلَيْكَ يا إِمَامَ الْفائِزِينَ، اَلسَّلامُ عَلَيْكَ يا رُكْنَ الْمُؤْمِنِينَ، اَلسَّلامُ عَلَيْكَ يا فَرَجَ الْمَلْهُوفِينَ، اَلسَّلامُ عَلَيْكَ يا وارِثَ الْأَنْبِياءِ الْمُنْتَجَبِينَ، اَلسَّلامُ عَلَيْكَ يا خازِنَ عِلْمِ وَصِيِّ رَسُولِ اللهِ، اَلسَّلامُ عَلَيْكَ أَيُّهَا الدّاعِي بِحُكْمِ اللهِ، اَلسَّلامُ عَلَيْكَ أَيُّهَا النّاطِقُ بِكِتابِ اللهِ، اَلسَّلامُ عَلَيْكَ يا حُجَّةَ الْحُجَجِ، اَلسَّلامُ عَلَيْكَ يا هادِيَ الأُمَمِ، اَلسَّلامُ عَلَيْكَ يا وَلِيَّ النِّعَمِ، اَلسَّلامُ عَلَيْكَ يا عَيْبَةَ الْعِلْمِ، اَلسَّلامُ عَلَيْكَ يا سَفينَةَ الْحِلْمِ، اَلسَّلامُ عَلَيْكَ يا أَبَا الإِمامِ الْمُنْتَظَرِ، الظّاهِرَةِ لِلْعاقِلِ حُجَّتُهُ، وَالثّابِتَةِ فِي الْيَقينِ مَعْرِفَتُهُ، الْمُحْتَجَبِ عَنْ أَعْيُنِ الظّالِمينَ، وَالْمُغَيَّبِ عَنْ دَوْلَةِ الْفاسِقِينَ، وَالْمُعِيدِ رَبُّنا بِهِ الإِسْلامَ جَديداً بَعْدَ الْانْطِماسِ، وَالْقُرْآنَ غَضّاً بَعْدَ الْانْدِراسِ، أَشْهَدُ يا مَوْلايَ أَنَّكَ أَقَمْتَ الصّلاةَ وَآتَيْتَ الزَّكاةَ، وَأَمَرْتَ بِالْمَعْرُوفِ وَنَهَيْتَ عَنِ الْمُنْكَرِ، وَدَعَوْتَ إِلى سَبيلِ رَبِّكَ بِالْحِكْمَةِ وَالْمَوْعِظَةِ الْحَسَنَةِ، وَعَبَدْتَ اللهَ مُخْلِصاً حَتّى أَتَاكَ الْيَقينُ، أَسْأَلُ اللهَ بِالشَّأنِ الَّذي لَكُمْ عِنْدَهُ أَنْ يَتَقَبَّلَ زِيارَتِي لَكُمْ، وَيَشْكُرَ سَعْيِي إِلَيْكُمْ، وَيَسْتَجيبَ دُعَائِي بِكُمْ، وَيَجْعَلَنِي مِنْ أَنْصَارِ الْحَقِّ وَأَتْباعِهِ وَأَشْياعِهِ وَمَواليهِ وَمُحِبّيهِ، وَالسَّلامُ عَلَيْكَ وَرَحْمَةُ اللهِ وَبَرَكاتُهُ.."
        },
        {
            "TitleA": "زيارة آل ياسين",
            "TitleE": "Visit of Al Yassin",
            "DscrpE": "Peace be upon the family of Yaseen. Peace be upon you, O caller of God and Lord of His verses. Peace be upon you, O door of God and judge of His religion. Peace be upon you, O successor of God and supporter of His truth. Peace be upon you, O The proof of God and the evidence of His will. Peace be upon you, O one who reads the Book of God and its interpreters. Peace be upon you in the hours of your night and the ends of your day. Peace be upon you, O remnant of God on His earth. Peace be upon you, O covenant of God which He took and confirmed. Peace be upon you, O promise of God which He guaranteed. Peace be upon you. To You is the knowledge that is set forth and the knowledge that is cast down, and the help and mercy that is vast is a promise that is not false. Peace be upon you. When you stand, peace be upon you when you sit, peace be upon you when you recite and explain, peace be upon you when you pray and do well, peace be upon you when you kneel and prostrate, peace be upon you when you chant Allah and say “Allahu Akbar,” peace be upon you when you bow and prostrate. Peace be upon you when you praise and ask for forgiveness, peace be upon you when it becomes dark in the morning and evening, peace be upon you in the night when darkness falls. And when the day dawns, peace be upon you, O trustworthy Imam, peace be upon you, O hoped-for forerunner, peace be upon you with all the sums of peace, I call you as witness, my lord, that I bear witness that there is no god but God alone, no one else. Your opinion is for him, and that Muhammad is his servant and messenger, there is no lover but him and his family, and I bear witness to you, my lord. Ali, the Commander of the Faithful, is his proof, and Al-Hasan is his proof, and Al-Hussein is his proof, and Ali bin Al-Hussein is his proof, and Muhammad bin Ali is his proof, and Jafar bin Muhammad is his proof, and Musa bin Ja’ Far is his proof, Ali bin Musa is his proof, Muhammad bin Ali is his proof, Ali bin Muhammad is his proof, and Al-Hasan bin Ali is his proof. His proof, and I bear witness that you are the proof of God, you are the first and the last, and that your return is true, there is no doubt about it on a day when no soul will benefit from its belief if it did not believe before, or it is gained. There is good in her faith, and that death is true, and that the ungrateful and ungrateful are true, and I bear witness that resurrection is true, and resurrection is true, and that the path is true, and the lookout is true. True, and the balance is true, and the gathering is true, and the reckoning is true, and Paradise and Hell are true, and the promise and threat therein are true. O my Lord, wretched is he who opposes you, and happy is he who is He obeyed you, so bear witness to what I testified to you, and I am your guardian, disassociated from your enemy. For truth is what you have pleased with it and falsehood is what you have displeased with, and what is right is what you have been commanded to do and from Karma You have forbidden it, for my soul believes in God alone, with no partner, in His Messenger, and in the Commander of the Faithful, and in you, O my master, the first of you and the last of you, and my support is prepared for you and My sincere affection for you, Amen, Amen..",
            "DscrpA": "سَلامٌ عَلى آلِ يسٓ، السَّلامُ عَلَيكَ يَا دَاعِيَ اللهِ وَرَبَّانيَّ آيَاتِهِ، السَّلامُ عَلَيكَ يا بَابَ اللهِ وَدَيَّانَ دِينِهِ، السَّلامُ عَلَيكَ يَا خَلِيفَةَ اللهِ وَناصِرَ حَقِّهِ، السَّلامُ عَليكَ يَا حُجَّةَ اللهِ وَدَلِيلَ إرادَتِهِ، السَّلامُ عَلَيكَ يَا تَالِيَ كِتَابِ اللهِ وتَرجُمَانَهُ، السَّلامُ عَلَيكَ فِي آناءِ لَيْلِكَ وَأطرافِ نَهارِكَ، السَّلامُ عَلَيكَ يا بَقِيَّةَ اللهِ فِي أَرْضِهِ، السَّلامُ عَلَيكَ يا مِيثاقَ اللهِ الذي أَخَذَهُ وَوَكَّدَهُ، السَّلامُ عَلَيكَ يا وَعْدَ اللهِ الَّذي ضَمِنَهُ، السَّلامُ عَلَيكَ أيُّها العَلَمُ المَنْصُوبُ وَالعِلْمُ المَصْبُوبُ، وَالغَوْثُ وَالرَّحْمَةُ الواسِعَةُ وَعْداً غَيْرَ مَكْذُوبٍ، السَّلامُ عَلَيكَ حِينَ تقُومُ، السَّلامُ عَليكَ حِينَ تَقعُدُ، السَّلامُ عَليكَ حين تَقْرَأُ وَتُبَيِّنُ، السَّلامُ عَليكَ حِينَ تُصَلِّي وَتَقنُتُ، السَّلامُ عَلَيكَ حِينَ تَركعُ وَتَسْجُدُ، السَّلامُ عَلَيكَ حِينَ تُهلِّلُ وَتُكبِّرُ، السَّلامُ عَلَيكَ حينَ تَحْمَدُ وَتَسْتَغْفِرُ، السَّلامُ عَلَيكَ حين تُصْبِحُ وَتُمْسِي، السَّلامُ عَلَيْكَ فِي اللَّيلِ إذا يَغْشَى وَالنَّهارِ إذا تَجَلَّى، السَّلامُ عَلَيكَ أيُّها الإمامُ المَأمُونُ، السَّلامُ عَليكَ أيُّها المُقَدَّمُ المَأْمُولُ، السَّلامُ عَلَيكَ بِجَوَامِعِ السَّلامِ، أُشْهِدُكَ يا مَوْلايَ أنِّي أَشْهَدُ أنْ لا إله إلّا اللهُ وَحدَهُ لا شَريكَ لهُ، وأنَّ مُحمَّداً عبدُهُ ورسُولهُ، لا حَبِيبَ إلّا هُو وَأهلُهُ، وأُشْهِدُكَ يا مَوْلايَ أنَّ عليّاً أميرَ المُؤمِنِينَ حُجَّتُهُ، وَالحَسَنَ حُجَّتُهُ، وَالحُسَيْنَ حُجَّتُهُ، وَعَلِيَّ بنَ الحُسَيْنِ حُجَّتُهُ، وَمُحَمَّدَ بنَ عَلِيٍّ حُجَّتُهُ، وَجَعْفَرَ بنَ مُحَمَّدٍ حُجَّتُهُ، وَمُوسَى بنَ جَعْفَرٍ حُجَّتُهُ، وَعَلِيَّ بنَ مُوسَى حُجَّتُهُ، وَمُحَمَّدَ بنَ عَلِيٍّ حُجَّتُهُ، وَعَلِيَّ بنَ مُحَمَّدٍ حُجَّتُهُ، وَالحَسَنَ بنَ عليٍّ حُجَّتُهُ، وَأَشْهَدُ أنَّكَ حُجَّةُ اللهِ، أنْتُمُ الأَوَّلُ وَالآخِرُ وَأنَّ رَجْعَتَكُمْ حَقٌّ لا رَيْبَ فيها يَوْمَ لا يَنْفَعُ نَفْساً إيْمانُها لَمْ تكُنْ آمَنَتْ مِنْ قَبْلُ، أَوْ كَسَبَتْ فِي إيْمانِهَا خَيْراً، وَأنَّ المَوْتَ حَقٌّ وَأنَّ نَاكِراً وَنَكِيراً حَقٌّ وَأَشْهَدُ أنَّ النَّشْرَ حَقٌّ وَالبَعْثَ حَقٌّ وَأَنَّ الصِّرَاطَ حَقٌّ وَالمِرْصَادَ حَقٌّ وَالمِيزَانَ حَقٌّ وَالْحَشْرَ حَقٌّ وَالحِسَابَ حَقٌّ وَالجَنَّةَ وَالنّارَ حَقٌّ وَالوَعْدَ وَالوَعِيدَ بِهِما حَقٌّ، يا مَوْلَاي شَقِيَ مَنْ خالَفَكُمْ وَسَعِدَ مَنْ أَطَاعَكُمْ، فَاشْهَدْ عَلى مَا أشْهَدْتُكَ عَلَيْهِ، وَأَنَا وَلِيٌّ لكَ برِيءٌ مِنْ عَدُوِّكَ، فَالحَقُّ ما رَضِيتُمُوهُ وَالباطِلُ مَا أسْخَطْتُمُوهُ، وَالمَعْرُوفُ مَا أَمَرْتُمْ بهِ وَالمُنْكَرُ مَا نَهَيْتُمْ عَنْهُ، فَنَفْسِي مُؤْمِنَةٌ بِالله وَحْدَهُ لا شَرِيكَ لهُ وَبِرسولهِ وَبأمير المُؤْمِنِينَ، وَبِكُمْ يَا مَوْلايَ أَوَّلِكُمْ وَآخِرِكُمْ، وَنُصْرَتي مُعَدَّةٌ لكُمْ وَمَوَدَّتِي خَالِصَةٌ لَكُمْ، آمِينَ آمِينَ.."
        }
    ]
}